{
  "name": "Apple Tarte Tatin",
  "categories": [],
  "servings": 8,
  "minutes": 90,
  "source_url": "https://cooking.nytimes.com/recipes/10505-apple-tarte-tatin",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/10.jpg?1"
  ],
  "ingredients": [
    {
      "name": "large granny smith apples",
      "amount": 8.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tarte tatin pastry see recipe",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Preheat oven to 375 degrees. Position rack in bottom third of oven. Peel, quarter and core the apples. Place in a large mixing bowl and toss with the lemon juice. Set aside.",
    "Place the sugar in a 10-inch skillet or tarte Tatin pan over low heat. When some of the sugar begins to melt, begin stirring with a wooden spoon until all the sugar is melted and begins to turn a pale golden color.",
    "Remove the pan from the heat. Begin arranging apple pieces in the skillet, rounded side down, in concentric circles, fitting them together as close as possible. Fill the center with 2 or 3 apple pieces, as needed. Arrange the remaining pieces, rounded side up, in concentric circles, filling in the gaps left in the first layer.",
    "Cut the butter into small pieces and scatter over the apples. Place the pan over medium heat. Cook until the sugar turns a deep caramel color and the juices released from the apples are nearly evaporated, about 15 to 20 minutes.",
    "Roll the dough and cover the apples according to the directions in the pastry recipe. Bake until the crust is golden brown, about 25 to 30 minutes. Remove from oven and set aside for 10 minutes.",
    "Run a small, sharp knife around the edge of the tarte to loosen. Place a large plate or platter over the skillet. Holding the plate and skillet together using 2 kitchen towels, carefully but quickly invert the tarte onto the plate. Let stand a few minutes to cool slightly. Cut into wedges and serve with creme fraiche if desired."
  ],
  "notes": [],
  "nutrition_infos": []
}