{
  "name": "Baklava",
  "categories": [],
  "servings": 50,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/baklava-58386738",
  "image_urls": [
    "/verso/static/epicurious/assets/fallback-image-placeholder.jpeg"
  ],
  "ingredients": [
    {
      "name": "honey",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "about 1 1 2 pounds walnuts",
      "amount": 6.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "4 sticks butter",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "phyllo dough",
      "amount": 2.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Combine the honey, 3 cups sugar, and the lemon juice with 2 1/2 cups water and bring to a boil. Stir to melt the sugar and chill. (This can be done hours, days, even weeks in advance.)",
    "Chop the nuts (the food processor makes quick work of this: be sure to pulse, not blend—you don’t want puree). Combine with the 7 tablespoons sugar and the cinnamon.",
    "Brush the pan’s bottom with butter; lay 7 sheets of phyllo on it, the narrow way, overlapping slightly and with alternating ends hanging over the edges. Brush the phyllo with butter and sprinkle with about 1/4 cup of the nut mixture. Fold over the ends; if you overlap and alternate in a coordinated fashion, the ends will meet or overlap and you will completely cover the filling. Brush with butter and sprinkle with nuts, then repeat with 7 more sheets. Repeat until only 10 or 11 sheets remain, and do these sheets in the same manner, but only buttering them (you will have used up the nuts by now).",
    "Refrigerate for about an hour, longer if you prefer. Preheat the oven to 300°F. Score the top of the sheets, first lengthwise, then widthwise, and finally diagonally, to make about 50 triangles. Bake for about 1 hour, until golden brown."
  ],
  "notes": [],
  "nutrition_infos": []
}