{
  "name": "Basic Dough",
  "categories": [],
  "servings": 4,
  "minutes": 145,
  "source_url": "https://cooking.nytimes.com/recipes/10816-basic-dough",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/1.jpg?1"
  ],
  "ingredients": [
    {
      "name": "warm water",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "4 ounce active dry yeast",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "to 3 cups all-purpose flour",
      "amount": 1.6666666666666667,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil for pan about 1 teaspoon",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cornmeal for coating pan",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Combine the water and yeast in a mixing bowl, and stir until the yeast dissolves. Stir in a cup of the flour; then, stir in a second cup and the salt. Sprinkle some of the remaining flour over a work surface and your hands. Scrape the dough out of the bowl and onto the work surface. Gradually knead in additional flour, until the dough no longer feels sticky.",
    "Lightly oil a large bowl. Shape the dough into a ball, and rotate it in the bowl to coat it with oil. Cover the bowl tightly with plastic wrap, and set in a warm, draft-free place until doubled in bulk, about 1 hour. Punch the dough down and knead it for about 1 minute. Return the dough to the bowl and let rise until doubled again, about 45 minutes. Punch down the dough.",
    "Preheat oven to 425 degrees. On a lightly floured surface, roll the dough into a 12-inch circle if making pizza or a 10-inch circle if making focaccia. Stop and let the dough rest for a few minutes when it becomes too elastic to roll. Sprinkle a large baking sheet with cornmeal and slide the dough onto it. Top the dough as desired, and bake until the crust is golden brown, about 20 minutes. Cut into wedges, and serve hot."
  ],
  "notes": [],
  "nutrition_infos": []
}