{
  "name": "Blueberry Pie",
  "categories": [],
  "servings": null,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/blueberry-pie-52859021",
  "image_urls": [
    "https://assets.epicurious.com/photos/645a698d375c227e8c54b099/16:9/w_6194,h_3484,c_limit/BlueberryPie_RECIPE_050823_54380.jpg",
    "https://assets.epicurious.com/photos/645a698d375c227e8c54b099/4:3/w_5479,h_4109,c_limit/BlueberryPie_RECIPE_050823_54380.jpg",
    "https://assets.epicurious.com/photos/645a698d375c227e8c54b099/1:1/w_4541,h_4541,c_limit/BlueberryPie_RECIPE_050823_54380.jpg"
  ],
  "ingredients": [
    {
      "name": "fresh blueberries about 3 pints",
      "amount": 12.5,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "honey",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "32 g cornstarch",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "chilled disks of our favorite pie crust",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "all-purpose flour for surface",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Thinly slice ½ medium lemon, halved; remove and discard seeds. Very finely chop lemon (all of it!) until it almost forms a paste; transfer to a large bowl. Add 2¼ lb. fresh blueberries (about 3 pints), rinsed, patted dry, ½ cup (100 g) granulated sugar, ¼ cup honey, ¼ cup (32 g) cornstarch, 1 tsp. Diamond Crystal or ½ tsp. Morton kosher salt, and ½ tsp. ground cinnamon; mix gently to evenly coat blueberries.",
    "Place a rack in bottom third of oven and set a rimmed baking sheet on rack; preheat oven to 400°. Working one at a time, roll out 2 chilled disks of Our Favorite Pie Crust on a surface lightly dusted with all-purpose flour to 11\" rounds about ⅛\" thick. Carefully transfer 1 round to a 9\"-diameter pie pan, preferably metal. Lift edges and allow dough to slump down into pan. Trim, leaving 1\" overhang. Cut remaining dough round into five 2\"-wide strips.",
    "Scrape blueberry filling into crust, slightly mounding in the center. Decoratively arrange dough strips over filling in a tight zigzag pattern, overlapping slightly. Trim strips if needed; fold overhang of bottom crust over and crimp to seal. Chill pie in freezer 20 minutes.",
    "Beat 1 large egg and 1 Tbsp. water in a small bowl. Brush top of crust with egg wash, then sprinkle raw or other coarse sugar over. Place pie on preheated baking sheet and bake until crust is golden on top, 30–35 minutes. Rotate pan front to back and reduce oven temperature to 350°. Continue to bake, tenting edges with foil if browning too quickly, until filling is bubbling vigorously and crust is deep golden brown, 45–60 minutes more. Let pie cool on baking sheet, about 2 hours.",
    "Serve pie with vanilla ice cream or whipped cream if desired.\nDo Ahead: Pie can be baked 1 day ahead. Store loosely covered with foil at room temperature. Reheat, covered, in a 325° oven until warmed through if desired."
  ],
  "notes": [],
  "nutrition_infos": []
}