{
  "name": "Braised Onions and Chestnuts",
  "categories": [],
  "servings": 7,
  "minutes": 105,
  "source_url": "https://cooking.nytimes.com/recipes/10269-braised-onions-and-chestnuts",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/14.jpg?1"
  ],
  "ingredients": [
    {
      "name": "chestnuts",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small white onions",
      "amount": 2.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "corn oil",
      "amount": 1.3333333333333333,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "glace de vi",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "red wine",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "With a sharp knife, cut a cross in the rounded side of each chestnut. Bring a large pan of water to a boil. Immerse chestnuts, and let boil for about 3 minutes. Turn off heat, but leave chestnuts in hot water. Extract them one at a time, and remove shell and inner lining that clings to the meat. If necessary, return nuts to hot water, and boil another minute or two. When all chestnuts have been peeled, set them aside.",
    "Cut off onion tops. Trim root end to make a neat appearance, but leave enough of it intact to hold the onions together while cooking. Peel onions.",
    "In wide casserole or deep saute pan that can go into the oven, melt butter in corn oil. When butter foam has subsided, add onions, and cook over medium heat 10 to 15 minutes, turning frequently, to brown all over.",
    "Add chestnuts to onions and mix well. Add glace de viande, wine and black pepper. When wine is bubbling, place a round of buttered aluminum foil directly over chestnuts and onions, cover pan, and place in a 350-degree oven. Bake for 45 minutes to 1 hour, or until onions can be pierced through with a knife but are still firm and hold their shape. There should be a small amount of syrupy liquid in the bottom of the pan. If there is too much, place over medium-high heat for a few minutes to reduce. Serve immediately."
  ],
  "notes": [],
  "nutrition_infos": []
}