{
  "name": "Butter-Braised Cardoons With Mushrooms and Bread Crumbs",
  "categories": [],
  "servings": 4,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1017335-butter-braised-cardoons-with-mushrooms-and-bread-crumbs",
  "image_urls": [
    "https://static01.nyt.com/images/2015/04/08/dining/08CARDOONS/08CARDOONS-square640.jpg",
    "https://static01.nyt.com/images/2015/04/08/dining/08CARDOONS/08CARDOONS-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "slender cardoon stalks",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large clove garlic",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large shiitake caps only or other mushrooms",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "lightly packed fresh coarse bread crumbs",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Bring a large pot of water to boil and salt it moderately. Strip the cardoons of leaves and string as you would celery. Cut each stalk lengthwise into 2 or 3 long strips, then crosswise into 2-inch lengths. You’ll have about 3 cups. Squeeze the lemon juice into the water and boil the cardoons until fairly tender, 10 to 12 minutes; drain and rinse.",
    "Melt the butter over medium heat in a skillet wide enough to accommodate the cardoons comfortably. When the foam subsides, add the cardoons, reduce the heat to medium-low and cook, stirring occasionally, until they take on a bit of color, 10 to 12 minutes. Add the garlic and mushrooms and continue to cook until the mushrooms are mostly tender, 5 minutes. Add the bread crumbs and a pinch of salt and raise the heat to medium-high; cook, stirring occasionally, until the bread crumbs brown a bit and the cardoons are fully tender and sweet, 5 minutes longer.",
    "Squeeze a bit of lemon juice over the top, taste for salt, add pepper to taste and serve hot or warm."
  ],
  "notes": [],
  "nutrition_infos": []
}