{
  "name": "Cabbage Rolls With Walnuts and Sour Cream",
  "categories": [],
  "servings": 4,
  "minutes": 150,
  "source_url": "https://cooking.nytimes.com/recipes/1023909-cabbage-rolls-with-walnuts-and-sour-cream",
  "image_urls": [
    "https://static01.nyt.com/images/2023/03/19/magazine/19mag-eat-site/19mag-eat-site-square640.jpg",
    "https://static01.nyt.com/images/2023/03/19/magazine/19mag-eat-site/19mag-eat-site-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/03/19/magazine/19mag-eat-site/19mag-eat-site-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "medium yellow onions about 1 pound",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "/2 pounds",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "00 grams walnuts",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pine nuts",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "packed cup finely chopped fresh dill",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "heaping cup sour cream",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Place the onions, 1/2 cup butter and 1 1/2 teaspoons of salt in a medium saucepan. Cook over medium heat for 25 to 30 minutes, stirring occasionally, until softened and browned. ",
    "While the onions cook, bring a large pot of salted water to a boil over high. Prepare the cabbage: Remove the very dark green outer leaves and save them for another use. Use a small knife to cut around the stem of the cabbage to release the base of the leaves; discard the core. Carefully peel off 12 leaves, taking care not to rip them. Set aside the remaining cabbage for later. Place the 12 leaves into the pot of boiling water and blanch for 2 minutes. Using tongs, remove the cabbage leaves and transfer to a large colander. Place in the sink under cold running water to cool down, then leave to strain.",
    "Once the onions are cooked, add the spices, walnuts and pine nuts and cook for another 5 minutes, stirring occasionally, until fragrant and lightly toasted. Place a heatproof sieve over a small saucepan and strain the mixture, reserving the spiced butter. Transfer the strained onion mixture to a medium bowl; combine with the parsley and dill, then set aside. ",
    "Heat the oven to 375 degrees. Finely slice about 4 cups of the remaining unblanched cabbage and place it in a 9-by-13-inch baking dish. To fill the cabbage rolls, place the blanched leaves on a chopping board, stem side up. Use a peeler or a small sharp knife to shave the stem along its length so that it’s no longer raised and is level with the leaf. Divide the onion mixture into 12 portions (about 2 tablespoons each). With the stem side of a cabbage leaf facing you, place one portion of filling in the center of each leaf so it’s perpendicular to the stem. Bring the base and then the sides into the center, then roll the cabbage leaves all the way up to seal. Place each roll into the baking dish, seam side down, then pour over the lemon juice, dot with the remaining 1/4 cup plain butter and sprinkle with 1/2 teaspoon salt.",
    "Cover the dish tightly with foil and bake the cabbage rolls for 1 hour. Remove the foil then return to the oven for about 20 minutes more, until nicely browned. Remove from the oven and allow to cool for 10 minutes.",
    "While the cabbage is cooling, add the sour cream to a small saucepan and heat over medium for 3 minutes, stirring constantly, to loosen and warm through. Don’t let it bubble at all; you don’t want it to split. At the same time, gently reheat the spiced butter in its saucepan until melted. Next, pour the sour cream into the cabbage roll dish; avoid pouring it directly on top of the rolls. Shake the dish gently to mix the sour cream in, then pour the spiced butter over the cabbage rolls. Sprinkle with the extra dill, season with a good grind of black pepper and serve directly from the baking dish."
  ],
  "notes": [],
  "nutrition_infos": []
}