{
  "name": "Candied Orange Peels",
  "categories": [],
  "servings": 33,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/candied-orange-peels-52961921",
  "image_urls": [
    "/verso/static/epicurious/assets/fallback-image-placeholder.jpeg"
  ],
  "ingredients": [
    {
      "name": "small",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "original_string": "6 small or 5 medium blemish-free, thick-skinned oranges, preferably California navels",
      "nutrition_infos": []
    },
    {
      "name": "cups",
      "amount": 1.6666666666666665,
      "unit": "",
      "comment": "",
      "original_string": "1 2/3 cups plus 1/4 cup sugar",
      "nutrition_infos": []
    },
    {
      "name": "cup",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "original_string": "3/4 cup plus 2 tablespoons water",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Use a small, sharp knife to trim 1/4 to 1/2 inch from both ends of each orange. Reveal some flesh to make removing the peel easier. Then make cuts, from top to bottom and at 1-inch intervals, around each orange. Make sure the knife goes through the peel and pith down to the flesh. Use your fingers to remove the peel from the orange in beautiful, discrete sections. Cut the each section lengthwise into 1/3-inch-wide strips.",
    "Put the peels into a saucepan and add enough water so that they float. Cover with a lid or plastic wrap and refrigerate overnight.",
    "Uncover and drain the peels. Return them to the saucepan and again add enough water so the peels float. Bring to a boil over medium heat and then drain. This mellows the harsh flavor of the peels.",
    "To candy the peels, use a wide, high-sided skillet (like a chicken fryer) that can accommodate them in a single layer. Put a wire rack on a baking sheet and place the baking sheet nearby for drying the finished strips. Put the 1 2/3 cups sugar and all the water into the skillet. Bring to a boil over medium heat, stirring to dissolve the sugar. Add the peels, lower the heat to a simmer, and cook for 25 to 30 minutes, or until they look glazed and shiny. Occasionally stir the peels or swirl the pan to ensure even cooking, and lower the heat as needed to prevent scorching. During candying, the plump peels will shrink, straighten out, and soften. The white pith will turn golden and somewhat translucent. Use tongs to transfer each strip to the rack, placing them orange side up and not touching. Discard the sugar syrup. Allow the peels to dry for about 1 hour, or until they feel tacky.",
    "To coat the peels, put the 1/4 cup sugar into a small bowl. Drop in a few strips at a time and shake the bowl back and forth to coat them well. Transfer to a plate and then repeat with the remaining peels. When all the strips are coated, put them into an airtight container and store at room temperature for up to a week."
  ],
  "notes": [],
  "nutrition_infos": []
}