{
  "name": "Caramelized Lemon Chicken",
  "categories": [],
  "servings": 4,
  "minutes": 70,
  "source_url": "https://cooking.nytimes.com/recipes/1023121-caramelized-lemon-chicken",
  "image_urls": [
    "https://static01.nyt.com/images/2022/04/11/dining/as-lemon-chicken/as-lemon-chicken-square640.jpg",
    "https://static01.nyt.com/images/2022/04/11/dining/as-lemon-chicken/as-lemon-chicken-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/04/11/dining/as-lemon-chicken/merlin_203821098_205528bc-fabb-4ef9-b7cb-372fcc22d9bc-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "/2 pounds",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 400 degrees. Season the lemon curd with 2 teaspoons salt and 1 teaspoon black pepper.",
    "To butterfly the chicken, place the chicken on a cutting board, breast side down. Using sharp kitchen shears, remove the backbone by cutting on either side of the backbone. (Save the backbone for stock.) Flip the chicken, setting it breast side up, and flatten by pressing firmly in the center; you should hear a crack.",
    "Pat chicken dry. Season the chicken on both sides with 2 teaspoons salt and a generous grind of black pepper. Use the handle of a fork or spoon to loosen the skin from the chicken breasts and thighs (you’ll find openings at their tops).",
    "Spread about three-quarters of the lemon curd between the skin and meat. Use your fingers to massage the curd around so it spreads out under the skin. Spread the rest of the lemon curd in a thin layer all over the chicken skin. Drizzle with the olive oil.",
    "Pour 3/4 cup water into a large (at least 12-inch) oven-safe skillet, shallow roasting pan or sheet pan. (The water keeps the pan drippings from burning and keeps the chicken moist.) Add the chicken, skin side up. Tuck the wings under to prevent burning and turn the legs so the thighs face up. Roast until a thermometer registers 165 degrees in the thickest part of the thigh, 45 minutes to 1 hour, starting to check the chicken at 30 minutes. If at any point it starts getting too brown, cover it with foil. Let rest 10 minutes before carving."
  ],
  "notes": [],
  "nutrition_infos": []
}