{
  "name": "Cheesecake Pudding",
  "categories": [],
  "servings": 8,
  "minutes": 45,
  "source_url": "https://cooking.nytimes.com/recipes/1020042-cheesecake-pudding",
  "image_urls": [
    "https://static01.nyt.com/images/2019/02/25/dining/em-cheesecake-pudding/em-cheesecake-pudding-square640.jpg",
    "https://static01.nyt.com/images/2019/02/25/dining/em-cheesecake-pudding/em-cheesecake-pudding-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/02/25/dining/em-cheesecake-pudding/em-cheesecake-pudding-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/560 milliliters whole milk",
      "amount": 2.3333333333333335,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/80 milliliters heavy cream",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/30 grams cornstarch",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ounces/340 grams cream cheese",
      "amount": 12.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium saucepan, whisk the milk, heavy cream, lemon zest, salt and 1/4 cup/50 grams sugar until combined. Place the saucepan over medium heat and bring to a simmer, stirring occasionally.",
    "While the mixture heats, whisk the remaining 1/2 cup/100 grams sugar and the cornstarch in a medium, heat-safe bowl. Add the egg yolks and whisk until the mixture forms a thick paste.",
    "When the milk mixture comes to a simmer, remove it from the heat. Whisking constantly, gradually add about a third of the hot milk mixture to the egg-yolk mixture in a slow, steady stream until combined. Transfer the contents of the bowl to the saucepan and whisk well to combine.",
    "Heat over medium-low and cook, whisking constantly, until the mixture begins to thicken, 6 to 8 minutes. (Once the mixture thickens, you may find it easier to switch to a silicone spatula for stirring.) Continue to cook, stirring constantly, until the mixture comes to a boil with large bubbles breaking at the surface, 2 to 3 minutes.",
    "Remove the saucepan from the heat, and whisk in the cream cheese and the vanilla. Strain the mixture through a fine-mesh sieve into a heat-safe bowl. Place plastic wrap directly on the surface of the pudding (this prevents a “skin” from forming) and refrigerate until chilled, at least 1 hour.",
    "Serve the pudding in bowls or on small plates. Top with crumbled cookies and fresh berries, if desired."
  ],
  "notes": [],
  "nutrition_infos": []
}