{
  "name": "Chocolate Caramels With Sea Salt",
  "categories": [],
  "servings": 100,
  "minutes": 55,
  "source_url": "https://cooking.nytimes.com/recipes/1015278-chocolate-caramels-with-sea-salt",
  "image_urls": [
    "https://static01.nyt.com/images/2013/10/21/dining/video-recipelab-mast-chocolate/video-recipelab-mast-chocolate-square640.jpg",
    "https://static01.nyt.com/images/2013/10/21/dining/video-recipelab-mast-chocolate/video-recipelab-mast-chocolate-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/300 milliliters heavy cream",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": " ounces 143 grams bittersweet chocolate 70 percent cacao solids",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Line an 8-inch square pan with parchment paper or aluminum foil, leaving an extra inch or two hanging over the sides. ",
    "In a small saucepan, heat butter and cream until melted and hot, but do not allow mixture to boil.",
    "Make the caramel: Pour sugar into a large saucepan fitted with a candy or instant-read thermometer. Heat sugar over medium heat until areas begin to melt and turn brown. Using a wooden or silicone spoon, stir melted areas to redistribute the heat. Continue to melt sugar, stirring gently to break up clumps until it is dark brown, bubbling and clear, about 330 degrees. This will take about 15 minutes.",
    "Immediately pour cream-butter mixture through a strainer into caramelized sugar, but be careful: It will bubble wildly. Heat the mixture over medium-high heat to 255 degrees. This will take about 10 minutes. ",
    "Reduce heat to very low, add chocolate, and stir until melted and smooth.",
    "Pour mixture into lined pan and let cool 20 minutes. Sprinkle salt on top. Let cool at room temperature until firm, about 3 hours or overnight. (If weather is hot and humid, chill in refrigerator.) ",
    "When caramels are cool and firm, use the parchment paper or aluminum foil to lift caramel slab out of pan. Using a large sharp knife and a ruler, cut into small squares, about 3/4 inch. Refrigerated caramel will need to soften slightly at room temperature before cutting. "
  ],
  "notes": [],
  "nutrition_infos": []
}