{
  "name": "Classic Cheesecake",
  "categories": [],
  "servings": 9,
  "minutes": 120,
  "source_url": "https://cooking.nytimes.com/recipes/1019037-classic-cheesecake",
  "image_urls": [
    "https://static01.nyt.com/images/2017/12/20/dining/20COOKING-NYCHEESECAKE2/20COOKING-NYCHEESECAKE2-square640.jpg",
    "https://static01.nyt.com/images/2017/12/20/dining/20COOKING-NYCHEESECAKE2/20COOKING-NYCHEESECAKE2-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/12/20/dining/20COOKING-NYCHEESECAKE2/20COOKING-NYCHEESECAKE2-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "graham crackers about 10 ounces 284 grams",
      "amount": 18.0,
      "unit": "whole",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "6-gram packages",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "113 grams sour cream",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large eggs 1 large egg yolk",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "32 grams all-purpose flour",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 325 degrees.",
    "In the bowl of a food processor, combine graham crackers, brown sugar, salt and cinnamon (if using) and process until you’ve got fine crumbs. Transfer the crumbs to a medium bowl and add melted butter. Using your hands, mix well until no dry spots remain (crumb mixture should not be sandy or dry, but hold small clumps when pressed together).",
    "Press crust evenly into the bottom and at least 1 1/2-inches up the sides of a 9-inch springform pan. Use the bottom of a measuring cup to make sure the bottom is as even as possible. Bake on the middle rack until crust is set and just starting to brown around the edges, 20 to 25 minutes.",
    "Remove pan from the oven and set aside while you prepare the filling. Reduce heat to 300 degrees.",
    "Prepare the filling: Combine cream cheese, sour cream, sugar, vanilla and salt in the bowl of a stand mixer. Using a paddle attachment, beat on high until mixture is completely smooth, scraping down the sides and bottom of the bowl as necessary, about 4 minutes.",
    "Reduce speed to medium and 1 at a time, add eggs and yolk, scraping down the sides and bottom of the bowl after each egg is added. With the mixer on low, add flour and beat just to blend, until no lumps remain.",
    "Pour filling into prepared crust (if filling goes above the crust, that is O.K.). Bake until the edges of the cheesecake are completely set and the 2-inch inner circle of the cheesecake wobbles just slightly, 60 to 70 minutes.",
    "Turn heat off and let cheesecake remain in the oven for another 10 minutes. Remove cheesecake from oven and let sit on a wire rack to cool completely at room temperature. When cool, transfer to refrigerator until totally set, at least 6 hours, preferably overnight.   "
  ],
  "notes": [],
  "nutrition_infos": []
}