{
  "name": "Cloverleaf Rolls",
  "categories": [],
  "servings": 12,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1019093-cloverleaf-rolls",
  "image_urls": [
    "https://static01.nyt.com/images/2017/12/12/dining/12COOKING-CLOVERLEAFROLL2/12COOKING-CLOVERLEAFROLL2-square640.jpg",
    "https://static01.nyt.com/images/2017/12/12/dining/12COOKING-CLOVERLEAFROLL2/12COOKING-CLOVERLEAFROLL2-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/12/12/dining/12COOKING-CLOVERLEAFROLL2/12COOKING-CLOVERLEAFROLL2-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "teaspoons/7 grams package active dry yeast",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 milliliters whole milk",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "55 grams all-purpose flour",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Stir the yeast and 1 teaspoon of the sugar into the milk. Set aside until foamy, about 5 minutes. Melt 4 tablespoons of the butter.",
    "Meanwhile, in the bowl of a stand mixer with the dough hook attached, combine the remaining sugar, flour and salt. With the mixer on low, add the yeast mixture and the egg and knead until the dry ingredients have been incorporated (you may have to help it along at first with a spatula) and the dough is smooth, about 5 to 10 minutes. Carefully add the melted butter (the dough will slosh around in the butter for a few minutes, but will eventually absorb it all) and continue to knead the dough until smooth, increasing the speed to medium, another 5 to 10 minutes. The dough will be shiny and elastic; if it’s at all sticky, scrape down the sides of the bowl and gather the dough into a neat ball (no need to add extra flour). Cover the bowl with plastic and set aside to rise in a warm place until doubled, about 1 to 2 hours.",
    "Butter a standard 12-cup muffin tin. Gently tip the dough out onto a work surface. You shouldn’t need flour at this point. Divide the dough into 12 equal pieces. Work with one piece at a time and keep the other pieces covered. Divide each piece into 3 equal pieces, roll each piece into a tight ball and place into one cup. Repeat with the remaining dough. Cover the tray lightly with plastic wrap and set aside to double again, about 45 minutes to 1 hour. The dough should look puffy and spring back slowly when pressed gently.",
    "Heat the oven to 375 degrees. Melt the remaining 2 tablespoons butter. Remove the plastic wrap and without deflating the dough, gently brush the rolls with butter. Bake until puffed and golden, about 10 to 12 minutes. Remove from the oven and brush with more butter and sprinkle with salt. Serve warm."
  ],
  "notes": [],
  "nutrition_infos": []
}