{
  "name": "Cold Candied Oranges",
  "categories": [],
  "servings": 6,
  "minutes": 120,
  "source_url": "https://cooking.nytimes.com/recipes/1020812-cold-candied-oranges",
  "image_urls": [
    "https://static01.nyt.com/images/2020/01/26/magazine/26mag-eat-02/26mag-eat-02-square640.jpg",
    "https://static01.nyt.com/images/2020/01/26/magazine/26mag-eat-02/26mag-eat-02-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/01/26/magazine/26mag-eat-02/26mag-eat-02-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "firm",
      "amount": 6.0,
      "unit": "",
      "comment": "juicy,  seedless oranges with thin skins ,  no bigger than a baseball",
      "original_string": "6 firm, juicy, seedless oranges with thin skins (recently I’ve been using Cara Cara oranges), no bigger than a baseball",
      "nutrition_infos": []
    },
    {
      "name": "granulated sugar",
      "amount": 6.0,
      "unit": "cup",
      "comment": "",
      "original_string": "6 cups granulated sugar",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 100.0,
          "unit": "G",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 375.0,
          "unit": "KCAL",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total Sugars",
          "amount": 100.0,
          "unit": "G",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total trans",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total saturated",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 4.0,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "Bring a stainless-steel pot of water to a boil. (It should be large enough to hold the oranges submerged.)",
    "Wash and dry the oranges, and channel from stem to navel at 1/2-inch intervals, removing strips of peel while leaving the pith intact, until the oranges resemble those onion domes on Russian churches. (You need a good, sharp channeler, not a tiny-toothed zester for this one.)",
    "Place the oranges and their long, fat threads of channeled peel into the boiling water, and reduce to a simmer. Cover the oranges with a lid one size too small for the pot, to keep them submerged. Let them blanch for about 25 minutes to remove the harshest edge of their bitter nature. They should swell and soften but not collapse or split.",
    "Remove the oranges and zest from the simmering water with a slotted spoon, and set aside. Dump out the blanching water, and return the dry pot to the stove.",
    "In that same pot, combine the sugar with 6 cups water; bring the sugar water to a boil over medium-high, stirring until the sugar has dissolved, then allow to gently boil, and reduce for 10 minutes, uncovered. You want some water to evaporate and for the syrup to take on a little body.",
    "Carefully place blanched oranges and zest into the sugar syrup, and reduce heat to a very slow, lethargic simmer. Cover oranges with a parchment circle cut slightly larger than the circumference of the pot (by 1 inch is enough), then place the too-small lid on top of the parchment on top of the oranges, to keep them fully submerged (and sealed under the parchment) in the sluggishly simmering syrup.",
    "Cook the oranges in the syrup for about 45 minutes, checking on them frequently to keep the temperature quite slow and stable, until they take on a high gloss and appear vaguely translucent and jewel-like. (We have several induction burners that come with features that can hold a temperature, and I leave the oranges at around 170 degrees for most of the candying, sometimes with a little bump up to 180. But without a thermometer or an induction burner, just a visual slow, slow, slow bubble is a good cue.)",
    "Cool oranges and peels in their syrup for a full 24 hours before serving. This kind of “cures” them. They get even better after 48 hours. First, you’ll want to let them cool at room temperature until no longer warm to the touch, at least 4 hours, then refrigerate them until thoroughly chilled. The oranges last refrigerated for 1 month as long as they are submerged in that syrup.",
    "Serve very cold. Eat the whole thing, skin and all, with a knife and fork. It’s like a half glacéed fruit and half fresh fruit — refreshing, tonic, digestive and so great after dinner."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 100.0,
      "unit": "G",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 375.0,
      "unit": "KCAL",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total Sugars",
      "amount": 100.0,
      "unit": "G",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total trans",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total saturated",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 4.0,
      "serving_size_unit": "g"
    }
  ]
}