{
  "name": "Coquito",
  "categories": [],
  "servings": 9,
  "minutes": 20,
  "source_url": "https://cooking.nytimes.com/recipes/1020695-coquito",
  "image_urls": [
    "https://static01.nyt.com/images/2019/12/06/dining/dg-coquito/merlin_165082251_9ba48052-f792-4bf8-a482-cd73bfdb3171-square640.jpg",
    "https://static01.nyt.com/images/2019/12/06/dining/dg-coquito/merlin_165082251_9ba48052-f792-4bf8-a482-cd73bfdb3171-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/12/06/dining/dg-coquito/merlin_165082251_9ba48052-f792-4bf8-a482-cd73bfdb3171-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "14-ounce cans unsweetened coconut cream see tip",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "egg yolks",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "can sweetened condensed milk",
      "amount": 7.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "puerto rican rum",
      "amount": 1.3333333333333333,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "If using canned coconut cream, skip to Step 3. If using fresh coconuts, puncture one or two of the eyes of each coconut with a sharp knife or screwdriver; strain the coconut water into a bowl. Place coconuts on a stable surface, supported by a kitchen towel. Using a hammer, crack each coconut into 3 or 4 pieces. Slip a thin knife between the flesh and shell to separate it. (To make this easier, you can roast the coconut pieces on a sheet pan at 350 degrees for 10 to 15 minutes.) Discard shells. Break or chop coconut flesh into 1-inch pieces.",
    "Place about 1/3 of the pieces in a blender with 1 cup strained coconut water. Blend until coconut is broken into about 1/8-inch pieces; place in a clean dish towel and squeeze over a bowl to extract as much liquid as possible. Reserve coconut bits for another use. Pour 1 cup of the liquid back into the blender with another 1/3 of the coconut pieces, blend, then squeeze to extract liquid. Repeat with final 1/3 of coconut pieces. Measure out 3 1/3 cups of fresh coconut cream. (If necessary, blend another cup of coconut water with a batch of coconut bits, and squeeze again to extract more liquid from the coconut until you have 3 1/3 cups.)",
    "In a large bowl, lightly whisk the egg yolks. To a medium saucepan, add 1 cup of the coconut cream and sweetened condensed milk. Bring to a simmer over medium-high, stirring occasionally. Whisking the egg  yolks constantly, slowly pour the hot mixture into yolks, until smooth and frothy. Stir in the rum, if using, salt, and the remaining coconut cream.",
    "Strain the coquito through a fine-mesh strainer into bottles or jars. Cover tightly and refrigerate at least 3 hours or up to 1 week. Remove from refrigerator 30 minutes before serving. Shake well, pour into glasses, sprinkle with nutmeg and serve immediately."
  ],
  "notes": [],
  "nutrition_infos": []
}