{
  "name": "Corn Tortillas From Masa Harina",
  "categories": [],
  "servings": 15,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1015179-corn-tortillas-from-masa-harina",
  "image_urls": [
    "https://static01.nyt.com/images/2013/10/02/dining/20131002-MESA-slide-CUMW/20131002-MESA-slide-CUMW-square640.jpg",
    "https://static01.nyt.com/images/2013/10/02/dining/20131002-MESA-slide-CUMW/20131002-MESA-slide-CUMW-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "nixtamalized corn flour",
      "amount": 12.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Cut 2 10-inch squares of thick plastic from a gallon-size Ziploc freezer bag and set aside to line an 8-inch tortilla press.",
    "Place the corn flour in a large bowl. Slowly add 2 1/4 cups hot tap water, kneading it in with your fingers. Once all the water has been added, knead until dough is smooth, 3 to 5 minutes. The masa should be very soft but not sticky, about the consistency of Play-Doh. If it is too dry, work in more water, 2 tablespoons at a time. If it is too wet, continue kneading until it dries out a bit or knead in additional corn flour. Masa dries out very quickly, so once it is at the right consistency, keep it covered with a damp kitchen towel.",
    "Heat a pancake griddle or a heavy nonstick or cast-iron skillet over medium heat. The goal is a steady medium-low heat.",
    "Pinch off about 2 ounces masa and roll into a ball about 1 3/4 inches in diameter. Flatten lightly between your palms to make a 2 1/2-inch round. Place one sheet of plastic on the bottom of the open tortilla press and place the dough in the center. Cover with the other sheet of plastic and press the lever gently but firmly to flatten the dough. Don’t crank the lever down as hard as you can because the tortilla will be too thin.",
    "Flip the tortilla (still in the plastic) and press lightly again into an even 6- to 6 1/2-inch round. Place the tortilla (still in the plastic) in your left palm. Use your other hand to peel off the plastic, then invert the tortilla onto your right palm and peel off the other plastic. Gently release the tortilla onto the cooking surface.",
    "Watching carefully, cook just until one of the edges begins to appear dry, 15 to 25 seconds. (If you overcook the tortilla at this step, it will not cook properly.) Flip the tortilla and cook on the second side just until it is speckled with brown spots, 1 to 2 minutes, rotating it once. Flip the tortilla back to the first side. The tortilla might begin to puff at this stage. When it is just beginning to brown on the bottom, flip again, back to the second side, and move to a cooler part of the cooking surface, toward an edge. Let the tortilla finish cooking there until most of it appears translucent when held up to the light, 30 to 60 seconds.",
    "Stack cooked tortillas in a basket lined with a large napkin that you can fold over the top, which will let them continue steaming, keeping them soft and pliable. If not using immediately, store cooked tortillas in the refrigerator, well wrapped. To reheat, place directly on a hot surface or wrap in a damp towel and heat in the microwave for a few seconds."
  ],
  "notes": [],
  "nutrition_infos": []
}