{
  "name": "Crème Brûlée Pie",
  "categories": [],
  "servings": 8,
  "minutes": 180,
  "source_url": "https://cooking.nytimes.com/recipes/1020556-creme-brulee-pie",
  "image_urls": [
    "https://static01.nyt.com/images/2019/10/24/dining/jg-creme-brulee-pie/jg-creme-brulee-pie-square640-v2.jpg",
    "https://static01.nyt.com/images/2019/10/24/dining/jg-creme-brulee-pie/jg-creme-brulee-pie-videoSixteenByNineJumbo1600-v2.jpg",
    "https://static01.nyt.com/images/2019/10/24/dining/jg-creme-brulee-pie/jg-creme-brulee-pie-superJumbo-v2.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/195 grams all-purpose flour",
      "amount": 1.3333333333333333,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla bean paste or vanilla extract",
      "amount": 3.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/360 milliliters heavy cream",
      "amount": 1.3333333333333333,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Prepare the crust: In a food processor, blend the flour and 3/4 teaspoon salt on high for 5 seconds to combine. Open the lid and scatter the cubes of butter evenly across the top, reattach the lid, and pulse until the butter is about the size of peas or a little larger. Drizzle in 5 tablespoons of the water through the lid while continuing to pulse. If the mixture is still dry, drizzle in more water, adding 1 tablespoon at a time and stopping once the dough is properly moist. Check as you go by pinching the mixture between your fingertips: It should look crumbly but it should hold together when you squeeze it. You should be able to compress it without it sticking too much to your fingers.",
    "Set a sheet of plastic wrap on your work surface and dump the dough into the center of it. Wrap it up tightly and compress the dough into a flat, smooth disk. Refrigerate the disk at least 30 minutes, or up to 2 days.",
    "Remove the chilled dough from the fridge. On a lightly floured work surface, quickly roll the dough out into an even 13-inch round, making sure to occasionally turn, flip and lightly dust the dough and rolling pin as you go. Carefully transfer the crust to a 9-inch glass pie plate, making sure not to stretch it as you nestle it into the corners of the plate.",
    "Using scissors, trim away the rough edges of the dough and tuck the remaining overhang under itself to create a thicker edge that rests on the rim of the pan. Crimp the edges using your fingertips or the tines of a fork, then place the entire plate in the freezer for another 30 minutes to harden.",
    "Heat the oven to 425 degrees and position a rack in the center of the oven. Remove the crust from the freezer and place a sheet of parchment on top of the pie crust, making sure it extends far beyond the edges of the pie, and top the paper with pie weights or uncooked beans. Bake for 30 minutes before removing the weights and parchment, and then bake for another 12 to 15 minutes until the bottom is light golden brown. Transfer the pie crust in its pie plate to a wire rack to cool completely, at least 30 minutes.",
    "While the pie crust cools, heat the oven to 300 degrees and prepare the filling: In a stand mixer fitted with a whisk attachment, add 1/2 cup granulated sugar, egg yolks, vanilla bean paste, salt and nutmeg, and beat on high speed for 3 minutes, stopping to scrape down the sides and bottom of the bowl halfway through. The mixture will be very pale and have a marshmallow-like consistency. Reduce the speed to medium, and with the mixer still running, slowly drizzle in the heavy cream, beating until completely combined.",
    "Pour the mixture into the cooled crust and bake until the pie is set around the edges and jiggly in the center, 40 to 50 minutes. Remove from the oven and allow to cool at least 20 minutes before placing in the fridge, uncovered, to chill overnight (or at least 4 hours, or up to 2 days).",
    "When ready to serve, heat the oven to broil and place a rack 3 to 4 inches away from the heat source. Remove the pie from the fridge and using a sheet of aluminum foil and a pair of scissors, cut a hole out of the center of the foil to create a frame that will expose the filling of the pie but covers the crust. Secure it firmly so it’s hugging the crust and sides of the plate. Sprinkle the remaining 3 tablespoons granulated sugar over the filling, and place the pie directly under the broiler for 3 to 6 minutes, watching closely and rotating the pan and foil as needed, until the sugar begins to bubble and burn all over.",
    "Remove from the oven, allow 3 to 5 minutes to cool so the sugar can harden, then gently tap the surface with a knife to break up the sheet of sugar around the areas you intend to cut. Slice and serve immediately, before the sugar softens. More delicate than custard pies, the filling will be loose and wobbly like crème brûlée."
  ],
  "notes": [],
  "nutrition_infos": []
}