{
  "name": "Deep-Fried Turkey",
  "categories": [],
  "servings": 11,
  "minutes": 630,
  "source_url": "https://cooking.nytimes.com/recipes/1024772-deep-fried-turkey",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/07/multimedia/-KS-FRIED-TURKEY-rex-tqlg/-KS-FRIED-TURKEY-rex-tqlg-square640.jpg",
    "https://static01.nyt.com/images/2023/11/07/multimedia/-KS-FRIED-TURKEY-rex-tqlg/-KS-FRIED-TURKEY-rex-tqlg-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/07/multimedia/-KS-FRIED-TURKEY-rex-tqlg/-KS-FRIED-TURKEY-rex-tqlg-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "4 pound turkey",
      "amount": 1.0,
      "unit": "",
      "comment": "completely thawed",
      "original_string": "1 whole 12- to 14-pound turkey (see Tip), completely thawed ",
      "nutrition_infos": []
    },
    {
      "name": "peanut oil",
      "amount": 4.0,
      "unit": "gal",
      "comment": "",
      "original_string": "4 gallons peanut oil or other vegetable oil, such as canola",
      "nutrition_infos": []
    },
    {
      "name": "heaping cup light brown sugar",
      "amount": 1.0,
      "unit": "",
      "comment": "lightly packed",
      "original_string": "1 heaping cup light brown sugar, lightly packed",
      "nutrition_infos": []
    },
    {
      "name": "heaping cup kosher salt",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "original_string": "1 heaping cup kosher salt (such as Diamond Crystal) or 1/2 cup coarse kosher salt (such as Morton)",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Plan your setup. Frying a turkey requires: a vessel for dry-brining (large container; zip-top bag or unscented plastic kitchen trash bag); kitchen string (optional); 26- to 34-quart pot; turkey frying kit (frame, propane hub, turkey lifting hook system); propane; deep-fat fry thermometer; and instant-read thermometer. The pot should be able to hold the turkey and enough oil to cover it (while leaving some headspace) and the heat source should be able to get the oil to 350 degrees.  ",
    "Most pots for frying have a fill line for the oil. Or use the water displacement method: Take the bird still wrapped in the packaging from the store and put it into the pot in its tallest position, then add enough water to just cover it, keeping track of how much water you have used. Remove the turkey, then mark the water level. Pour out the water and dry the pot. When you are ready to fry, you’ll add the same amount of oil to the completely dry pot to that line.",
    "Brine the turkey: In a bowl, whisk together sugar and salt. Remove any giblets and neck from the turkey cavities and any plastic parts or pop-up thermometers and pat the bird dry, making sure that it’s fully thawed. Place the bird in a large container or plastic bag. Rub the salt-sugar mixture inside and outside the turkey, making sure to get the seasoning into the crevices. Seal the container or the plastic bag. Refrigerate overnight or up to 24 hours. If you can’t fit the bird in your refrigerator, make sure the turkey is tightly sealed and use a cooler with enough ice or ice packs to keep the temperature around 40 degrees. Rinse the salt mixture from the bird, pat it very dry and place it on a sheet pan, lined with paper towels if necessary. If you have space and time, do this early in the day and allow the bird to sit uncovered in the refrigerator to further dry the skin. If not, rinse and pat the bird dry right before you prepare the fryer.",
    "Set up your frying rig per the instruction manual: The fryer should be set up on a level area of dirt, gravel or concrete away from buildings. Have safety equipment including heat resistant cooking gloves and a fire extinguisher nearby. With the burner off, add enough oil to the pot to reach the fill line. ",
    "Heat the oil to 350 degrees (this usually takes about 30 minutes but can take up to an hour longer depending on outside temperature and other variables). Insert the hook provided in the turkey kit through the cavity. If you’d like, using kitchen string, tie the legs of the bird together.",
    "Attach the lifting hook to the hook in the cavity.  ",
    "When the oil is at the correct temperature, turn off the propane and slowly lower the turkey into the oil, being careful to ease it into the pot. (It’s OK if the tips of the legs are not fully covered by the oil.)",
    "Turn the propane back on and monitor the oil temperature, adjusting as needed to keep it at about 325 degrees. Cooking time will vary with the size and temperature of the bird. Plan on about 3 to 4 minutes per pound, or about 45 minutes for a 14-pound turkey. At about 30 minutes, turn off the propane and test the temperature by lifting the bird from the oil and inserting a thermometer into the deepest part of the breast (a second set of hands is helpful here). The temperature should be at 155 degrees. (If the turkey is not yet done, carefully lower the turkey back into the hot oil, turn the propane back on and continue frying.)",
    "When the breast meat hits 155 degrees, remove the bird from the oil and transfer it to a large rimmed baking sheet fitted with a wire rack. The heat will carry over while the bird rests and add 10 to 15 degrees to the internal temperature of the meat. Cover loosely with foil and allow the bird to rest for at least 30 minutes, although an hour is ideal, before carving. (The turkey will still be warm even after two hours of resting.) You will lose a lot of moisture to evaporation if you <a href=\"https://www.youtube.com/watch?v=eUv1tq91NMY\">carve the bird</a> hot from the fryer."
  ],
  "notes": [],
  "nutrition_infos": []
}