{
  "name": "Dodo (Fried Plantains)",
  "categories": [],
  "servings": 5,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1020283-dodo-fried-plantains",
  "image_urls": [
    "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex6/24Nigerianrex6-square640.jpg",
    "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex6/24Nigerianrex6-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/06/26/dining/24Nigerianrex6/24Nigerianrex6-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "medium ripe",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small red onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "lime",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Cut off the tips of each plantain. Use a sharp knife to create a slit in the skin along the length of each plantain, carefully making sure not to cut into the flesh. Remove and discard the skin by peeling it apart. Slice each plantain in half lengthwise, then cut into 1-inch pieces.",
    "Thinly slice one onion half, then transfer the slices to a medium bowl. Quarter the remaining onion half lengthwise, and pull the layers apart.",
    "In a large, deep skillet or sauté pan, pour 1/2 inch oil and heat over medium. When hot, add the larger onion pieces and fry, stirring occasionally, until golden brown, about 6 minutes. Using a slotted spoon, remove and discard the cooked onion. ",
    "Working in batches to avoid crowding, fry the plantains, stirring halfway through, until browned and caramelized at the edges, 10 to 12 minutes per batch. Using a slotted spoon, transfer to a paper towel-lined baking sheet.",
    "While the plantains are frying, toss the sliced onion with the lime juice, red-pepper flakes and a pinch of salt in a large bowl. Let marinate, at least 10 minutes.",
    "Toss the fried plantains in the bowl with the pickled onion mixture while still warm. Add the lime zest and season to taste with salt. Serve immediately."
  ],
  "notes": [],
  "nutrition_infos": []
}