{
  "name": "Dry-Brined Turkey",
  "categories": [],
  "servings": 13,
  "minutes": 180,
  "source_url": "https://cooking.nytimes.com/recipes/1012869-dry-brined-turkey",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/07/multimedia/KS-Dry-Brined-Turkey-bctz/KS-Dry-Brined-Turkey-bctz-square640.jpg",
    "https://static01.nyt.com/images/2023/11/07/multimedia/KS-Dry-Brined-Turkey-bctz/KS-Dry-Brined-Turkey-bctz-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/07/multimedia/KS-Dry-Brined-Turkey-bctz/KS-Dry-Brined-Turkey-bctz-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "- to 16-pound turkey",
      "amount": 6.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "sprigs fresh thyme",
      "amount": 10.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "flat-leaf parsley",
      "amount": 1.5,
      "unit": "bunch",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small onions",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small apples",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "white wine see tip",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Two days before serving, rinse turkey and pat dry. Rub all over with kosher salt, slipping salt under skin where possible and rubbing some into cavities. Use about 1 tablespoon per 4 pounds of bird.",
    "Wrap bird in a large plastic bag and place in refrigerator. On second night, turn turkey over. A couple of hours before cooking, remove turkey from bag and pat dry. (There is no need to rinse it first.) Place in roasting pan and allow to come to room temperature.",
    "Heat oven to 450 degrees. Sprinkle half the pepper into main cavity of turkey; add thyme, parsley, half the onions and half the apples. Truss legs with kitchen twine. Put remaining apples and onions in neck opening and tuck neck skin under bird.",
    "Rub butter under breast skin and onto thigh meat. Sprinkle bird with remaining pepper.",
    "Roast for 30 minutes. Remove turkey from oven, reduce heat to 350 degrees and cover breast of bird and wing tips with foil. Add 1 1/2 cups white wine (or use water) to bottom of roasting pan and roast bird for another two hours, depending on size; figure 12 minutes a pound for an unstuffed bird. Remove foil in last half-hour so breast browns.",
    "When turkey has roasted for 2 hours, begin to test for doneness by inserting a meat thermometer (digital is best) into two places in thigh, making sure not to touch bone. It should be at about 160 degrees.",
    "When roasting is done, tip turkey so interior juices run back into pan. Remove turkey to a separate baking sheet or serving platter, cover with foil and then a damp kitchen towel and allow to rest for at least 30 minutes before <a href=\"https://www.youtube.com/watch?v=eUv1tq91NMY\">carving</a>.",
    "Pour fat and drippings from pan into a measuring cup. Deglaze pan with 1/2 cup white wine (or use broth) and pour that into same measuring cup. Fat and drippings can then be used to make gravy."
  ],
  "notes": [],
  "nutrition_infos": []
}