{
  "name": "Duck Salad",
  "categories": [],
  "servings": 6,
  "minutes": 205,
  "source_url": "https://cooking.nytimes.com/recipes/2188-duck-salad",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/13.jpg?1"
  ],
  "ingredients": [
    {
      "name": "long isl",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "package japanese buckwheat noodles soba",
      "amount": 4.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "peanut oil",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "scallions",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cucumber",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "minced fresh cori",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "sesame oil",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "light soy sauce",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "watercress",
      "amount": 2.0,
      "unit": "bunch",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Roast the duck according to the directions in the recipe for Basic Roast Duck, through Step 5. Remove the duck from the oven and allow to cool.",
    "Boil the noodles until just done, about five minutes. Drain, rinse in cold water and allow to drain again. When thoroughly drained, toss the noodles with two tablespoons of the peanut oil and season lightly with salt and pepper.",
    "Roast the pepper by turning it over a gas flame or placing it under a broiler until the skin has blackened. Place the pepper in a plastic or paper bag for about 10 minutes to steam off the charred skin. Remove the skin, seed the pepper and cut it in slivers. Toss the noodles with the pepper, scallions, cucumber and coriander.",
    "Remove the duck skin from the duck and reserve. Pull the meat of the duck off the bones.",
    "Dice the duck skin and fry the pieces in a skillet until crisp. Allow to drain on absorbent paper.",
    "Combine the remaining peanut oil, the sesame oil, lemon juice and soy sauce. Beat until well-blended.",
    "Arrange the watercress on each of six plates. Toss the noodles with about half the sauce and arrange atop the watercress on each plate. Arrange the duck pieces on the noodles and sprinkle with the rest of the sauce. Scatter the bits of fried duck skin on top and serve."
  ],
  "notes": [],
  "nutrition_infos": []
}