{
  "name": "Duck Breast With Braised Belgian Endive, Shaved Cauliflower and Green Peppercorns",
  "categories": [],
  "servings": 4,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1018973-duck-breast-with-braised-belgian-endive-shaved-cauliflower-and-green-peppercorns",
  "image_urls": [
    "https://static01.nyt.com/images/2017/10/15/magazine/15eat/15mag-15eat-t_CA0-square640.jpg",
    "https://static01.nyt.com/images/2017/10/15/magazine/15eat/15mag-15eat-t_CA0-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/10/15/magazine/15eat/15mag-15eat-t_CA0-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "duck breasts",
      "amount": 2.0,
      "unit": "whole",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "belgian endive",
      "amount": 2.0,
      "unit": "head",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "shaved cauliflower “pebbles”",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large shallot",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "chicken broth or stock",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "- 1/2 cup dry sherry or dry vermouth",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "splash of sherry vinegar",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 33.0,
          "unit": "KCAL",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "Split and trim the duck breasts to yield 4 individual breasts. Some people remove the “tenders,” as there is a small span of unchewable silver skin within, but I just leave them intact and deal with it when eating, like the fat or gristle in any steak or chop. It’s just part of the deal.",
    "Season the duck with salt and pepper generously on both skin and flesh sides, then place breasts skin-side down in an extra-large heavy-bottomed steel pan.",
    "Set the pan over medium-low heat, and gently cook the duck breasts 20 to 25 minutes, skin-side down the whole time, pouring off the rendering duck fat many times along the way so that the duck does not poach or steam in its own fat. Save all of that duck fat.",
    "In the meantime, split the endive heads in half lengthwise, and remove any limp outer leaves. Crush the green peppercorns with the flat side of your chef’s knife, then mince the crushed peppercorns further, sometimes dragging the mince under the flat side of your knife to make it into a paste, as you might with a clove of garlic.",
    "When the duck skin is dark golden brown and crisp and most of the white fat has rendered out, turn the breast flesh-side down. Increase heat to medium-high (you want to get a true sear and not a gray “steam”), and sear for 2 to 4 minutes, or until the flesh is golden brown. Remove the duck breasts from the pan, and set them aside in a warm place.",
    "Add a nice spoonful of the rendered duck fat back into the hot pan, and lay in the endive halves, cut-side down. Cook until you get a dark golden sear on the cut sides of the endive, about 3 minutes. Turn the endives over onto their rounded backs, and add the cauliflower, shallot and peppercorn paste to the pan.",
    "Add back in another nice spoonful of the rendered duck fat, and stir together as best as you can without disturbing the endive. You can move it to the side and give yourself some room for stirring and cooking the cauliflower. You want to make sure the cauliflower and the shallots have contact with the fond (the fat, salt and pepper that have been left behind from the cooking of the duck breasts) in the pan.",
    "Add the chicken stock and the sherry or vermouth, and partly cover the pan to simmer the vegetables until soft and cooked, about 4 minutes. The liquid will be absorbed, the high note of the alcohol will burn off and a loose sauce will remain when finished cooking.",
    "Season the vegetables with salt and pepper as needed, and drizzle some more of the rendered duck fat over the whole deal if that moves you, as it does me.",
    "Slice the duck breasts across at a slight bias, approximately the thickness of your pinkie, and serve each with endive and cauliflower. Sprinkle a few drops of sherry vinegar over each serving to finish."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 33.0,
      "unit": "KCAL",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    }
  ]
}