{
  "name": "Extra-Crispy BLT",
  "categories": [],
  "servings": 4,
  "minutes": 35,
  "source_url": "https://cooking.nytimes.com/recipes/1022473-extra-crispy-blt",
  "image_urls": [
    "https://static01.nyt.com/images/2021/08/16/dining/as-blt/merlin_192901173_25299364-0bef-44b8-bb99-bb641d80ba12-square640.jpg",
    "https://static01.nyt.com/images/2021/08/16/dining/as-blt/merlin_192901173_25299364-0bef-44b8-bb99-bb641d80ba12-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/08/16/dining/as-blt/merlin_192901173_25299364-0bef-44b8-bb99-bb641d80ba12-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "thin-cut bacon",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 400 degrees. Line a sheet pan with foil, including up the sides. Arrange the bacon in a single layer on the lined sheet pan, overlapping pieces slightly, if necessary, to fit them all on the pan. Transfer to the oven and cook, without flipping, until deep golden brown and curling in spots, 15 to 25 minutes. (You can put the bacon in as the oven heats up; it will help the fat render.) Transfer the cooked bacon to a paper towel-lined plate. (You can fold and curl the pieces onto the plate; this will add more texture to the final sandwich.)",
    "Meanwhile, season the tomatoes with salt and pepper. Cut four 1/4-inch-thick slabs of the iceberg lettuce crosswise. (Make a <a href=\"https://cooking.nytimes.com/recipes/1019392-wedge-salad\">wedge salad</a> with the rest.) Toast the bread in the toaster or directly on an empty rack in the oven, flipping halfway through.",
    "Spread one side of the toasted bread with mayonnaise and/or mustard. Add 2 slices of tomato to half the bread slices. Top with one slab of lettuce, then add the bacon. It will be tricky to lay the bacon flat, and that’s good. Arrange them irregularly, so there are pockets of air between the slices.",
    "Top with the remaining slices of bread. Press down slightly, cut in half and eat right away."
  ],
  "notes": [],
  "nutrition_infos": []
}