{
  "name": "Fudgy Brownies",
  "categories": [],
  "servings": 16,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/cooks-illustrated-classic-brownies-53059591",
  "image_urls": [
    "https://assets.epicurious.com/photos/5fca950999e408725afcb3e4/16:9/w_4128,h_2322,c_limit/Brownies_3_VOG_final.jpg",
    "https://assets.epicurious.com/photos/5fca950999e408725afcb3e4/4:3/w_4781,h_3586,c_limit/Brownies_3_VOG_final.jpg",
    "https://assets.epicurious.com/photos/5fca950999e408725afcb3e4/1:1/w_3963,h_3963,c_limit/Brownies_3_VOG_final.jpg"
  ],
  "ingredients": [
    {
      "name": "113 grams unsweetened chocolate",
      "amount": 4.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "5 grams pure vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "eggs 100 grams large eggs",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "60 grams all-purpose flour",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Arrange the oven racks so one is in the center position. Preheat the oven to 400°F.",
    "Spray the bottom and sides of an 8-inch square baking pan with nonstick cooking spray. Cut a piece of parchment paper 8 inches wide and 15 to 16 inches long. Lay the paper in the pan so it travels up and over two of the sides. Spray the paper with nonstick cooking spray.",
    "Pour 1 to 2 inches of water into the bottom of a small saucepan and choose a bowl that fits over the saucepan to make a double boiler. Make sure the water is not touching the bottom of the bowl; if it is, pour some water out. Bring the water to a boil over high heat, then reduce the heat to medium-low to maintain a gentle simmer.",
    "Unless you are using chocolate chips, roughly chop the chocolate. Put the butter and chocolate into the bowl of the double boiler and melt them, using a heat-proof rubber spatula to stir and scrape down the sides of the bowl so the chocolate doesn’t burn.",
    "Remove the bowl from the double boiler and wipe the bottom of the bowl so no water drips. Add the sugar, vanilla, and salt and whisk them in. Add the eggs one at a time and whisk until the batter is shiny and smooth, 1 to 2 minutes. Add the flour and stir with a rubber spatula until no flour is visible.",
    "Using a rubber spatula, transfer the batter to the prepared pan. Use the spatula to smooth out the top of the batter.",
    "Place the brownies on the center rack of the oven and bake for 20 minutes, rotating the pan from front to back halfway through the baking. Remove the brownies from the oven and cool on a cooling rack. The tops will appear dry, but the insides will remain fudgy if you poke the center with a toothpick or cake tester. Holding the sides of the parchment paper, lift the brownies out of the pan and place them on a cutting board. Using a large knife, cut the brownies into 16 equal pieces.\nDo Ahead: Store the brownies in an airtight container at room temperature for up to 1 week or freeze for up to 3 months. \n\nEditor's note: This recipe was originally published in A Good Bake and first appeared on Epicurious in December 2020."
  ],
  "notes": [],
  "nutrition_infos": []
}