{
  "name": "Hake in Vegetable and Lemon Broth",
  "categories": [],
  "servings": 6,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/10812-hake-in-vegetable-and-lemon-broth",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/13.jpg?1"
  ],
  "ingredients": [
    {
      "name": "carrots 6 ounces",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "scallions",
      "amount": 12.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "red onion 8 ounces",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dry white wine",
      "amount": 3.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ounces",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Peel the carrots, and cut them into 3-inch pieces. Then, cut each piece into 1/8-inch slices. Stack the slices together, and cut them into 1/8-inch strips (julienne). You should have about 2 cups of julienned carrot.",
    "Peel the lemon with a vegetable peeler, removing the peel in long strips. Pile the strips together, and cut them into a fine julienne, making about 1 tablespoon. Cut the lemon in half, and press the halves to extract 2 tablespoons of juice.",
    "In a large saucepan (preferably stainless steel), combine the carrots, lemon peel, lemon juice, scallions, red onion, white wine, salt, thyme leaves and pepper with 3/4 cup water. Bring the mixture to a boil over high heat, cover, reduce the heat to low, and boil gently for 10 minutes.",
    "Fold each of the hake fillets in half and arrange them carefully on top of the vegetables in the saucepan. Cover, return the mixture to a boil, reduce the heat and boil gently for 5 minutes. The hake should be barely cooked through. Lift the fish from the saucepan and arrange it on a platter.",
    "Add the olive oil and butter to the vegetable mixture in the pan, and bring it to a strong boil over high heat. Continue to boil for about 20 to 30 seconds, until the mixture is emulsified. Pour over the fish, and serve immediately."
  ],
  "notes": [],
  "nutrition_infos": []
}