{
  "name": "Halibut With Brown Butter, Lemon and Sage",
  "categories": [],
  "servings": 4,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1018964-halibut-with-brown-butter-lemon-and-sage",
  "image_urls": [
    "https://static01.nyt.com/images/2017/10/18/dining/18KITCHEN1/18KITCHEN1-square640.jpg",
    "https://static01.nyt.com/images/2017/10/18/dining/18KITCHEN1/18KITCHEN1-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/10/18/dining/18KITCHEN1/18KITCHEN1-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "about 1 1 2 pounds halibut fillets or other firm white-fleshed fish",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "coarse homemade bread crumbs",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "finely chopped parsley",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Season fish on both sides with plenty of salt and pepper.",
    "Pour oil into a large, heavy skillet (preferably cast iron or nonstick) and set over medium-high heat. When oil is hot (but not smoking), swirl to evenly coat the pan, then add fish in a single layer. Let cook undisturbed for 3 to 4 minutes, until first side is nicely browned. Adjust the heat as needed to produce a steady sizzle and prevent scorching.",
    "Flip and cook fish for about another 3 minutes, until just done. (To test for doneness, use a fork to gently probe the flesh: it should flake easily.) Transfer cooked fish to a warm platter or serving plates.",
    "Make the sauce: Place skillet back on the stove over medium-high heat. Add butter and sage leaves. Cook butter, swirling the pan, until foamy and just beginning to brown, about 1 minute. Turn off heat and stir in lemon juice.",
    "Spoon butter sauce and sage leaves over fish. Sprinkle with bread crumbs and parsley. Serve immediately, with lemon wedges."
  ],
  "notes": [],
  "nutrition_infos": []
}