{
  "name": "Homemade Tortilla Chips",
  "categories": [],
  "servings": 1,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1021579-homemade-tortilla-chips",
  "image_urls": [
    "https://static01.nyt.com/images/2020/11/04/dining/29nachosrex3/merlin_179172918_e8ca6499-2c0e-498f-968e-bddd52e25028-square640.jpg",
    "https://static01.nyt.com/images/2020/11/04/dining/29nachosrex3/merlin_179172918_e8ca6499-2c0e-498f-968e-bddd52e25028-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/11/04/dining/29nachosrex3/merlin_179172918_e8ca6499-2c0e-498f-968e-bddd52e25028-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ounces",
      "amount": 17.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vegetable oil about 4 cups",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Collect the tortillas into 2 tall stacks and cut into 6 even wedges. If frying your tortilla chips, proceed to Step 2. If baking your tortilla chips, proceed to Step 3.",
    "To fry your tortilla chips, line 2 large baking sheets with paper towels. Set aside. Fill a large cast-iron or other heavy skillet with about 1/2 inch vegetable oil (about 4 cups). Heat over medium until the oil reaches about 350 degrees and is hot but not smoking, 6 to 10 minutes. You can see if it’s ready by dipping a tortilla wedge into the hot oil. It should bubble immediately and enthusiastically. Gently add enough tortilla wedges to fill the skillet in a single layer without crowding, and fry for about 1 minute per side, using a spider or a slotted spoon to flip them over, until lightly golden and crisp. (Do not allow them to brown too much or they will taste bitter.) Using the spider or slotted spoon, transfer the chips to the prepared baking sheets. Sprinkle immediately with salt, so it adheres to the glistening chips. Repeat until all chips are cooked, transferring cooled chips to a large bowl and replacing the paper towels as needed. (Let the remaining oil cool to room temperature, then strain and transfer to a bottle to reuse it for future deep frying.)",
    "To bake your tortilla chips, position racks in the upper and lower thirds of the oven and heat to 375 degrees. Brush 2 large baking sheets with oil or spray with cooking spray. Working in batches, scatter the tortilla wedges on top in a single layer without crowding too much. (The chips should barely overlap.) Lightly brush or spray the tops with oil or cooking spray. Bake for 15 to 20 minutes, remove from the oven, flip the chips and return to the oven, until lightly browned and crisp, another 15 minutes. Remove from the heat. Immediately sprinkle with salt to taste, so the salt will stick to the chips. Repeat with remaining chips."
  ],
  "notes": [],
  "nutrition_infos": []
}