{
  "name": "Jacques Pépin's Steamed and Roasted Turkey",
  "categories": [],
  "servings": 15,
  "minutes": 195,
  "source_url": "https://cooking.nytimes.com/recipes/12941-jacques-pepins-steamed-and-roasted-turkey",
  "image_urls": [
    "https://static01.nyt.com/images/2014/10/14/dining/steamturkey-still/steamturkey-still-square640.jpg",
    "https://static01.nyt.com/images/2014/10/14/dining/steamturkey-still/steamturkey-still-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "- to 18-pound turkey",
      "amount": 8.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "apple cider",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cider vinegar",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "white wine",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "water",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 240.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 240.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 10.8,
          "unit": "G",
          "serving_size": 240.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 42.0,
          "unit": "KCAL",
          "serving_size": 240.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total Sugars",
          "amount": 10.8,
          "unit": "G",
          "serving_size": 240.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 8.0,
          "unit": "MG",
          "serving_size": 240.0,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "For the turkey: Cut off the ends of the drumsticks if your butcher hasn't already. Make a cut about 1-inch deep and 1 1/2 inches long at the joint connecting the drumstick and thigh of each leg and at the joint connecting each of the wings and the breast.",
    "Place a small wire rack (or crumpled foil) in the bottom of a large stockpot (or other large pot like a canning or lobster pot) and add 6 cups of water. Place the turkey (minus the neck, gizzard, heart and liver) in the pot, and bring the water to a boil. Cover, reduce the heat to low, and steam the turkey for about 30 minutes.",
    "For the glaze: In a small bowl, mix together the cider, vinegar, Tabasco and salt. Set aside.",
    "Remove the pot with the turkey from the heat and heat the oven to 375 degrees. When the turkey is cool enough to handle, remove it from the pot (reserving the stock created from the steaming) and place it breast side up in a roasting pan. Put the pan in the heated oven, and cook the turkey for 30 minutes. Sprinkle the carrots and onions around it, and stir to coat them with any fat in the pan. Brush the turkey with the glaze, and continue to cook it in the oven for 1 1/2 hours longer, brushing it with the glaze occasionally. If the top of the bird begins to brown too much, cover it loosely with aluminum foil.",
    "While the turkey is roasting, pour the reserved stock into a bowl and let it rest until most of the fat rises to the surface, about 10 minutes. Skim off and discard as much fat as possible. Transfer the stock to a saucepan and add the turkey neck, gizzard and heart. (As a special treat, sauté the liver in a little butter, add salt and pepper and snack on it with a cold glass of white wine.) Bring the stock to a boil and reduce the heat to low. Simmer, partly covered, until reduced to 4 cups, about 1 hour. Remove the neck, gizzard and heart from the stock, pick the meat from the neck and coarsely chop the meat along with the gizzard and heart. (You should have about 2 cups of meat.) Return the chopped mixture to the stock.",
    "Remove the turkey from the oven when the breast and the leg register an internal temperature of about 160 degrees. Transfer to an ovenproof serving platter and, using small pliers and a fork, pull the sinews (which are visible at the drumstick tips) from the drumsticks through the tines of the fork, so you do not pull out chunks of meat along with the sinews. Discard the sinews. Keep the turkey warm, uncovered, in a 160-degree oven.",
    "For the sauce: Add the stock and giblets to the vegetables in the roasting pan and mix well with a wooden spoon, scraping the bottom. Transfer the contents to a saucepan and let rest for 5 minutes. Skim off as much fat from the surface as possible. Place the pan over medium-low heat, add the wine and potato-starch mixture and bring to a boil, stirring occasionally until it thickens. Simmer for 1 minute and season with salt and pepper to taste. Transfer to a warm sauceboat and serve."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 240.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 240.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 10.8,
      "unit": "G",
      "serving_size": 240.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 42.0,
      "unit": "KCAL",
      "serving_size": 240.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total Sugars",
      "amount": 10.8,
      "unit": "G",
      "serving_size": 240.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 8.0,
      "unit": "MG",
      "serving_size": 240.0,
      "serving_size_unit": "g"
    }
  ]
}