{
  "name": "Kimchi Radish Pickle",
  "categories": [],
  "servings": 1,
  "minutes": 45,
  "source_url": "https://cooking.nytimes.com/recipes/1014585-kimchi-radish-pickle",
  "image_urls": [
    "https://static01.nyt.com/images/2013/03/06/dining/06appe/06appe-square640.jpg",
    "https://static01.nyt.com/images/2013/03/06/dining/06appe/06appe-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "radishes a mix of different types",
      "amount": 2.6666666666666665,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "inch-long piece of fresh ginger root",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large garlic clove",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "anchovy fillets",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Scrub radishes well with a vegetable brush under cool running water. If using thick-skinned radishes such as watermelon, peel away any hairy or brown spots (you can either leave the rest of the skin on or peel radishes completely). If using small table radishes (usually red, purple, pink or white), trim away roots and most of the green stems, leaving 1/8 inch on top. Halve or quarter smaller radishes; cut larger radishes into bite-size wedges. ",
    "Place radishes in a bowl and toss with salt. Let rest for 20 minutes. Drain radishes in a colander set over a bowl, reserving brined juices. Rinse radishes quickly, then shake them to remove excess water. ",
    "Prepare the chile paste: In a large bowl, stir together 1/4 cup water with chile flakes, ginger, garlic, anchovies (if using) and sugar. Add drained radishes and mix well to coat with paste. Pack into a 1-quart jar (or 2 smaller jars), then pour the reserved brine into the bowl with the chile paste residue, swish it around to capture leftover seasonings, and pour brine into jar (the liquid will not cover the radishes). Cover and let stand at room temperature overnight. Refrigerate and eat within 1 week."
  ],
  "notes": [],
  "nutrition_infos": []
}