{
  "name": "La Reine de Saba—the Queen of Sheba Chocolate Almond Cake",
  "categories": [],
  "servings": 7,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/julia-childs-reine-de-saba-queen-of-sheba-cake-53036071",
  "image_urls": [
    "/verso/static/epicurious/assets/fallback-image-placeholder.jpeg"
  ],
  "ingredients": [],
  "instructions": [
    "My favorite chocolate cake. Preheat oven to 350°F, set rack in lower-middle level, and prepare the cake pan. Measure out 1/2 cup sifted plain bleached cake flour (see page 97) and 1/3 cup blanched pulverized almonds (see page 105). Using an electric mixer, cream 1 stick unsalted butter with 1/2 cup sugar; when fluffy, one at a time beat in 3 egg yolks. Meanwhile, melt 3 ounces semisweet chocolate and 1 ounce bitter chocolate with 2 tablespoons dark rum or strong coffee (see page 103), and stir the warm chocolate into the yolks. Beat 3 egg whites into stiff, shining peaks (see below), and stir a quarter of them into the yolks. Rapidly and delicately fold in the rest, alternating with sprinklings of almonds and siftings of flour. Turn at once into the prepared pan and bake about 25 minutes, until it has puffed to the top of the pan but the center moves slightly when gently shaken.",
    "Let cool 15 minutes before unmolding. This type of chocolate cake is always at its best at room temperature. Serve with a dusting of confectioners’ sugar, or with the soft chocolate icing on page 102.",
    "The Electric Mixer. Whether you are using a mixer on a stand or a hand-held mixer, use a round-bottomed glass, stainless-steel, or unlined copper bowl just wide enough to hold the mixer blade or blades, so that the entire mass is in continuous motion as you beat. This is essential for beating egg whites—as well as for beating whole eggs and sugar. (If you do any serious cooking, you’ll never regret investing in a professionally designed heavy-duty electric mixer. It costs money but it really does the work, and it will last you a lifetime.)",
    "Preparing Beater and Bowl. To make sure the beating bowl and beater are absolutely grease-free, pour 1 tablespoon of vinegar and 1 teaspoon of salt into the bowl and rub clean with a paper towel, then rub the beater with the towel. Do not rinse, since the trace of vinegar will help stabilize the egg whites. Be sure there is no trace of egg yolk in the whites.",
    "Beating. If the eggs are chilled, set bottom of bowl in hot water for a minute or so to warm briefly to room temperature. Whip them fast for 2 or 3 seconds, just to break them up, then start slow and gradually increase speed to fast, watching very carefully not to overbeat if you have a powerful mixer. They are done when a bit is lifted up in the wires of the beater and it forms a stiff, shining peak, bending down slightly at the tip.",
    "Beating Whole Eggs and Sugar “to the Ribbon.” The same general principles apply—the beater/bowl relationship, grease-free equipment, and warming the eggs over hot water if chilled. Beat 4 to 5 minutes or more, until they are thick and pale and a bit dropped from the beater forms a fat, slowly dissolving ribbon on the surface."
  ],
  "notes": [],
  "nutrition_infos": []
}