{
  "name": "Lemon Meringue Cookies",
  "categories": [],
  "servings": 24,
  "minutes": 120,
  "source_url": "https://cooking.nytimes.com/recipes/1021686-lemon-meringue-cookies",
  "image_urls": [
    "https://static01.nyt.com/images/2020/11/29/magazine/29mag-eat/29mag-eat-square640.jpg",
    "https://static01.nyt.com/images/2020/11/29/magazine/29mag-eat/29mag-eat-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/11/29/magazine/29mag-eat/29mag-eat-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "large egg white",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pure vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "70 grams all-purpose flour",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the meringue: Heat oven to 250 degrees and line a baking sheet with parchment paper. In a small bowl, stir together both sugars.",
    "Working with an electric mixer, beat the egg white, vinegar and salt on medium-high speed until the mixture forms soft peaks, about 3 minutes. Add the sugar mixture 1 tablespoon at a time, beating after each addition. Once the sugar is incorporated, beat 2 minutes more; you’ll have stiff, glossy, white peaks. Put the meringue on the baking sheet and spread it 1/4-inch thick. (It will cover only a small part of the sheet.)",
    "Bake the meringue undisturbed for 35 minutes. Turn off the heat, prop open the oven door and let it dry for 1 hour. When you’re ready to use it, chop it into pieces about the size of chocolate chips. Precision doesn’t matter.",
    "Make the shortbread: Working with a mixer (use the paddle if it’s a stand mixer), beat the butter, both sugars and the salt on medium speed for about 3 minutes, until smooth but not fluffy. On low speed, beat in the yolks, one at a time, followed by the vanilla. Add the flour in three additions, mixing on low until the dough comes together in large clumps. Turn out the dough and knead it into a ball. Cut the ball in half.",
    "Shape each half into a 6-inch log. Wrap it and refrigerate for at least 1 hour. (You could also freeze it for up to 2 months; leave it on the counter for 1 hour before baking.)",
    "When you’re ready to bake the cookies, heat oven to 350 degrees. Coat 1 or 2 muffin tins with butter (or nonstick baking spray).",
    "Slice each log into 12 rounds (each 1/2-inch thick); drop one into each muffin cup. (If you don’t have enough tins, you can work in batches.)",
    "Bake for 21 to 23 minutes, or until the cookies are golden brown around the rims. Transfer the tin(s) to a rack, cool for 5 minutes, then lift the cookies out and onto racks; cool to room temperature.",
    "Just before serving, top each cookie with lemon curd, then top with ample chunks of meringue, pressing them into the curd. The meringue will keep in a cool, dry place for a few days, and the cookies can be kept at room temperature for about 3 days. But once you top the cookies, they’re best eaten soon after."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    }
  ]
}