{
  "name": "Lemony Skillet Chicken and Brioche ",
  "categories": [],
  "servings": 4,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1024663-lemony-skillet-chicken-and-brioche",
  "image_urls": [
    "https://static01.nyt.com/images/2023/12/05/multimedia/CR-skillet-chicken-and-bread-qmcf/CR-skillet-chicken-and-bread-qmcf-square640.jpg",
    "https://static01.nyt.com/images/2023/12/05/multimedia/CR-skillet-chicken-and-bread-qmcf/CR-skillet-chicken-and-bread-qmcf-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/12/05/multimedia/CR-skillet-chicken-and-bread-qmcf/CR-skillet-chicken-and-bread-qmcf-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "boneless",
      "amount": 1.3333333333333333,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "chopped shallot",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "white miso",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "coarsely chopped dill or parsley",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 350 degrees. Season the chicken with salt and pepper and set aside. Heat 1 tablespoon of the butter and the olive oil over high in a large skillet. Once hot, sear the thighs in batches to avoid crowding, flatter sides down, until golden, about 4 minutes, then turn and sear the other sides briefly, just to cook the surface, about 1 minute. Transfer to a plate and turn the heat down to low. ",
    "Add the remaining 3 tablespoons butter to the pan. Once the butter is melted, whisk in the shallot and cook, stirring often, until slightly softened, about 1 minute. Whisk in the lemon juice, miso and 4 tablespoons water, scraping up any browned bits on the bottom of the pan. Turn off the heat and season with salt, if desired. Transfer to a small serving bowl and wipe the pan clean.",
    "Arrange the bread slices in the skillet, tearing a piece in half if necessary. (They don’t need to fit perfectly in the base and can come up the sides a little to get toastier at the tips.) ",
    "Place the chicken thighs, browned sides up, on top. (If you want the ratio of toasty brioche to be higher, place the chicken thighs more off-center on the slices.) Bake until the bottom and exposed tops of the bread are golden and the chicken is fully cooked, 15 to 20 minutes. ",
    "Right before serving, stir the sauce and spoon over the warm chicken and brioche, reserving some to serve on the side, if desired. The bread will soak up the sauce quickly, so spooning the sauce over the chicken and brioche when ready to eat will also allow you to control the moist-to-crunchy ratio. Top with dill and more black pepper, if desired. "
  ],
  "notes": [],
  "nutrition_infos": []
}