{
  "name": "Mini Sweet Potato Pies",
  "categories": [],
  "servings": 2,
  "minutes": 75,
  "source_url": "https://cooking.nytimes.com/recipes/1021639-mini-sweet-potato-pies",
  "image_urls": [
    "https://static01.nyt.com/images/2020/11/13/dining/13BAKING-2/13BAKING-2-square640.jpg",
    "https://static01.nyt.com/images/2020/11/13/dining/13BAKING-2/13BAKING-2-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/11/13/dining/13BAKING-2/13BAKING-2-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "0 ounces 285 grams",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 milliliters unsweetened full-fat coconut milk",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dark rum or vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/45 grams unsweetened coconut flakes",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "graham crackers",
      "amount": 5.0,
      "unit": "whole",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Start the filling: Prepare a steamer. Steam the sweet potato over medium-high heat until falling-apart tender, 15 to 20 minutes. Transfer the sweet potato to a food processor and purée until smooth. Alternatively, smash and stir with a heavy whisk until smooth.",
    "Meanwhile, make the crust: Heat oven to 350 degrees. Line 24 cups of a mini-muffin tin with paper liners. Mix the graham cracker crumbs with the butter, sugar, pumpkin pie spice and salt in a bowl until evenly combined.",
    "Divide mixture evenly among the mini-muffin liners (about 1 packed teaspoon per cup). Using a wine cork or your fingertips, firmly press the crumbs into an even layer. Bake until brown at the edges, 6 to 8 minutes.",
    "While the crust bakes, finish the filling: Smash the sugar, butter, pumpkin pie spice and salt until well combined, then stir in 3/4 cup sweet potato, the coconut milk and the rum until smooth. Stir in the egg until just incorporated.",
    "When the crusts are done, divide the filling among the hot crusts (about 1 tablespoon per cup). Sprinkle with the coconut flakes. Return to the oven and reduce the temperature to 325 degrees.",
    "Bake until the coconut is golden brown and the pies are set, 30 to 35 minutes. Cool in the pans on a wire rack until room temperature, then transfer to the refrigerator. Chill until cold, at least 2 hours."
  ],
  "notes": [],
  "nutrition_infos": []
}