{
  "name": "Mulled Cider With Cardamom, Black Pepper and Ginger",
  "categories": [],
  "servings": 16,
  "minutes": 55,
  "source_url": "https://cooking.nytimes.com/recipes/1020716-mulled-cider-with-cardamom-black-pepper-and-ginger",
  "image_urls": [
    "https://static01.nyt.com/images/2019/12/11/dining/sd-mulled-cider-copy/sd-mulled-cider-square640.jpg",
    "https://static01.nyt.com/images/2019/12/11/dining/sd-mulled-cider-copy/sd-mulled-cider-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/12/11/dining/sd-mulled-cider-copy/sd-mulled-cider-copy-superJumbo-v3.jpg"
  ],
  "ingredients": [
    {
      "name": "green cardamom pods",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "- to 5-inch piece fresh ginger",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small orange",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "apple cider",
      "amount": 1.0,
      "unit": "gal",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "-milliliter bottle rye whiskey",
      "amount": 375.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Put the cardamom pods on a cutting board. Lay the flat of a chef’s knife over them and gently smack the flat of the knife to lightly crush and crack the pods. Add the cardamom pods, peppercorns, cinnamon sticks and allspice berries to a medium skillet over medium-high heat. Toast the spices, shaking the pan often, until very fragrant, about 3 minutes.",
    "Transfer the cinnamon sticks into a large Dutch oven or pot. Tie up the remaining spices into a cheesecloth bundle, and add that to the slow cooker as well. (If you don’t have cheesecloth, you can use tea infusers or loose tea bags. You could also put the spices directly into the slow cooker, then strain the mixture as you serve.)",
    "Cut the piece of peeled ginger in half lengthwise and smash each piece by laying the flat of the knife over it and smacking with the heel of your hand.",
    "Put the ginger, lemon, orange, salt and apple cider into the Dutch oven. Bring it to a boil over high heat, then reduce the heat to maintain a low simmer and simmer for 30 minutes. (If you use unfiltered cider, some solids may rise to the top as you simmer; it’s not necessary to skim them, but if you find them unappetizing, you can.)",
    "Decrease the heat to its lowest setting. (Use a heat diffuser if you have one.) Stir in the vanilla. You can leave the cider on the stove for several hours. Set the rye whiskey by the stove so guests can spike their mugs, if desired, and set out cinnamon sticks and sliced citrus, so guests can garnish as they like."
  ],
  "notes": [],
  "nutrition_infos": []
}