{
  "name": "Old-Fashioned Butterscotch Pudding",
  "categories": [],
  "servings": 4,
  "minutes": 150,
  "source_url": "https://cooking.nytimes.com/recipes/1021800-old-fashioned-butterscotch-pudding",
  "image_urls": [
    "https://static01.nyt.com/images/2021/01/20/dining/15Apperex/15Apperex-square640.jpg",
    "https://static01.nyt.com/images/2021/01/20/dining/15Apperex/merlin_182183349_dffca039-0a09-427b-986c-122d8b4bef5a-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/01/20/dining/15Apperex/merlin_182183349_dffca039-0a09-427b-986c-122d8b4bef5a-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "large egg yolks",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cornstarch",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/480 milliliters whole milk",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/240 milliliters heavy cream",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "bourbon or scotch whisky",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Put egg yolks, cornstarch and salt into a large heatproof bowl, and whisk until the mixture is smooth and there are no lumps.",
    "In a medium pot over medium heat, combine brown sugar and butter, whisking, until the brown sugar melts, 1 to 2 minutes. Let cook, whisking constantly, until the mixture starts to smell like hot caramel and darkens slightly, about 1 minute longer. (Don’t walk away, or the mixture may burn.)",
    "Immediately pour the milk and cream into the pot. (It will bubble fiercely and seize up.) Continue to cook, whisking constantly, until the clumps melt, 2 to 4 minutes.",
    "Slowly whisk about 1/2 cup of the hot cream mixture into the bowl with the egg yolks, whisking yolks until smooth, then whisk in the remaining hot cream mixture. Pour the egg-cream mixture back into the saucepan and place it over medium heat.",
    "Cook pudding, whisking constantly especially around the bottom and edges of the pot, until it comes to a full boil. (Don’t worry about the eggs curdling. You’re going to strain the mixture later.) Reduce heat to medium-low and cook, stirring the mixture constantly, until it thickens enough to mound thickly on the spoon, 4 to 7 minutes. If at any point the pudding looks curdled, whisk to help smooth it out.",
    "Strain mixture through a fine sieve into a heatproof container or bowl, then stir in the Scotch or bourbon, if using, and vanilla. To prevent a skin from forming, press plastic wrap directly onto the surface of the pudding. (If you like the skin, don’t cover pudding until it cools.) Chill for at least 2 hours and up to 2 days.",
    "When serving, spoon pudding into dishes. Top with dollops of whipped cream, sour cream or crème fraîche, and any of the optional garnishes."
  ],
  "notes": [],
  "nutrition_infos": []
}