{
  "name": "Pancakes",
  "categories": [],
  "servings": 1,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/pancakes-59d0f2e2aa96a75e7a268a55",
  "image_urls": [
    "/verso/static/epicurious/assets/fallback-image-placeholder.jpeg"
  ],
  "ingredients": [],
  "instructions": [
    "Even the most basic pancake recipe can be improved upon when you keep a few key components in mind. To start, you need the right ingredients. The best flour for pancakes is all-purpose; for a change of pace, substitute cornmeal, buckwheat flour, or whole-wheat flour for half the all-purpose flour. When leavening with baking powder and/or soda, mixing the batter is critical. There are two stages: whisking together the dry ingredients, and whisking the wet ingredients into the dry. Don’t whisk until smooth and even, or the gluten in the flour will develop and produce a tough texture. Instead, stop mixing while the batter is still slightly lumpy, with a few clumps of unmoistened dry ingredients remaining. It is the interaction of liquid and the pockets of dry ingredients during cooking that produces fluffy pancakes. For best results, cook the pancakes right away; do not let the batter sit longer than it takes to heat your pan.",
    "Next, be aware of your cooking surface. The ideal surface is very flat and distributes heat evenly. The best option is a griddle, followed by a large cast-iron skillet or nonstick frying pan. Whichever surface you use, make sure it’s at the right temperature when you begin. You can test for this by flicking a few drops of water onto the surface; if they bounce, sizzle, and disappear in a second, your pan is ready.",
    "Poor quality in the first batch is a common problem with pancakes, but it needn’t be this way.",
    "The culprit is often too much fat on the griddle. If more than a very thin layer is used, it gathers in tiny puddles beneath the batter, which in turn lifts small bits off the griddle so they never have the chance to brown properly. Instead, melt only a small amount of butter or fat, and wipe the excess away with a folded paper towel. This should ensure that your first batch is as fluffy as the last.",
    "Now it’s time to ladle in the batter. If using fruit, place on top of the batter right after it’s poured, distributing the fruit evenly. When the batter surface is covered with little bubbles, some of which have begun to break, it’s time to flip. The bursting bubbles are letting gas escape, so flip at just this moment, before too many have popped."
  ],
  "notes": [],
  "nutrition_infos": []
}