{
  "name": "Pastry for Pies and Tarts",
  "categories": [],
  "servings": 8,
  "minutes": 65,
  "source_url": "https://www.bettycrocker.com/recipes/pastry-for-pies-and-tarts/e74dfc22-dd54-4564-b653-0f142faf91a2",
  "image_urls": [
    "https://mojo.generalmills.com/api/public/content/_jz8g7meKUqxwkSyxA5Uvw_gmi_hi_res_jpeg.jpeg?v=b79ffe37&t=b5673970ed9e41549a020b29d456506d"
  ],
  "ingredients": [
    {
      "name": "cup",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "original_string": "1  cup plus 1 tablespoon all-purpose flour",
      "nutrition_infos": []
    },
    {
      "name": "salt",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "original_string": "1/2  teaspoon salt",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 78600.0,
          "unit": "MG",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "cold shortening",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "original_string": "1/3  cup cold shortening",
      "nutrition_infos": []
    },
    {
      "name": "to 5 tablespoons ice-cold water",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "original_string": "3  to 5 tablespoons ice-cold water",
      "nutrition_infos": []
    },
    {
      "name": "cups",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "original_string": "2  cups plus 2 tablespoons all-purpose flour",
      "nutrition_infos": []
    },
    {
      "name": "salt",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "original_string": "1  teaspoon salt",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 39300.0,
          "unit": "MG",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "cold shortening",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "original_string": "2/3  cup cold shortening",
      "nutrition_infos": []
    },
    {
      "name": "to 8 tablespoons ice-cold water",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "original_string": "6  to 8 tablespoons ice-cold water",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "One-Crust Pastry: In medium bowl, mix flour and salt. Cut in shortening, using pastry blender or fork, until mixture forms coarse crumbs the size of small peas. Sprinkle with water, 1 tablespoon at a time, tossing with fork until all flour is moistened and pastry almost leaves side of bowl (1 to 2 teaspoons more water can be added if necessary). Gather pastry into a ball. Shape into flattened round on lightly floured surface. Wrap flattened round in plastic wrap and refrigerate 45 minutes or until dough is firm and cold, yet pliable. This allows the shortening to become slightly firm, which helps make the baked pastry flaky. If refrigerated longer, let pastry soften slightly at room temperature before rolling. Using floured rolling pin, roll pastry on lightly floured surface (or pastry board with floured pastry cloth) into round 2 inches larger than upside-down 9-inch glass pie plate or 3 inches larger than 10- or 11-inch tart pan. Fold pastry into fourths and place in pie plate or tart pan, or roll pastry loosely around rolling pin and transfer to pie plate or tart pan. Unfold or unroll pastry and ease into plate or pan, pressing firmly against bottom and side and being careful not to stretch pastry, which will cause it to shrink when baked. For pie, trim overhanging edge of pastry 1 inch from rim of pie plate. Fold edge under to form standing rim; flute edges. For tart, trim overhanging edge of pastry even with top of tart pan. Fill and bake as directed in pie or tart recipe.",
    "Two-Crust Pastry: In medium bowl, mix flour and salt. Cut in shortening, using pastry blender or fork, until mixture forms coarse crumbs the size of small peas. Sprinkle with water, 1 tablespoon at a time, tossing with fork until all flour is moistened and pastry almost leaves side of bowl (1 to 2 teaspoons more water can be added if necessary). Gather pastry into a ball. Divide pastry in half and shape into 2 rounds on lightly floured surface. Wrap flattened rounds in plastic wrap and refrigerate 45 minutes or until dough is firm and cold, yet pliable. This allows the shortening to become slightly firm, which helps make the baked pastry flaky. If refrigerated longer, let pastry soften slightly at room temperature before rolling. Using floured rolling pin, roll one round of pastry on lightly floured surface (or pastry board with floured pastry cloth) into round 2 inches larger than upside-down 9-inch glass pie plate. Fold pastry into fourths and place in pie plate, or roll pastry loosely around rolling pin and transfer to pie plate. Unfold or unroll pastry and ease into plate, pressing firmly against bottom and side and being careful not to stretch pastry, which will cause it to shrink when baked. Spoon desired filling into bottom crust. Trim overhanging edge of bottom crust 1/2 inch from rim of plate. Roll out second pastry round. Fold into fourths and place over filling, or roll loosely around rolling pin and place over filling. Unfold or unroll pastry over filling. Cut slits in pastry so steam can escape. Trim overhanging edge of top pastry 1 inch from rim of plate. Fold edge of top crust under bottom crust, forming a stand-up rim of pastry that is even thickness on edge of pie plate, pressing on rim to seal; flute edges. Bake as directed in pie recipe."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 78600.0,
      "unit": "MG",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    }
  ]
}