{
  "name": "Pecan Pie Sandwich Cookies",
  "categories": [],
  "servings": 22,
  "minutes": 90,
  "source_url": "https://cooking.nytimes.com/recipes/1021640-pecan-pie-sandwich-cookies",
  "image_urls": [
    "https://static01.nyt.com/images/2020/11/13/dining/13BAKING-3/13BAKING-3-square640.jpg",
    "https://static01.nyt.com/images/2020/11/13/dining/13BAKING-3/13BAKING-3-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/11/13/dining/13BAKING-3/13BAKING-3-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/150 grams pecan halves",
      "amount": 1.3333333333333333,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "55 grams all-purpose flour",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolk",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/80 milliliters dark corn syrup",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/175 grams pecan halves",
      "amount": 2.6666666666666665,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the cookies: Combine the pecans and 1/2 cup/65 grams flour in a food processor or blender and pulse until the pecans are coarsely ground with pebbly bits remaining.",
    "Using a stand mixer fitted with the paddle attachment, beat the butter, both sugars and salt on low speed until creamy and smooth. Scrape the bowl and add the egg yolk and vanilla. Beat on medium-low speed until fully incorporated. Scrape the bowl and add the pecan mixture and remaining 1 1/2 cups/190 grams flour. Beat on low speed until the dough comes together. Press into four 1/2-inch-thick squares and wrap each in plastic wrap. Refrigerate until firm, at least 3 hours and up to 2 days.",
    "When you’re ready to bake, heat oven to 350 degrees. Place 1 dough square on a generously floured surface and sprinkle with more flour. With a floured rolling pin, roll to a scant 1/4-inch thickness, moving and flouring the dough as needed to prevent sticking. Using a floured 2 1/2-inch round cutter, cut out rounds as close together as possible and transfer to a parchment-lined cookie sheet, using a thin spatula if necessary, spacing them 1/2 inch apart.",
    "Gather the scraps, roll and cut again. If desired, cut out a 1-inch circle from half of the cookies using a cookie cutter or the wide end of a pastry tip. If your dough becomes too soft to cut after rolling, pop it in the freezer until firm again.",
    "Bake until golden brown, about 15 minutes. Repeat with the remaining dough. Cool the cookies completely on the sheets on wire racks.",
    "Make the filling: Combine the butter, brown sugar, corn syrup and salt in a small saucepan and clip a candy thermometer to the side of the pot if you have one. Bring to a boil over medium-high heat, stirring occasionally to melt the butter. Continue boiling, stirring occasionally, until dark brown and thickened to the consistency of caramel sauce, 2 to 4 minutes. The candy thermometer should register 230 degrees. Remove from the heat and carefully add the bourbon. Stir until incorporated, then stir in the pecans until evenly coated.",
    "Flip over half of the cookies. Carefully scoop a tablespoon of the hot filling and scrape it onto a cookie with another spoon. Spread it in an even layer with the spoon and very gently press another cookie on top to sandwich. Flip the sandwich over so the filling can set evenly. Repeat with the remaining cookies and filling. Cool completely."
  ],
  "notes": [],
  "nutrition_infos": []
}