{
  "name": "Pitta bread",
  "categories": [],
  "servings": 8,
  "minutes": 60,
  "source_url": "https://www.bbcgoodfood.com/recipes/pitta-bread",
  "image_urls": [
    "@type",
    "height",
    "url",
    "width"
  ],
  "ingredients": [
    {
      "name": "fast-action dried yeast",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "strong white bread flour",
      "amount": 500.0,
      "unit": "g",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Mix the yeast with 300ml warm water in a large bowl. Leave to sit for 5 mins until the yeast is super bubbly then tip in the flour, salt and olive oil. Bring the mixture together into a soft dough. Don’t worry if it looks a little rough round the edges.",
    "Tip the dough onto a lightly floured work surface. Knead for 5-10 mins until you have a soft, smooth and elastic dough. Try to knead using as little extra flour as possible, just enough so that the dough doesn’t stick – this will keep the pittas light and airy. Once kneaded, place in a lightly oiled bowl, cover with a tea towel and leave to double in size, approximately 1 hour.",
    "Heat oven as high as it will go (ideally 250C/230C fan/gas 9) and put a large baking tray on the middle shelf of the oven to get searingly hot. Divide the dough into eight balls then flatten each into a disc with the palm of your hand. On a lightly floured surface, roll each disc into an oval, around 20cm long, 15cm wide and 3-5mm thick.",
    "Carefully remove the hot tray from the oven. Dust with flour then place your pittas directly onto it – you may have to do this in batches. Return swiftly to the oven and bake for 4-5 mins, or until the pittas have puffed up and are a pale golden colour. Wrap each hot pitta in a clean tea towel once it's baked to keep it soft while the others cook."
  ],
  "notes": [],
  "nutrition_infos": []
}