{
  "name": "Reconstituted Steamed Couscous",
  "categories": [],
  "servings": null,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1014242-reconstituted-steamed-couscous",
  "image_urls": [
    "https://static01.nyt.com/images/2009/02/23/health/23recipehealth_600/23recipehealth_600-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "couscous use 1 3 cup dry couscous per person",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "to 1 cup of broth",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "a tablespoon or two of olive oil",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Place the couscous in a bowl. Add 1/2 teaspoon salt (preferably kosher salt) per cup of couscous and mix together. Combine 1/2 to 1 cup of broth from the stew you plan to serve with the couscous with enough warm water to cover the couscous by about 1/2 inch. Let sit for 20 minutes, until the liquid is absorbed. Stir every five minutes with a wooden spoon, or rub the couscous between your moistened thumbs and fingers so that it doesn’t lump. The couscous will now be fairly soft; fluff it with a fork or with your hands. Add a tablespoon or two of olive oil, rubbing the couscous between your fingers to distribute the oil throughout. Have the stew at a simmer. Line a colander, sieve or the top part of a couscoussier (a special pot for couscous) with a single layer of cheesecloth, and place the couscous in it. Set it over the stew, making sure that the bottom of the colander does not touch the liquid (remove some of the liquid if it does). Wrap a towel between the edge of the colander and the pot if there is a space, so that steam doesn’t escape. Steam 20 to 30 minutes. The couscous should be fluffy, the grains dry and separate, not al dente and not mushy."
  ],
  "notes": [],
  "nutrition_infos": []
}