{
  "name": "Rice and Nut Stuffing",
  "categories": [],
  "servings": 6,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/446-rice-and-nut-stuffing",
  "image_urls": [
    "https://static01.nyt.com/images/2014/04/14/dining/Rice-and-Nut-Stuffing/Rice-and-Nut-Stuffing-square640.jpg",
    "https://static01.nyt.com/images/2014/04/14/dining/Rice-and-Nut-Stuffing/Rice-and-Nut-Stuffing-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "extra virgin olive oil or butter",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pine nuts or shelled pistachios",
      "amount": 3.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "raisins or currants",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Preheat oven to 400 degrees. If baking stuffing outside of bird, grease a 2-quart casserole, large gratin dish or 9-by-13-inch baking dish with olive oil.",
    "Bring a large pot of water to boil; salt it. Add rice and simmer, stirring occasionally, until it becomes tender but not mushy, 15 to 20 minutes. Drain it, rinse it and drain it again.",
    "Heat 1/4 cup oil or butter in a large deep skillet over medium heat for 2 minutes. Toss in nuts and raisins or currants, if you are using them, and stir for a minute or 2. Add rice and stir, sprinkling with salt and pepper, while cooking for another minute; rice need not get hot. Add more oil or butter as needed to moisten mixture thoroughly. Add lemon juice and half the herbs. Taste and adjust seasonings if necessary. (You may prepare recipe in advance up to this point; refrigerate, well wrapped or in a covered container, for up to 2 days before proceeding.)",
    "Use stuffing to fill bird. Or put stuffing in prepared pan, cover tightly with foil and bake until rice is tender, 25 to 30 minutes. Uncover and bake until mixture top is nicely browned, another 10 to 15 minutes or so."
  ],
  "notes": [],
  "nutrition_infos": []
}