{
  "name": "Roast Leg of Young Lamb",
  "categories": [],
  "servings": 13,
  "minutes": 80,
  "source_url": "https://cooking.nytimes.com/recipes/11076-roast-leg-of-young-lamb",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/5.jpg?1"
  ],
  "ingredients": [
    {
      "name": "leg of young lamb",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large cloves garlic",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "sprigs of fresh thyme",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "oregano oil or extra-virgin olive oil",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "savory-flavored vinegar or flavorful wine vinegar",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "lamb stock see recipe",
      "amount": 1.3333333333333333,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Trim and discard excess fat from lamb. Using a sharp-pointed knife, make little angled incisions all over the lamb and stuff the incisions with slices of garlic and sprigs of the fresh herbs. Rub lamb with the oil; then sprinkle with salt and freshly ground black pepper. Set lamb aside in a cool place to marinate for at least 2 hours.",
    "When ready to cook, preheat oven to 450 degrees. Put lamb on a rack in a roasting pan and roast 30 minutes. Reduce heat to 300 degrees and cook 30 to 50 minutes longer, depending on the size. Total cooking time for medium rare should be 10 minutes to the pound. When lamb is done, remove to a serving platter and let rest 10 to 20 minutes before carving.",
    "Meanwhile, prepare sauce by first removing fat from roasting pan and setting pan over medium-high heat. Add vinegar to pan and boil, stirring with a wooden spoon and scraping to get all the brown bits. Add stock, raise heat to high and boil about 5 minutes to thicken stock. Remove from heat and taste, adding salt and pepper if necessary. Strain sauce into a gravy bowl to serve with carved lamb."
  ],
  "notes": [],
  "nutrition_infos": []
}