{
  "name": "Roasted White Fish With Lemony Almondine",
  "categories": [],
  "servings": 4,
  "minutes": 20,
  "source_url": "https://cooking.nytimes.com/recipes/1023967-roasted-white-fish-with-lemony-almondine",
  "image_urls": [
    "https://static01.nyt.com/images/2023/03/01/multimedia/22appe-fishrex-thck/22appe-fishrex-thck-square640.jpg",
    "https://static01.nyt.com/images/2023/03/01/multimedia/22appe-fishrex-thck/22appe-fishrex-thck-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/03/01/multimedia/22appe-fishrex-thck/22appe-fishrex-thck-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "- to 8-ounce fillets flaky white fish",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "minced chives",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 450 degrees. Place fish on a rimmed sheet pan and season fillets lightly with salt and black pepper on both sides. Cut 1 tablespoon butter into small pieces and scatter on top of the fish. Roast for 7 to 11 minutes, or until the fish is tender and cooked through. (Thin fillets will cook more quickly than thick ones.)",
    "While fish roasts, in a large skillet, melt remaining 6 tablespoons butter over medium heat. Cook, swirling the pan, until the foam subsides and the butter turns a deep nut brown, 3 to 7 minutes. (Watch carefully so that it doesn’t burn.)",
    "Add almonds to the pan and turn off the heat; the nuts will immediately start to brown. Toss them in the hot butter until golden, about 2 minutes, turning the heat back on to low if the nuts need a little more color. Squeeze the juice from half a lemon into the pan and stir in half of the grated lemon zest, the chives, ½ teaspoon salt and ¼ teaspoon black pepper. Taste and add more lemon juice and salt, if needed.",
    "Pour the sauce over the fish and garnish with more chives and lemon zest. Serve warm, with the remaining lemon half on the side for squeezing. (You can cut it into wedges, if you like.)"
  ],
  "notes": [],
  "nutrition_infos": []
}