{
  "name": "Rye Tarte Tatin",
  "categories": [],
  "servings": 8,
  "minutes": 120,
  "source_url": "https://cooking.nytimes.com/recipes/1019899-rye-tarte-tatin",
  "image_urls": [
    "https://static01.nyt.com/images/2019/01/23/dining/23mokonutsrex2/23mokonutsrex2-square640-v2.jpg",
    "https://static01.nyt.com/images/2019/01/23/dining/23mokonutsrex2/23mokonutsrex2-videoSixteenByNineJumbo1600-v2.jpg",
    "https://static01.nyt.com/images/2019/01/23/dining/23mokonutsrex2/23mokonutsrex2-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "flavorful honey",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "945 milliliters greek yogurt",
      "amount": 32.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "30 grams rye flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "30 grams all-purpose flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "195 grams cold butter 1 3/4 sticks",
      "amount": 14.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cider vinegar",
      "amount": 3.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/60 milliliters cold water",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cooking apples",
      "amount": 4.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the sorbet, if desired: In a small pot, combine sugar, honey, salt and 1/2 cup/120 milliliters water. Bring to a boil, then reduce heat and simmer until sugar is dissolved, 3 to 5 minutes.",
    "In a large bowl, whisk the yogurt until it loosens, then whisk in honey syrup and lemon juice to taste. Chill mixture until very cold, at least 2 hours. Freeze the sorbet in an ice-cream machine according to manufacturer’s instructions. Transfer to a container and store in freezer. Sorbet can be made up to 1 week in advance.",
    "Make the crust: In the bowl of a food processor, pulse together rye flour, all-purpose flour and salt. Briefly pulse in butter, then drizzle in cider vinegar and cold water. Pulse until dough starts to come together, drizzling in more water if it looks too dry (you may need to add several more tablespoons). Remove dough from food processor, pat into a disc, and wrap in plastic wrap. Chill for at least 1 hour and up to 5 days. (You can also make the dough by hand, cutting the butter into the flour mixture using two knives or a pastry cutter and drizzling in the cider vinegar and water.)",
    "Heat oven to 400 degrees, and place a rimmed baking sheet on a rack in the middle of the oven.",
    "Prepare the apple filling: Brush bottom and sides of a deep 10-inch sauté pan with softened butter, then sprinkle evenly with sugar.",
    "Peel apples. Cut down one side of the apples as close to the core as possible. Rotate and cut the opposite side, so you end up with two large rounded pieces (the apple \"cheeks\"). Cut off the remaining smaller pieces on the sides, keeping them separate. Arrange as many of the apples cheeks, round side down, as you can fit in one layer in the prepared sauté pan, snuggling them together. Top with all of the remaining apple pieces, big and small. You will have two layers of apples.",
    "On a lightly floured work surface, roll dough out to a 12-inch circle. Trim into an 11-inch circle and prick all over with tines of a fork. Place on top of apples and tuck excess into the sides.",
    "Place skillet on a burner over high heat and cook until bubbling juices turn deep amber and smell like caramel and brown butter, 13 to 20 minutes. (Lower heat to medium-high if it starts to bubble too vigorously.) The juicier the apples, the longer this will take. The pastry will start to melt over the apples and that is O.K.",
    "Transfer skillet to the rimmed baking sheet in oven and bake until crust is golden brown, 35 to 45 minutes. Transfer to a rack and let cool for 5 minutes.",
    "If you made the sorbet, take it out of the freezer about 20 minutes before serving (otherwise it may be too hard to scoop).",
    "To serve, run a butter knife along the inside edge of the skillet to dislodge any stuck pastry. Put a large serving platter over the skillet and, quickly and carefully using oven mitts, flip the tart onto the serving platter. Cool for at least 15 minutes, then slice and serve, with the sorbet if you like."
  ],
  "notes": [],
  "nutrition_infos": []
}