{
  "name": "Sabbathday Lake’s Shaker Lemon Pie",
  "categories": [],
  "servings": 6,
  "minutes": 75,
  "source_url": "https://cooking.nytimes.com/recipes/971-sabbathday-lakes-shaker-lemon-pie",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/12.jpg?1"
  ],
  "ingredients": [
    {
      "name": "eggs beaten well",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "white all-purpose flour",
      "amount": 1.6666666666666667,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vegetable shortening or lard",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "to 4 tablespoons cold water",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Begin with the filling. Wash lemons; cut off both ends and discard. Slice lemons very thinly, rinds and all. Place in a mixing bowl and cover with sugar. Stir to mix well. Cover and set aside for 2 hours or longer.",
    "While lemons are macerating, make pie crust dough. Sift together flour and salt into a large mixing bowl. Mix in shortening until pieces are the size of peas. Gradually add water, a tablespoon at a time, until dough is soft and easy to work. Do not mix too much.",
    "Divide dough in two, one piece slightly larger than the other, and form two balls. Wrap each in paper or plastic film and refrigerate 30 minutes or longer.",
    "When ready to assemble pie, roll out the two portions of dough on a floured board.",
    "Preheat oven to 450 degrees.",
    "Line a 9-inch pie plate with larger portion of pastry. To the lemon mixture, add the eggs (the sugar will have dissolved into a syrup). Mix well to blend. Pour into the pie shell. Top with the second piece of dough. Crimp edges well to prevent leaking and cut a few air vents in the top.",
    "Place pie on a cookie sheet in preheated oven and bake 15 minutes. Reduce heat to 350 degrees and bake 30 minutes longer, or until a knife inserted in center comes out clean."
  ],
  "notes": [],
  "nutrition_infos": []
}