{
  "name": "Salted Peanut and Caramel Matzo Brittle",
  "categories": [],
  "servings": 10,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1023011-salted-peanut-and-caramel-matzo-brittle",
  "image_urls": [
    "https://static01.nyt.com/images/2022/04/06/dining/01Matzorex/01Matzorex-square640.jpg",
    "https://static01.nyt.com/images/2022/04/06/dining/01Matzorex/merlin_204710154_4b153eca-2f89-4389-9104-3707cb99cdc0-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/04/06/dining/01Matzorex/merlin_204710154_4b153eca-2f89-4389-9104-3707cb99cdc0-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "square matzos",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "200 grams smooth peanut butter",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/105 grams roasted",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 375 degrees and line a rimmed 11-by-17 or 12-by-18-inch baking sheet with parchment paper, covering the pan and extending over the sides.",
    "Lay 2 matzo squares in the pan, positioning the concave side up to best retain the caramel. Then, like a puzzle, fit the remaining matzo onto the baking sheet, carefully breaking pieces to fill the entire baking pan in one layer. (Don’t worry if they are not perfect; the brittle will be cut up later.)",
    "In a medium saucepan, melt the butter and brown sugar over medium heat, stirring constantly until the mixture comes to a boil, about 6 minutes. Boil just until very bubbly, another 2 to 3 minutes, then remove from heat and pour over the matzo, covering completely. Working quickly, spread the caramel using a heatproof spatula, then spoon it on top if it spills between the cracks in the matzo.",
    "Place the baking sheet in the oven and reduce the temperature to 325 degrees. Bake for 10 to 12 minutes, checking to make sure the edges and top are not burning.",
    "Once the matzo is almost done baking, heat the peanut butter in a microwave until slightly warmed and easily pourable, about 20 to 30 seconds on high.",
    "Remove the matzo from the oven and drizzle the warmed peanut butter on top, then sprinkle with the peanuts, then the salt. Cool, break into pieces then transfer to a lidded container. Brittle is best — and at its snappiest — when chilled. Refrigerate it for at least 30 minutes or freeze for 15 until peanut butter firms up. Brittle will keep up to 1 month frozen; let it thaw for about 10 minutes before serving."
  ],
  "notes": [],
  "nutrition_infos": []
}