{
  "name": "Salted Margarita Bars",
  "categories": [],
  "servings": 16,
  "minutes": 165,
  "source_url": "https://cooking.nytimes.com/recipes/1022342-salted-margarita-bars",
  "image_urls": [
    "https://static01.nyt.com/images/2021/06/22/dining/vv-salted-margarita-bars/merlin_189706209_61319b8c-5761-4afe-a91d-1ef39f36ab3e-square640.jpg",
    "https://static01.nyt.com/images/2021/06/22/dining/vv-salted-margarita-bars/merlin_189706209_61319b8c-5761-4afe-a91d-1ef39f36ab3e-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/06/22/dining/vv-salted-margarita-bars/merlin_189706209_61319b8c-5761-4afe-a91d-1ef39f36ab3e-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "tequila preferably blanco",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "orange liqueur",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "can sweetened condensed milk",
      "amount": 7.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 350 degrees. Lightly grease a 9-inch square baking pan with butter (or use the wrapper from your stick of butter). Line the buttered pan with parchment, leaving an overhang on two sides. (This will help you pull the bars out of the pan easily.)",
    "Prepare the crust: In a food processor, pulse the saltines until ground like coarse sand. (Alternatively, place them in a zip-top bag and use a rolling pin to crush them.) It’s OK if there are a few larger pieces. Add the melted butter, sugar and salt, and pulse a few more times until all the crumbs are evenly saturated (or mix to combine in a medium bowl). Pour the mixture into the lined pan, press into an even layer and freeze for about 15 minutes. ",
    "After the crust has chilled, bake it until fragrant and golden brown, about 15 to 18 minutes. ",
    "While the crust cools, make the filling: In a liquid measuring cup or small bowl, combine the lime zest, lime juice, tequila, orange liqueur and salt. ",
    "In a medium bowl, whisk together the yolks and sweetened condensed milk. Add the tequila-lime mixture to the yolk mixture, whisk to combine, then pour into the prepared crust. (It’s OK if the crust is not yet completely cool.) You may be tempted to prepare the curd earlier, but don’t do so more than 10 minutes before baking, as the lime juice will start to thicken it, which could affect the bake.",
    "Bake 15 to 17 minutes until the curd is set around the edges and slightly jiggly in the center.",
    "Transfer to a rack to cool slightly, then freeze for at least 2 hours.",
    "After freezing, remove the bars from the pan using the parchment paper overhang and transfer to a cutting board. Sprinkle with flaky salt, cut into 16 bars and serve right away. Store leftovers in the freezer. Cheers!"
  ],
  "notes": [],
  "nutrition_infos": []
}