{
  "name": "Salted Caramels",
  "categories": [],
  "servings": 32,
  "minutes": 255,
  "source_url": "https://cooking.nytimes.com/recipes/1023719-salted-caramels",
  "image_urls": [
    "https://static01.nyt.com/images/2022/12/12/multimedia/12candyrex2-caramels/12candy3-1-1520-square640.jpg",
    "https://static01.nyt.com/images/2022/12/12/multimedia/12candyrex2-caramels/12candy3-1-1520-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/12/12/multimedia/12candyrex2-caramels/12candy3-1-1520-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/360 grams heavy cream",
      "amount": 1.3333333333333333,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "seeds scraped from 1 2 vanilla bean pod reserved",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "4 grams whole coffee beans",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/85 grams light corn syrup",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Prepare the pan: Lightly coat the inside of an 8-inch square pan with vegetable oil spray. Line the bottom and sides with parchment paper, smoothing to eliminate air bubbles, then lightly spray the parchment paper. Set the pan aside.",
    "Heat and infuse the cream: In a small saucepan, combine the cream, vanilla seeds and pod. Place the coffee beans, if using, inside a resealable bag and crush them with a rolling pin until they’re broken into bits. Add the coffee to the cream mixture. Bring the cream mixture to a simmer over medium heat, then reduce the heat to the lowest setting and keep the mixture warm while you make the caramel.",
    "Make the caramel: Fill a glass with water, place a pastry brush inside and set next to the stove. Combine the sugar, corn syrup and 1/3 cup/142 grams water in a large, heavy saucepan and stir gently with a heatproof spatula over medium-high heat to dissolve the sugar, about 3 minutes. Let the mixture come to a boil and use the wet pastry brush to brush down the sides of the saucepan and dissolve any stuck-on sugar crystals. Boil the mixture without stirring, occasionally swirling the saucepan gently and brushing down the sides of the saucepan if you see crystals forming, until the syrup takes on a pale golden color and the bubbles become large and slow to pop (a sign that the water had boiled off and caramelization is near), about 5 minutes. Turn the heat to medium and continue to cook, keeping a close watch and swirling the saucepan frequently, until the bubbling has mostly subsided and the mixture is very fluid and a deep amber color, 4 to 7 minutes.",
    "Immediately remove the saucepan from the heat and add the butter a few pieces at a time, stirring with a heatproof spatula (this will halt the cooking; be careful, the caramel will sputter). Gradually pour the cream mixture through a fine-mesh strainer into the saucepan with the caramel mixture and stir until the caramel is completely smooth. (Discard the solids in the strainer.) Stir in the kosher salt.",
    "Cook the caramel again: Return the saucepan to the heat and bring to a boil over medium-high heat. Clip a candy thermometer to the side of the saucepan and cook, occasionally scraping the bottom and sides of the saucepan with the spatula, until the mixture reaches 250 degrees for softer caramels or 255 degrees for firmer caramels. Immediately remove the saucepan from the heat and pour the mixture into the prepared pan.",
    "Cool and cut the caramels: Allow the caramel mixture to cool in the pan for about 15 minutes, then sprinkle with flaky salt (if using). Let the caramels cool completely at room temperature, which will take several hours. Before cutting the caramels, refrigerate the pan for 15 minutes, then use the parchment paper to lift the slab out of the pan and transfer to a cutting board. Use a chef’s knife to cut the slab in quarters in one direction and in eighths in the other to make 32 bar-shaped caramels. Wrap them individually in parchment paper, waxed paper or foil candy wrappers."
  ],
  "notes": [],
  "nutrition_infos": []
}