{
  "name": "Salt and Pepper Tofu",
  "categories": [],
  "servings": 4,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1023343-salt-and-pepper-tofu",
  "image_urls": [
    "https://static01.nyt.com/images/2022/07/19/dining/hm-salt-and-pepper-tofu/hm-salt-and-pepper-tofu-square640.jpg",
    "https://static01.nyt.com/images/2022/07/19/dining/hm-salt-and-pepper-tofu/merlin_209335443_68354d62-e10a-48d3-86bc-5b5e6d2fcdf6-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/07/19/dining/hm-salt-and-pepper-tofu/merlin_209335443_68354d62-e10a-48d3-86bc-5b5e6d2fcdf6-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ground ginger",
      "amount": 2.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "package firm tofu",
      "amount": 7.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cornstarch",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "scallions",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "To make the seasoning, combine the salt, sugar, white pepper, five-spice powder and ground ginger in a small bowl, and stir to combine. Set aside.",
    "Place the drained tofu onto a clean kitchen towel and pat dry. Cut the tofu into ¾-inch cubes.",
    "Scatter ¼ cup of the cornstarch onto a large plate or sheet pan. Carefully place the tofu cubes onto the cornstarch, then scatter the remaining cornstarch on top of the tofu. Using clean hands, gently dab each side of the tofu into the cornstarch until it is coated on all sides.",
    "Line a large plate with a paper towel or a clean kitchen towel.",
    "Heat a large (12-inch) nonstick or well seasoned cast-iron skillet on medium-high. Add 3 tablespoons of neutral oil and heat until the oil shimmers. Making sure the tofu pieces are not touching each other (you may need to work in batches), add the coated tofu to the skillet and cook for 2 to 3 minutes on each side until the tofu is golden and crispy. Remove and place on the paper or kitchen towel to absorb excess oil. Continue with remaining tofu, adding more oil as needed.",
    "The empty skillet should still have a small amount of oil, but if it doesn’t, add 1 tablespoon more of oil. With the skillet over medium heat, add the scallions and pepper and stir-fry for 30 to 60 seconds until softened and fragrant. Remove with a slotted spoon and drain on the same paper or kitchen towel.",
    "Transfer the tofu to a plate and sprinkle with about half of the salt and pepper seasoning. Top with scallions and pepper. Serve with rice and the remaining salt and pepper seasoning."
  ],
  "notes": [],
  "nutrition_infos": []
}