{
  "name": "Skillet Fried Plantains",
  "categories": [],
  "servings": 3,
  "minutes": 15,
  "source_url": "https://cooking.nytimes.com/recipes/1023734-skillet-fried-plantains",
  "image_urls": [
    "https://static01.nyt.com/images/2022/12/21/multimedia/19kwanzaa-rex2-1-742f/19kwanzaa-rex2-1-742f-square640.jpg",
    "https://static01.nyt.com/images/2022/12/21/multimedia/19kwanzaa-rex2-1-742f/19kwanzaa-rex2-1-742f-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/12/21/multimedia/19kwanzaa-rex2-1-742f/19kwanzaa-rex2-1-742f-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "very ripe plantains the skin should be black",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "neutral oil such as canola or vegetable oil",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "lime",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Using a paring knife, slice off the ends of the plantains, removing about 1/2 inch from each tip. Then gently cut a slit in the skin through the length of the plantain, taking caution to avoid the flesh. Peel and discard the skin. ",
    "Pour the oil into a large sauté pan and heat on medium until it shimmers. While the oil is heating, slice the plantains on a bias into 1/2-inch-thick pieces. Sprinkle the plantains with the salt. ",
    "Prepare a paper towel-lined plate. Working in batches if necessary, carefully place the plantains in the oil and allow to cook until nicely browned, about 3 minutes per side, using a slotted spoon or a spider strainer to flip each slice. The plantains should be soft in the middle but crisp around the edges. Transfer cooked plantains to the prepared plate.",
    "Once all the plantains are cooked, transfer to a serving plate, season with additional salt, if you like, and sprinkle with fresh lime juice. Serve immediately. "
  ],
  "notes": [],
  "nutrition_infos": []
}