{
  "name": "Smoky Pork Shoulder With Chile Paste",
  "categories": [],
  "servings": 10,
  "minutes": 420,
  "source_url": "https://cooking.nytimes.com/recipes/1019933-smoky-pork-shoulder-with-chile-paste",
  "image_urls": [
    "https://static01.nyt.com/images/2019/01/27/magazine/27mag-eat-slide-IDC6-copy/27mag-eat-slide-IDC6-square640.png",
    "https://static01.nyt.com/images/2019/01/27/magazine/27mag-eat-slide-IDC6-copy/27mag-eat-slide-IDC6-videoSixteenByNineJumbo1600.png",
    "https://static01.nyt.com/images/2019/01/27/magazine/27mag-eat-slide-IDC6-copy/27mag-eat-slide-IDC6-superJumbo.png"
  ],
  "ingredients": [
    {
      "name": "garlic cloves",
      "amount": 12.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 20.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 100.0,
          "unit": "KCAL",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 40.0,
          "unit": "MG",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "scallions",
      "amount": 1.0,
      "unit": "bunch",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cilantro with stems",
      "amount": 1.0,
      "unit": "bunch",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "white vinegar",
      "amount": 6.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total Sugars",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Vitamin C, total ascorbic acid",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total trans",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "Set pork shoulder in a deep roasting pan just large enough to accommodate it. With a sharp knife or straight edge razor blade, cut a deep 3/4-inch diamond pattern into the thick fat cap.",
    "Sprinkle 2 tablespoons kosher salt over the diamond cuts, then all the pepper. Rub the salt and pepper into the cuts and all over the top and sides of the pork shoulder.",
    "Turn the shoulder fat-side down, and sprinkle the remaining salt over the meat. Rub the salt and any pepper that has scattered in the pan into and all over the meat to have a wholly seasoned piece of meat — especially on the top, in the diamond-cut fat area. Let the seasoned roast rest on the counter at room temperature for 2 hours.",
    "Meanwhile, make the chile paste. Bring a medium saucepan of water to boil. Off heat, add the pasillas, guajillos and árbols, and let them soak for 30 minutes while you gather and prepare the other ingredients. When the chiles are softened, transfer them and 1/2 cup of their soaking water into a high-powered blender. Add the garlic, scallions, cilantro, vinegar and kosher salt, and blend into a smooth, dark red-brown paste. (The consistency should remind you of jarred applesauce.)",
    "Pour this chile paste over the pork shoulder and massage it all over the roast, leaving a nice extra schmear on the top of the roast and, again, seasoning the diamond-cut fat cap a little more generously than the bottom. (The fat on the top is going to render slowly all through the cooking and melt down into the meat, in a self-basting way, which is why the most seasoning is at the top.) Don’t worry about the excess paste; it will remain in the roasting pan to enhance the juices later.",
    "Build a fire in your grill, then push the hot coals to one side in a mounded crescent shape, leaving space for the roasting/drip pan that now holds the marinade-slathered meat. If using an oven, heat it to 325.",
    "Remove the meat from the pan, and set it to the side (I use a sheet of parchment for easy cleanup) while you prepare the grill or oven.",
    "To prepare the grill or the oven, add a full inch of water to the roasting pan, stirring briefly to combine it with the excess chile paste, and nestle the roasting pan into the bottom of the grill in the empty space next to the crescent of coals, or on the bottom rack of the oven.",
    "Place the grill rack in position over the coals. Set the meat directly onto the rack above the water-filled roasting pan so that the juices will drip into it while cooking. If using a conventional oven, place the roast, fat side up, on the rack directly above the roasting pan.",
    "Place the cover on the grill, open the vents all the way and let the roast cook for 3 to 4 hours maintaining a gentle 300 degrees, adding coals when needed. If the temperature spikes to 325 or drops to 275 along the way, it doesn’t matter at all — open and close the lid as needed to get back on track. The goal is to slowly, gently cook the meat, giving all that fat time to melt, the skin time to crisp and the tough cut of meat (muscly shoulder) time to become tender.",
    "Add water to the drip pan if you see it evaporating, though I did not need to add liquid any time I tested this. The natural fats and juices drip down into the pan, commingling with the chile-paste-spiked water to create a smoky, spicy, delicious cache of pan juices for later spooning over the roast while it rests. Loosely cover the meat with foil if it starts looking too dark too soon.",
    "Cook until the internal temperature reaches about 165 degrees, up to 4 hours. Remove from the grill (or the oven). Remove the roasting/drip pan. Let the meat rest for 30 minutes. Spoon the drippings over the roast until glossy and moist. Slice thin."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 20.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 100.0,
      "unit": "KCAL",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 40.0,
      "unit": "MG",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total Sugars",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Vitamin C, total ascorbic acid",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total trans",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    }
  ]
}