{
  "name": "Spiced Pumpkin Cookie Cake",
  "categories": [],
  "servings": 1,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1021602-spiced-pumpkin-cookie-cake",
  "image_urls": [
    "https://static01.nyt.com/images/2020/11/17/dining/jg-pumpkin-cookie-cake/jg-pumpkin-cookie-cake-square640.jpg",
    "https://static01.nyt.com/images/2020/11/17/dining/jg-pumpkin-cookie-cake/jg-pumpkin-cookie-cake-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/11/17/dining/jg-pumpkin-cookie-cake/jg-pumpkin-cookie-cake-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "55 grams all-purpose flour",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "15 milliliters cold heavy whipping cream",
      "amount": 2.6666666666666665,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "canned pumpkin purée not pie filling",
      "amount": 1.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "prepared coffee",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 375 degrees. In the bowl of a stand mixer fitted with a paddle attachment, add the butter, 1 cup confectioners’ sugar, pumpkin pie spice, 1 teaspoon vanilla extract and the salt. Beat on low speed until most of the sugar has been incorporated into the butter, then increase the speed to medium-high and beat until the ingredients are completely combined, stopping to scrape down the sides of the bowl and beater as needed.",
    "Turn the mixer off, add the flour, and beat on low, slowly increasing the speed until the flour is incorporated, scraping down the sides of the bowl as needed. Add 1/4 cup of the heavy cream and beat on medium-high until the mixture is smooth.",
    "Divide the mixture between two 9-inch cake pans. Using damp hands, press the mixture into the bottom and to the edges of each pan to create a flat layer. (It doesn’t need to be perfect; any fingerprints will disappear during baking or get covered with whipped cream.)",
    "Bake for 20 to 25 minutes or until the shortbread is deep golden brown. Remove from the oven, and, using a fork, prick all over with a fork while the cookies are still soft. Allow to cool in the pans for at least 30 minutes, then run a butter knife along the edges of the pans to loosen the cookies. Carefully invert the cookies onto a wire rack to finish cooling.",
    "Wash and dry the bowl of the stand mixer and set up the whisk attachment. Add the remaining 1 1/2 cups heavy cream, 1/2 cup confectioners’ sugar and 1 teaspoon vanilla extract to the bowl and beat on medium speed, slowly increasing the speed to medium-high and whisking until the cream is thick. Increase the speed to high and add the pumpkin purée 1 tablespoon at a time until the cream is stiff. (This happens quickly, so be careful not to overwhip!)",
    "Assemble the cake by placing one of the cookies on the serving tray and slowly spooning 1/4 cup of the coffee overtop. Once the coffee has soaked into the cookie, add half the whipped cream mixture on top, spreading it to the edges. Repeat with the remaining cookie, coffee and whipped cream.",
    "Sprinkle the top layer of whipped cream with more pumpkin spice, and cover the cake loosely with plastic wrap. Refrigerate the cake overnight — ideally a full 24 hours, so the cookies soften — and for up to 2 days before serving, for the best results."
  ],
  "notes": [],
  "nutrition_infos": []
}