{
  "name": "Sticky Coconut Chicken and Rice Casserole",
  "categories": [],
  "servings": 6,
  "minutes": 45,
  "source_url": "https://www.allrecipes.com/sticky-coconut-chicken-and-rice-casserole-recipe-7482910",
  "image_urls": [
    "@type",
    "url",
    "height",
    "width"
  ],
  "ingredients": [
    {
      "name": "½ lbs. boneless",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "minced fresh ginger from a 1-in. piece",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "minced garlic 3 medium cloves",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "¾ cups chicken broth",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "-oz. can unsweetened coconut milk",
      "amount": 7.25,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large scallions",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Gather all ingredients.",
    "Preheat the oven to 375 degrees F (190 degrees C).",
    "Sprinkle both sides of chicken pieces with garlic salt.",
    "Heat 2 tablespoons oil in a Dutch oven over medium-high until shimmering. Add half of chicken pieces, and cook, turning occasionally, until golden brown on both sides, about 3 minutes per side. Remove to a plate and repeat with remaining chicken pieces.",
    "Heat remaining 2 tablespoons oil in the Dutch oven over medium-high heat (do not wipe out Dutch oven). Add ginger, garlic and rice; cook, stirring constantly, until ginger and garlic are aromatic and rice is evenly coated in oil, 1 minute.",
    "Add broth, coconut milk, bell peppers, sugar snap peas, and scallions, stirring and scraping the bottom of the Dutch oven to release browned bits from bottom of pot.",
    "Add chicken and any accumulated juices from plate; bring mixture to a boil over medium-high heat. Once mixture boils, remove from heat and cover with a lid.",
    "Bake in the preheated oven until all liquid has been absorbed, rice is tender, and chicken is no longer pink in the center and the juices run clear,  20 to 25 minutes. An instant-read thermometer inserted into the center should read 165 degrees F (74 degrees C).",
    "Serve bowls of rice and vegetables with chicken pieces on top, garnished with peanuts, cilantro, lime wedges, and Sriracha."
  ],
  "notes": [],
  "nutrition_infos": []
}