{
  "name": "Swedish Yellow Pea Soup",
  "categories": [],
  "servings": 8,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/5472-swedish-yellow-pea-soup",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/1.jpg?1"
  ],
  "ingredients": [
    {
      "name": "dried",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "fresh bacon",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "fresh marjoram or thyme",
      "amount": 1.0,
      "unit": "bunch",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "hot",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Rinse the peas in a colander under cool running water. Put them in a large, nonreactive bowl and cover with water by 2 inches. Let soak uncovered in a cool place overnight.",
    "Put the peas and soaking water into a heavy 6-to-8-quart pot. Add water to cover again by 2 inches. Bring to a boil over medium heat, and let boil two minutes. Skim off and discard any foam and skins that rise to the top.",
    "Stir in the chopped onion. Cut the piece of bacon crosswise into two pieces, and add to the pot with 3 tablespoons fresh marjoram or thyme leaves, stripped of stems and chopped.",
    "Let the soup boil gently for 40 to 90 minutes until it becomes very thick and buttery yellow. Whole peas will take longer and will be soft but still whole when cooked. Split peas will take a shorter time to cook and will almost disintegrate. If the soup becomes too thick, add more water.",
    "Remove the pot from the heat. Remove the two pieces of bacon, and cut off and discard the rind. Cut the bacon crosswise into 1/2-inch slices. Reserve.",
    "Stir the soup well, and season with 2 to 4 tablespoons mustard. Add salt, if necessary, and black pepper. Add more fresh thyme or marjoram if desired.",
    "Serve with soup in shallow bowls with slices of bacon on the side. Pass additional mustard to stir into the soup. In Sweden, this soup, called artsoppa, is served with crisp rye bread covered with grated vasterbottem, a sharp, hard cheese. Aged cheddar and Parmigiano Reggiano are good substitutes."
  ],
  "notes": [],
  "nutrition_infos": []
}