{
  "name": "Sweet Tart Dough",
  "categories": [],
  "servings": null,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1016816-sweet-tart-dough",
  "image_urls": [
    "https://static01.nyt.com/images/2014/09/24/dining/24DESSERT2/24DESSERT2-square640.jpg",
    "https://static01.nyt.com/images/2014/09/24/dining/24DESSERT2/24DESSERT2-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "9 grams skinless almond flour",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "teaspoons/7 milliliters vanilla extract",
      "amount": 1.3333333333333333,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "extra-large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "1 tablespoon/315 grams cake flour",
      "amount": 3.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a standing mixer fitted with paddle attachment, cream butter and salt on medium speed for 1 minute. Scrape down sides of bowl and paddle  and add confectioners’ sugar. Combine with butter at low speed. Scrape down bowl and paddle again, then add almond flour and vanilla and combine at low speed.",
    "Gradually add egg and a scant 1/2 cup cake flour (55 grams). Beat at low speed until just incorporated. Scrape down bowl and paddle. Gradually add remaining cake flour and mix just until dough comes together. Do not overbeat. Dough should be soft to the touch.",
    "Scrape dough out of bowl and gently press into a 1/2-inch-thick rectangle. Double-wrap airtight in plastic and refrigerate for at least 3 hours, preferably overnight.",
    "Very lightly brush two tart pans with butter. (You should not be able to see the butter.) Weigh dough and cut into two equal pieces. Wrap one piece and refrigerate while you roll out the other.",
    "Lightly dust parchment paper or a silicone baking mat with flour. Tap on dough lightly with a rolling pin to make it pliable. Begin rolling gently, three times in one direction, from the edge nearest to you to the far edge. Rotate dough a quarter turn clockwise. (If it’s sticking, run an offset spatula underneath to loosen it, then gently lift it and lightly dust underneath with flour.) Repeat process until dough is about 1/4-inch thick and 11 inches in diameter. Check often to make sure dough is not sticking, and dust with flour as necessary.",
    "Cut dough into a 10 1/2-inch circle. (If it’s on a silicone mat, flip it over onto a piece of lightly dusted parchment and peel off the mat first.) Very lightly dust dough with flour; brush away excess flour with a dry pastry brush.",
    "Loosely roll dough onto rolling pin, then unroll it onto a tart pan, making sure to cover pan evenly. Gently ease it into the pan so there is no gap between the bottom edge of the ring and the bottom of the pan (don’t press hard or dough will be thinner in spots). Cut away excess dough by holding a paring knife perpendicular to the edge of the pan and spinning the pan around against the edge of the knife. Use a fork to poke little holes in dough across entire bottom of shell.",
    "Refrigerate dough, uncovered, for at least 1 hour and preferably overnight. If freezing dough, refrigerate for 1 hour, then double-wrap in plastic wrap, then in foil. Label, date and freeze. Repeat process of rolling out dough with the other dough half.",
    "Heat oven to 325 degrees with rack positioned in middle. Place tart pan on a baking sheet. Line shell with parchment and fill to the top with pie weights. (If dough is coming directly from the freezer, you don’t need to defrost it first or use weights.) Bake for 15 minutes. Remove parchment and weights and return to oven for 10 to 15 minutes, until golden brown. Remove from oven and allow to cool completely on a rack (with pan still on top of baking sheet) before filling."
  ],
  "notes": [],
  "nutrition_infos": []
}