{
  "name": "S’mores Crispy Treats",
  "categories": [],
  "servings": 8,
  "minutes": 15,
  "source_url": "https://cooking.nytimes.com/recipes/1023341-smores-crispy-treats",
  "image_urls": [
    "https://static01.nyt.com/images/2022/07/12/dining/as-smores-crispy-treats/merlin_204847803_60161499-465e-4024-a0a0-2388aee03ddd-square640.jpg",
    "https://static01.nyt.com/images/2022/07/12/dining/as-smores-crispy-treats/merlin_204847803_60161499-465e-4024-a0a0-2388aee03ddd-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/07/12/dining/as-smores-crispy-treats/merlin_204847803_60161499-465e-4024-a0a0-2388aee03ddd-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "- to 12-ounce/283- to 340-gram bag marshmallows",
      "amount": 5.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "- to 12-ounce/283- to 340-gram box graham cracker cereal such as golden grahams",
      "amount": 5.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/85 grams semisweet chocolate chips",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the broiler to high and set the rack in the upper third of the oven. Grease a broiler-safe 8- or 9-inch square pan, then add the marshmallows. (They won’t fit in an even layer, and that’s OK.) Broil until deeply browned and smoking, about 1 minute. (Watch closely, as broilers vary.) Stir to expose untoasted sides and broil once again until browned and just starting to smoke. Remove from oven, leaving the broiler on.",
    "In a large pot, melt the 1/2 cup butter over medium-high. Stir frequently until the hissing subsides and the butter smells toasted and is speckled brown, 3 to 5 minutes. (Keep watch: This happens quickly.) Turn off the heat, then add the marshmallows (the pan may still be hot), and stir vigorously until melted. Working quickly, add the cereal and salt and stir to combine. Add the chocolate and stir to combine.",
    "Immediately scrape the mixture into the prepared pan and press firmly into an even layer. Broil until the top is golden and charred in spots, about 1 minute, watching closely. Let cool completely, then cut into squares or bars. Store, covered, at room temperature for up to 3 days."
  ],
  "notes": [],
  "nutrition_infos": []
}