{
  "name": "Tang Yuan",
  "categories": [],
  "servings": 15,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1021844-tang-yuan",
  "image_urls": [
    "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex1/merlin_182770545_350adf92-2333-4616-bdb0-6f2e1e7b1825-square640.jpg",
    "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex1/merlin_182770545_350adf92-2333-4616-bdb0-6f2e1e7b1825-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex1/merlin_182770545_350adf92-2333-4616-bdb0-6f2e1e7b1825-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "-inch piece/65 grams fresh ginger",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/70 grams roasted black sesame seeds see tip",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "grapeseed oil or other neutral oil",
      "amount": 4.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the soup: Combine the ginger and sugar in a large saucepan with 6 cups water. Bring to a boil over high heat, stirring to dissolve the sugar, then turn the heat to the lowest setting. Let steep until ready to cook.",
    "Make the filling: Process the sesame seeds in a food processor until very finely ground. Add the sugar and pulse until the mixture is as fine as sand, then pulse in the peanut butter until the mixture forms a smooth mass. Taste and add more sugar if you’d like, then pulse to incorporate.",
    "Using a measuring teaspoon, scoop and pack a flat spoonful of the sesame seed mixture, then push it out of the spoon onto a rimmed baking sheet using your fingertip. Repeat with the remaining mixture and note how many pieces you get. (It should be around 24.) Press and gently squeeze each spoonful into a ball. Transfer to the freezer to firm up.",
    "Make the dough: Place the flour in a medium bowl and set the bowl on a damp kitchen towel so it won’t slip. Bring 2/3 cup water to a boil in a small saucepan on the stovetop or in a heatproof liquid measuring cup in the microwave. Add the oil to the water, then pour the mixture into the flour in a slow, steady stream while stirring with chopsticks or a fork. Continue stirring until the liquid is incorporated. The mixture should look like floury pebbles. Cover with a damp towel or plastic wrap and let stand 5 minutes to cool.",
    "Squeeze and gather the pebbles into a ball in the bowl. Roll onto a clean work surface and knead, flouring the dough and surface if the dough sticks, until very smooth and room temperature, 3 to 5 minutes. The dough should feel supple. Roll into a snake 1 inch in diameter and cut into the number of dough filling balls you have, dividing evenly.",
    "Take the filling balls out of the freezer. Roll a piece of dough into a ball, then press the edges with your fingertips to form a 2 1/2-inch round with a dime-size belly of thicker dough in the middle. Center a filling ball in the dough, then gather the sides around it to enclose. Pinch the seams shut and gently roll into a smooth ball. Repeat with the remaining filling and dough. (The dumplings can be frozen on a baking sheet until firm, then stored in an airtight container in the freezer for up to 3 months. Cook directly from the freezer.)",
    "Bring the ginger soup to a simmer over medium heat. Add the dumplings one at a time, then simmer gently until the balls float, the dough is a little translucent and the filling is steaming hot, about 10 minutes. Divide the dumplings and soup among bowls and serve hot. (The ginger isn’t meant to be eaten.)"
  ],
  "notes": [],
  "nutrition_infos": []
}