{
  "name": "Texas Hill Country-Style Smoked Brisket",
  "categories": [],
  "servings": 13,
  "minutes": 720,
  "source_url": "https://cooking.nytimes.com/recipes/1020184-texas-hill-country-style-smoked-brisket",
  "image_urls": [
    "https://static01.nyt.com/images/2019/05/29/dining/24brisketrex2/24brisketrex2-square640.jpg",
    "https://static01.nyt.com/images/2019/05/29/dining/24brisketrex2/merlin_154954074_34f71fa1-89b5-45b0-adcf-db2e54033f15-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/05/29/dining/24brisketrex2/merlin_154954074_34f71fa1-89b5-45b0-adcf-db2e54033f15-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "4 pounds",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Using a sharp knife, trim the brisket: Set the brisket flat side down, so the leaner side is underneath and the rounded, fatty point side is on top. Wherever you find a thick sheath of fat on the top surface, trim it to within 1/4 inch of the meat. Now look at the side of the brisket: There’s a large pocket of fat between the point and the flat. Using the point of the knife, cut some of it out, but avoid cutting directly into the meat. Turn the brisket so the flat faces up. There’s a lump of fat on one side: Again, trim it to within 1/4 inch of the meat. Be careful not to overtrim. It’s better to err on the side of too much fat than too little. While you’re at it, trim off any thin, sharp corners of the flat part of the meat, so the brisket is slightly rounded.",
    "Season the brisket: Place the brisket on a rimmed sheet pan and generously season the top, bottom and sides with salt, pepper and, if you like your brisket spicy, red-pepper flakes.",
    "Create a platform for cooking the brisket by cutting a flat piece of cardboard the size and shape of the brisket. (There’s no need to make it any larger; the brisket will shrink considerably during cooking.) Wrap the cardboard template in 2 layers of heavy-duty aluminum foil. Using an ice pick, a metal skewer or other sharp implement, poke holes in the foil-covered cardboard at 1-inch intervals. The idea is to create a perforated platform for the brisket. Set the brisket flat on the foil-covered cardboard, lean side down. (This prevents the lean bottom of the brisket flat from drying out and burning, while the holes still let in the smoke.)",
    "Light your grill, smoker or cooker (such as a Big Green Egg) and heat it to 250 degrees. If using a kettle grill, start with less charcoal than you would for grilling a steak: A third to a half chimney starter will do it. If using a smoker, place a large heat-proof bowl of water in the smoke chamber. (This is optional, but it creates a humid environment that will keep your brisket moist and help the smoke adhere to the meat.) Add wood as specified by the manufacturer to generate smoke. If using a kamado-style cooker, set up a top-down burn: Load the fire box with lump charcoal, interspersing it with wood chunks or chips. Light 3 or 4 coals on top in the center; gradually, they’ll burn down, igniting the coals and wood beneath them.)",
    "Transfer the brisket on the foil-lined cardboard to the smoker. If using an offset smoker, position the thicker end toward the firebox. Cook the brisket until the outside is dark and the internal temperature registers about 165 degrees on an instant-read thermometer. This normally takes 6 to 8 hours. Refuel your cooker as needed, adding wood to obtain a steady stream of smoke. If the outside of the brisket darkens too much, loosely lay a sheet of foil on top. (Don’t bunch it, or the meat will steam rather than smoke, resulting in a pot roast-like consistency.)",
    "Wrap the brisket: Lay 2 overlapping sheets of pink (unlined) butcher paper or parchment paper on your work surface. Each piece should be about 3 feet long. You want to create a square about 3 feet on each side. Wearing heatproof rubber or silicone gloves (or carefully using tongs), transfer the brisket to the center of this paper square. Fold the bottom section over the brisket. Fold in the sides and roll the brisket over so it’s completely swaddled in paper. (It’s a little like making a burrito.) Note the orientation: You want the fatty point of the brisket to remain on top. Carefully set the wrapped brisket back on the foil-lined cardboard and return it to the cooker.",
    "Continue cooking the brisket to an internal temperature of 200 to 205 degrees (it will be deeply browned and very tender), another 2 to 4 hours, bringing your total cooking time to 8 to 12 hours, depending on your cooker and the size of your brisket. (Start monitoring the internal temperature at the 8-hour mark.) Additional tests for doneness include the jiggle test: Grab the brisket with a gloved hand and shake it; the meat will jiggle like Jell-O. You could also try the bend test: Lift both ends and it will bend easily in the middle, or place a gloved hand under the center of the brisket and the ends will droop.",
    "You can eat the brisket now. But there’s one more optional step that will take your brisket from excellent to sublime: Let it rest. Place the wrapped brisket in an insulated cooler to rest for 1 to 2 hours, allowing the meat to relax and the juices to redistribute.",
    "To serve the brisket, unwrap it over a sheet pan to catch any juices trapped in the paper. Transfer the brisket to a cutting board (ideally, one with a well), lean flat section down. Cut the brisket in half crosswise, separating the flat section from the point section. The corner of the flat furthest from the sliced side may be tough and dry. Make a diagonal cut to remove it. Dice it and serve as burnt ends to thank onlookers for their patience. Look for the grain of the meat. Using a serrated knife or sharp carving knife, slice this section as thickly or as thinly as desired. (Texas tradition calls for slices that are the thickness of a pencil.) If your brisket has somehow come out tough, slice it paper-thin, which will make it seem more tender.",
    "Now slice the point section: Again, trim off and discard any obvious large lumps of fat. Slice the meat across the grain into 1/4-inch-thick slices (or as desired). Arrange the slices on a platter or plates and spoon the reserved meat drippings over them. It's nice to serve the meat by itself so you can appreciate the complex interplay of salt, spice, smoke, meat and fat. Texas tradition calls for sliced factory-style white bread. If you opt for barbecue sauce, serve it on the side."
  ],
  "notes": [],
  "nutrition_infos": []
}