{
  "name": "Toffee",
  "categories": [],
  "servings": 30,
  "minutes": 275,
  "source_url": "https://cooking.nytimes.com/recipes/1024502-toffee",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/03/multimedia/ND-Toffee-ktqh/ND-Toffee-ktqh-square640.jpg",
    "https://static01.nyt.com/images/2023/11/03/multimedia/ND-Toffee-ktqh/ND-Toffee-ktqh-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/03/multimedia/ND-Toffee-ktqh/ND-Toffee-ktqh-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "semisweet or milk chocolate chocolate chips",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pecans or almonds",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Line a 9-by-9-inch baking pan with parchment, creating a little overhang for easier lift. ",
    "Attach a candy thermometer to a medium (3-quart) heavy saucepan, making sure the thermometer isn’t touching the bottom. Add the butter, sugar and salt to the pan over medium heat, stirring frequently with a wooden spoon, until the mixture comes to a boil, about 10 minutes.",
    "Once boiling, stir constantly, making sure to scrape down the sides of the pot, until the temperature reaches 300 degrees (known as the hard crack stage), about 10 minutes. The color will turn from pale yellow to a light caramel, and the mixture will thicken. ",
    "Remove from the heat and stir in the vanilla extract, if using. (The vanilla will hiss when added to hot mixture.) Pour into the prepared pan, spreading in an even layer with a rubber or offset spatula. Evenly scatter  the chocolate chips on top; let sit for 1 minute. With the spatula, smooth the chocolate over the top. Sprinkle the nuts all over the chocolate layer. Refrigerate until set, at least 4 hours. ",
    "Using the parchment overhang, lift the toffee out of the baking pan and place it on a cutting board. Cut or break it into pieces. If not immediately serving, toffee can be stored in an airtight container in a cool place for up to 3 weeks."
  ],
  "notes": [],
  "nutrition_infos": []
}