{
  "name": "Torta Sbrisolona",
  "categories": [],
  "servings": 16,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1019006-torta-sbrisolona",
  "image_urls": [
    "https://static01.nyt.com/images/2017/10/26/dining/26cooking-torta/26cooking-torta-square640.jpg",
    "https://static01.nyt.com/images/2017/10/26/dining/26cooking-torta/26cooking-torta-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/10/26/dining/26cooking-torta/26cooking-torta-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "102 grams all-purpose flour",
      "amount": 3.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "50 grams almond flour",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "57 grams yellow cornmeal",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolk",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "50 grams unblanched whole almonds",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Center a rack in the oven, and heat it to 325 degrees. Butter an 8-inch square baking pan.",
    "Put both flours, cornmeal, sugar, salt and cinnamon in a food processor, and pulse to blend. Drop in the chunks of butter, and pulse, scraping the bottom of the bowl a couple of times, until the mixture looks like coarse cornmeal. Pulsing, pour in the yolk. Using long pulses, process until the mixture is moist and grainy, like wet sand — it should hold together when pinched.",
    "Transfer to a bowl, stir in the almonds and use your fingers to squeeze the dough into small streusel-like morsels; drop the pieces into the buttered pan as you go. When all the dough is in, pat it down gently, just enough to start the morsels on the road to sticking together.",
    "Bake for 34 to 38 minutes, until the top is deeply golden brown. Transfer to a rack, wait 3 minutes, then run a table knife around the torta and invert it onto the rack. If you want to cut it into pieces, turn it right-side-up onto a cutting board, and use a chef’s knife to cut into cookies; return the pieces to the rack to cool to room temperature. If you want to serve the torta as a break-apart sweet, simply let it cool on the rack."
  ],
  "notes": [],
  "nutrition_infos": []
}