{
  "name": "Veal, Tuna and Caper Sandwich",
  "categories": [],
  "servings": 9,
  "minutes": null,
  "source_url": "https://cooking.nytimes.com/recipes/10435-veal-tuna-and-caper-sandwich",
  "image_urls": [
    "https://static01.nyt.com/applications/cooking/d26096f/assets/4.jpg?1"
  ],
  "ingredients": [
    {
      "name": "boneless veal loin roast",
      "amount": 12.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "egg yolks",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "can tuna packed in olive oil",
      "amount": 16.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "anchovy fillets",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "drained capers",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ripe tomatoes",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Preheat oven to 350 degrees. Rub veal with oil and sprinkle with salt and pepper. Sear loin on all sides over medium heat until browned, about 5 minutes in all. Roast until medium well, about 1 hour, or until internal temperature registers 140 degrees. Let sit at room temperature until cool, then cover and refrigerate until cold and firm, about 6 hours. Slice into 1/8-inch slices, removing strings as you slice.",
    "In a food processor, pulse the yolks to blend. With the machine running add 1/2 cup of oil in a steady, slow stream and add 2 tablespoons of lemon juice. Keep processing while pouring in 1 cup more oil, then the tuna, in chunks, then anchovies, capers and remaining lemon juice, and then the remaining oil. Season well with salt and pepper.",
    "Spread just enough of the tuna sauce over the bottom of a nonreactive loaf pan to cover. Top with a layer of veal and cover with a thin layer of tuna sauce. Repeat until all the veal and sauce are used. Cover and refrigerate 6 to 48 hours.",
    "To assemble: Spread sauce on one side of all the bread slices. Cover half the slices with the veal, scraping off most of the sauce from the meat. Top with tomatoes and remaining bread, spread sides down. Cut off crusts and cut sandwiches in half."
  ],
  "notes": [],
  "nutrition_infos": []
}