{
  "name": "Vegetable Hash With Poached Egg",
  "categories": [],
  "servings": null,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1014138-vegetable-hash-with-poached-egg",
  "image_urls": [
    "https://static01.nyt.com/images/2011/02/15/science/14recipehealth/14recipehealth-square640.jpg",
    "https://static01.nyt.com/images/2011/02/15/science/14recipehealth/14recipehealth-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "canola oil",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium red onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ketchup",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "poached eggs",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oil over medium heat in a large, heavy nonstick skillet. Add the onion. Cook, stirring often, until it begins to soften, about three minutes. Add the remaining vegetables and a generous pinch of salt. Cook, stirring often, until the vegetables begin to soften, about five minutes.",
    "Stir in the ground cumin seeds and the paprika, and combine well with the vegetables. Continue to cook, stirring often, for 15 minutes until the vegetables are crisp-tender. Add the ketchup, and continue to cook, stirring, for another five minutes.",
    "Press the vegetable mixture down into a flat layer in the pan. Continue to cook on one side for five minutes. A crust should form on the bottom. Stir, then press down again and cook for another five minutes, until a crust forms again. Stir, taste and adjust salt, and add pepper. The vegetables should be thoroughly tender and the mixture nicely browned with a sweet edge. Remove from the heat.",
    "Spoon the hash onto plates, press down in the center, lay a poached egg on top and serve."
  ],
  "notes": [],
  "nutrition_infos": []
}