{
  "name": "Whole-Wheat English Muffins",
  "categories": [],
  "servings": 6,
  "minutes": 35,
  "source_url": "https://cooking.nytimes.com/recipes/1016274-whole-wheat-english-muffins",
  "image_urls": [
    "https://static01.nyt.com/images/2014/04/23/dining/23ENGLISH_SPAN/23ENGLISH-square640.jpg",
    "https://static01.nyt.com/images/2014/04/23/dining/23ENGLISH_SPAN/23ENGLISH-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "teaspoons/7 grams active dry yeast 1 packet",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 milliliters plain yogurt",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 milliliters warm whole milk",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoon/7 milliliters honey",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "25 grams whole-wheat flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "25 grams all-purpose flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "teaspoon/4 grams baking soda",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a small bowl combine yeast and 1/3 cup warm water (80 milliliters) and let rest until yeast has dissolved, about 5 minutes.",
    "Melt 2 tablespoons butter and put it in a large bowl. Whisk in yogurt, milk, honey, salt and the yeast mixture.",
    "Add flours and baking soda to bowl and beat thoroughly with a spoon or rubber spatula until well combined. Cover bowl and let rest in a warm spot for 1 to 1 1/2 hours, or until dough has doubled.",
    "Heat oven 350 degrees. Lightly dust a small baking sheet with cornmeal.",
    "Place a large skillet over medium heat and melt 1 tablespoon butter. Using a large ice cream scoop or 1/2 cup measuring cup, drop batter into skillet to form round muffins about 4 inches in diameter, mounding the batter in the center. (You may need to coax the dough a little with your fingers, so be careful of the hot pan, and don’t worry if they’re not perfectly circular.) Repeat until you have 3 muffins, leaving the rest of the batter for a second batch. Reduce heat to low. Cover skillet with lid or baking sheet and cook 3 to 5 minutes, until bottoms are golden brown. (Be careful not to let them burn.)",
    "Uncover skillet and flip muffins using a spatula. Cover again and cook 2 to 4 minutes or until the other sides are golden brown. Place muffins on prepared baking sheet. Repeat using remaining batter and another tablespoon of butter.",
    "Bake muffins for 6 to 9 minutes, or until puffed and cooked through. Split the muffins with a fork and toast before eating."
  ],
  "notes": [],
  "nutrition_infos": []
}