{
  "name": "Zucchini Cakes",
  "categories": [],
  "servings": 6,
  "minutes": 45,
  "source_url": "https://cooking.nytimes.com/recipes/1015157-zucchini-cakes",
  "image_urls": [
    "https://static01.nyt.com/images/2010/11/02/health/02well_zucchini/02well_zucchini-superJumbo-v2.jpg"
  ],
  "ingredients": [
    {
      "name": "medium zucchini",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small yellow onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "low-fat ricotta",
      "amount": 1.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "whole-wheat flour",
      "amount": 5.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dried dill",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Trim the ends off the zucchini, then shred them into a colander, using the large holes of a box grater. (You’ll need about 4 cups shredded zucchini.)",
    "Sprinkle the zucchini shreds with salt, toss well and set in the sink for 15 minutes to drain.",
    "Rinse the zucchini shreds under cool water in the colander. Then pick up handfuls and squeeze them over the sink to get rid of almost all of the moisture. Set the shreds in a large bowl.",
    "Grate the onion into the bowl using the large holes of the box grater.",
    "Stir in the ricotta, whole-wheat flour, egg, paprika, dill and pepper, just until the mixture is uniform and there are no streaks of dry flour anywhere.",
    "Heat a large skillet over medium heat. Swirl in the oil, then use a 1/2-cup measuring cup to scoop up the zucchini mixture and plop it into the skillet, scraping out any mixture left in the cup. Flatten the mixture into a thick cake with the bottom of the cup and continue making more.",
    "Cook until lightly browned, about 4 minutes, then turn them with a large spatula and continue cooking until lightly browned on the other side and a little firm to the touch, about 4 more minutes. If you can’t fit all six into your skillet, you’ll need a little more oil for the second batch."
  ],
  "notes": [],
  "nutrition_infos": []
}