{
  "name": "Chapati",
  "categories": [],
  "servings": 8,
  "minutes": 120,
  "source_url": "https://cooking.nytimes.com/recipes/1024092-chapati",
  "image_urls": [
    "https://static01.nyt.com/images/2023/04/14/multimedia/14KOMOLAFE-rex1-chapa-mzjb-copy/14KOMOLAFE-rex1-chapa-mzjb-square640.jpg",
    "https://static01.nyt.com/images/2023/04/14/multimedia/14KOMOLAFE-rex1-chapa-mzjb-copy/14KOMOLAFE-rex1-chapa-mzjb-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/04/14/multimedia/14KOMOLAFE-rex1-chapa-mzjb-copy/14KOMOLAFE-rex1-chapa-mzjb-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/520 grams all-purpose flour",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "neutral oil such as grapeseed",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium bowl, whisk together the flour and salt. Make a well in the center and add in 2 tablespoons oil and 1 cup water. Using your hands, mix the dry and wet ingredients into a shaggy dough. Add more water 1 tablespoon at a time, combining until the dough comes together into a slightly sticky, uneven ball (you’ll use a total of 6 tablespoons additional water). Transfer the dough to a very lightly floured work surface and knead into a smooth ball, about 8 minutes. Return the dough to the bowl, cover with a clean kitchen towel and allow to rest. The dough will relax and should spring back when poked lightly, about 30 minutes. Brush a small sheet pan or large plate with a generous amount of oil, and set aside.",
    "Place the dough on the work surface and cut into 8 even pieces. Roll each piece into a ball and place on the oiled sheet pan. Cover with plastic wrap or a clean kitchen towel. Let rest for 10 minutes.",
    "Place a dough ball on a lightly floured work surface and dust the top with some flour. Using a rolling pin, pat the dough down, then roll into a 4-inch-round piece. Pick up the dough and place it on the back of one hand. Use the other hand to stretch the dough by gently tugging along the edge of the round. Turn the dough an inch in a clockwise direction after every pull to keep the round shape and evenly stretch the piece of dough until it is thin enough to see your hand through it. Don’t worry if the piece rips: Pinch the tear back together and try to stretch carefully. Place the stretched dough sheet on your lightly floured work surface (you should be able to see the work surface through the dough) and use the rolling pin to roll over the outer 1/2-inch edge so it’s as thin as the rest of the sheet. The sheet should have a 13- to 16-inch diameter.",
    "Generously brush the surface of the sheet with oil and lightly sprinkle with flour. Starting with the edge closest to you, roll the edge of the sheet over itself, into a log. You should end up with a long rope. Lift the rope and squeeze along its length to press out any air bubbles and stretch it until it’s almost double in length, about 22 to 28 inches. ",
    "Starting at one end, roll the rope into a snail-like spiral and tuck the last 1 1/2 inches of the rope underneath. Place the spiral back on the tray, cover, and repeat the process with the remaining dough balls.",
    "Place a spiral on a floured surface, and sprinkle flour over the top. Roll into a 9- to 10- inch round, turning about an inch clockwise after each roll to maintain its round shape. Move the round aside, making sure the surface is well floured to avoid sticking. Roll out the remaining spirals and stack them, flouring the top of the stack before placing another round on top.",
    "Heat a 10- to 12-inch skillet (nonstick, steel or a seasoned cast-iron) over medium. Brush the pan with oil, place a round in the pan and cook until the surface looks dull and the dough begins to puff, about 1 minute. Brush the surface of the dough round lightly with oil and flip to cook the other side for 1 minute. Brush again with oil and flip to brown the original side, and cook for 1 minute. Brush lightly with oil and flip again to brown the second side, and cook for 1 minute. The total cook time should be about 4 minutes, and both sides should be golden brown in spots. Move the cooked chapati to a plate, cover with a kitchen towel or another plate to keep warm. Brush your pan with oil and repeat the cooking process until all the dough rounds are cooked off.",
    "Enjoy the chapati immediately while still warm. Store any leftovers at room temperature, wrapped or sealed in an airtight bag for up to 24 hours or frozen for up to 1 month. To reheat, defrost and warm up in a skillet over medium-low heat."
  ],
  "notes": [],
  "nutrition_infos": []
}