{
  "name": "Chile Verde Guacamole",
  "categories": [],
  "servings": 4,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1021293-chile-verde-guacamole",
  "image_urls": [
    "https://static01.nyt.com/images/2020/08/12/dining/10carneasadarex5-guac/merlin_175269093_ad01b566-c3bf-4a46-aaa9-6bf9082264b3-square640.jpg",
    "https://static01.nyt.com/images/2020/08/12/dining/10carneasadarex5-guac/10carneasadarex5-guac-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/08/12/dining/10carneasadarex5-guac/merlin_175269093_ad01b566-c3bf-4a46-aaa9-6bf9082264b3-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "finely chopped white onion",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ripe avocados",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Place the Anaheim chile on a small baking sheet covered with aluminum foil. Roast it under the broiler, flipping a couple times, until the chile is wilted and its skin is completely charred and wrinkly, 9 to 12 minutes. (Alternatively, you can char the chile directly on a hot comal or a cast-iron pan set over medium heat, or on a grill set to high.)",
    "Place the charred Anaheim chile in a plastic bag and close it well. Let it steam and sweat for 5 to 10 minutes.",
    "As the Anaheim chile steams, add the serrano chile, onion, cilantro and salt in a bowl or molcajete, and mash until combined. Add the avocado and continue to mix and mash until you form a chunky purée.",
    "Once it is cool enough to handle, remove the Anaheim chile from the bag, slip off the charred skin, make a slit down the side and remove the seeds and stem. You could rinse the chile under a thin stream of water, to help remove the seeds, or rinse it off by dipping it into a bowl of water.",
    "Finely chop the Anaheim chile. Add it to the avocado mixture, and stir to combine. Season to taste with salt."
  ],
  "notes": [],
  "nutrition_infos": []
}