{
  "name": "Cucumber Agua Fresca With Mint and Ginger",
  "categories": [],
  "servings": 4,
  "minutes": 15,
  "source_url": "https://cooking.nytimes.com/recipes/1022440-cucumber-agua-fresca-with-mint-and-ginger",
  "image_urls": [
    "https://static01.nyt.com/images/2021/07/28/dining/yk-agua-fresca/yk-agua-fresca-square640-v2.jpg",
    "https://static01.nyt.com/images/2021/07/28/dining/yk-agua-fresca/yk-agua-fresca-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/07/28/dining/yk-agua-fresca/yk-agua-fresca-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "hot water",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "english cucumbers",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "-inch piece fresh ginger about 2 ounces",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "lime",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium bowl, combine the mint leaves, sugar and salt, and crush them all together using a fork or the back of a wooden spoon just until the mint is bruised. Pour in the hot water, and stir until the sugar and salt dissolve. Allow the mixture to steep for 5 minutes while you prepare the cucumbers. ",
    "Combine the cucumbers and ginger in a blender. Zest the lime right over the blender, then halve it and squeeze in its juice. Pour in 1 cup room-temperature water and purée on high until smooth. Pour the purée through a fine-mesh strainer, pressing lightly on the solids with a spatula to extract the liquid. Discard the solids and pour the agua fresca into a medium pitcher.",
    "Pour the mint syrup through the same strainer into a container, pressing on the leaves to extract the liquid. Add ¼ cup strained syrup to the agua fresca. Taste and add more syrup or more lime juice to taste. Cover any leftover syrup and refrigerate for another use. ",
    "Fill glasses with ice, pour in the agua fresca, garnish with mint and serve immediately."
  ],
  "notes": [],
  "nutrition_infos": []
}