{
  "name": "Gorditas de Maíz",
  "categories": [],
  "servings": 8,
  "minutes": 105,
  "source_url": "https://cooking.nytimes.com/recipes/1024129-gorditas-de-maiz",
  "image_urls": [
    "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX2-gorditas-qvkb/TORTILLASREX2-gorditas-qvkb-square640.jpg",
    "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX2-gorditas-qvkb/TORTILLASREX2-gorditas-qvkb-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX2-gorditas-qvkb/TORTILLASREX2-gorditas-qvkb-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "pounds/794 grams fresh fine-grind corn masa for tortillas about 3 1/4 cups or 380 grams/2 2/3 cups/380 grams masa harina see tip",
      "amount": 1.75,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "If using fresh masa, knead the masa, 1/2 teaspoon salt and 2 tablespoons water with your hands in a large bowl until the mixture is soft and pliable but doesn't stick to your hands.",
    "If using masa harina, mix masa harina, 1/2 teaspoon salt and 2 cups water with your hands in a large bowl until the mixture is soft and pliable but doesn’t stick to your hands.",
    "Scoop 1/4 cup of masa, roll into a ball, pat into a 1/2-inch thick patty. If the edges are cracked and craggy, the masa needs more water. The edges of the patty should be completely smooth; this is the sign that the masa is properly hydrated. If it's still too dry or crumbly, add a tablespoon or two more water, one at a time, and mix to incorporate. When fully hydrated, knead for 3 minutes, cover the bowl with a damp clean towel and let sit for 20 minutes.",
    "Divide the dough into 8 portions and roll into balls. Arrange on a sheet pan and keep covered with a damp kitchen towel while you shape and cook the gorditas. Working with one ball at a time, use your hands to flatten into a patty about 1/4-inch thick and 5-inches in diameter. If you have trouble working with the dough in your hands, you can cut an 8-inch square of plastic from a 1-gallon zip-top freezer bag, put the ball in the center and use one hand to pat it out, turning the plastic as you pat. Peel off the plastic just before cooking.",
    "Heat a comal, medium nonstick skillet, well-seasoned cast-iron skillet or griddle over medium heat. Cook the gorditas, one at a time (unless you're using a large griddle), until browned in spots, 3 to 4 minutes per side. Repeat with the remaining gorditas.",
    "If planning to fill the gordita, insert a sharp paring knife into the edge of the warm gordita. Cut a pocket into the gordita leaving it intact on the other side to prevent the filling from leaking out. Repeat with the remaining gorditas. Serve the gorditas warm, stuffed with the filling of your choice or uncut, like a thick tortilla."
  ],
  "notes": [],
  "nutrition_infos": []
}