{
  "name": "Homemade Dumpling Wrappers",
  "categories": [],
  "servings": 35,
  "minutes": 45,
  "source_url": "https://cooking.nytimes.com/recipes/1021845-homemade-dumpling-wrappers",
  "image_urls": [
    "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex2/01Dumplingrex2-square640.jpg",
    "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex2/01Dumplingrex2-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/02/03/dining/01Dumplingrex2/merlin_182770524_bc13577c-7519-4a3d-a4ab-d69828ff69de-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/305 grams all-purpose flour",
      "amount": 2.3333333333333335,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/180 milliliters hot water",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Place the flour in a large bowl and set the bowl on a damp kitchen towel so it won’t slip. Add the hot water in a steady stream while stirring with chopsticks or a fork. Stir until all the flour is hydrated and the mixture becomes shaggy. Let stand until cool enough to handle, 2 to 5 minutes.",
    "Use your hands to gather and knead the shaggy mass into a ball in the bowl. Turn out onto a work surface and knead until slightly elastic, 5 to 10 minutes. The dough should be tacky but not sticky, and it won’t look completely smooth. If it sticks to the surface, flour the work surface lightly and continue kneading. Knead into a ball and cover loosely with a clean damp kitchen towel or plastic wrap. Let stand for at least 30 minutes or up to 1 hour.",
    "Divide the dough in half. Roll one piece to a 1/16-inch thickness. You shouldn’t need to flour the surface while rolling, but do so if the dough is sticking. Once the dough is thin enough, lift it off the surface, flour the surface lightly, and place the dough back down. Cut out 3 1/2-inch rounds as close together as possible, then gather the scraps and cover the rounds with the damp kitchen towel or plastic wrap. Repeat with the remaining dough and knead those scraps with the first batch of scraps, then let rest for 5 minutes before rerolling and cutting. (See Note for a more traditional way to roll the wrappers.) Use the wrappers immediately for dumplings, such as <a href=\"http://cooking.nytimes.com/recipes/1021846-chile-crisp-dumplings\">chile crisp dumplings</a>."
  ],
  "notes": [],
  "nutrition_infos": []
}