{
  "name": "Kumquat Panna Cotta",
  "categories": [],
  "servings": 4,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1024090-kumquat-panna-cotta",
  "image_urls": [
    "https://static01.nyt.com/images/2023/04/05/multimedia/30tanisrex3-panna-twbl/29tanisrex3-panna-twbl-square640.jpg",
    "https://static01.nyt.com/images/2023/04/05/multimedia/30tanisrex3-panna-twbl/29tanisrex3-panna-twbl-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/04/05/multimedia/30tanisrex3-panna-twbl/29tanisrex3-panna-twbl-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/475 milliliters half-",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "almond or vanilla extract",
      "amount": 2.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "powdered gelatin 1 package",
      "amount": 2.25,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the panna cotta: In a small saucepan, heat the half-and-half over medium-low until it just begins to simmer. Turn off heat. Add sugar, stir to dissolve, then add orange peel, salt and almond extract, and let steep while you prepare the rest of the recipe.",
    "Meanwhile, put gelatin in a small bowl and add 3 tablespoons cold water. Let dissolve, mashing with a spoon to prevent lumps, about 5 minutes. Add to the half-and-half mixture and whisk well to incorporate.",
    "Strain the mixture through a fine-mesh sieve into a measuring cup with a spout. Pour mixture into 4 (4-ounce) ramekins, tea cups or wine glasses. Cover with plastic wrap and refrigerate until firm, about 3 hours and up to overnight. (It is a good idea to make the panna cotta several hours ahead or up to 2 days in advance.)",
    "Make the kumquat sauce: Put kumquats and sugar in a small saucepan over medium-high heat. Add 1/2 cup water and stir to dissolve. Bring to a rapid simmer, then reduce heat to medium and cook, stirring occasionally, until slices have softened and liquid has reduced to a syrup, about 5 minutes. Cool. (Leftover slices in syrup will keep refrigerated for up to 4 months for future use.)",
    "To serve, bring panna cotta to cool room temperature. Spoon a few slices of kumquat and some of the syrup over each portion."
  ],
  "notes": [],
  "nutrition_infos": []
}