{
  "name": "Magnolia Bakery’s Banana Pudding",
  "categories": [],
  "servings": 14,
  "minutes": 330,
  "source_url": "https://cooking.nytimes.com/recipes/1023785-magnolia-bakerys-banana-pudding",
  "image_urls": [
    "https://static01.nyt.com/images/2023/01/18/multimedia/13PUDDING-REX2-banana-pudding-jlmg/18PUDDING-REX2-banana-pudding-jlmg-square640.jpg",
    "https://static01.nyt.com/images/2023/01/18/multimedia/13PUDDING-REX2-banana-pudding-jlmg/18PUDDING-REX2-banana-pudding-jlmg-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/01/18/multimedia/13PUDDING-REX2-banana-pudding-jlmg/18PUDDING-REX2-banana-pudding-jlmg-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "can sweetened condensed milk",
      "amount": 7.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "package instant vanilla pudding mix",
      "amount": 2.2,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cold heavy cream",
      "amount": 3.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "box vanilla wafer cookies such as nilla",
      "amount": 6.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "to 5 ripe bananas",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In the bowl of a stand mixer fitted with the whisk attachment, beat the condensed milk and water on low speed until blended, then increase the speed to medium and whisk until well combined, about 1 minute. Add the instant pudding mix and beat until there are no lumps and the mixture is smooth, about 2 minutes. Transfer the mixture to a medium bowl, cover and refrigerate until firm, at least 1 hour or overnight.",
    "Using the stand mixer with the whisk attachment, whip the heavy cream on medium speed for about 1 minute, until the cream starts to thicken, then increase the speed to medium-high and whip until stiff peaks form. Be careful not to overwhip.",
    "With the mixer running on low speed, add the pudding mixture a spoonful at a time. Mix until well blended and no streaks of pudding remain.",
    "To assemble, set aside 4 to 5 cookies, whole or crumbled, for garnish. In a 4- to 5-quart trifle bowl or a wide glass bowl (or in 12 8-ounce bowls or ramekins), spread one-quarter of the pudding over the bottom and layer with one-third of the cookies and one-third of the sliced bananas (enough to cover the layer). Repeat the layering twice more. End with a final layer of pudding.",
    "Cover tightly with plastic wrap and refrigerate for 4 to 6 hours. Cookies should be tender when poked with a knife. This dessert is best served within 12 hours of assembling. To serve, garnish the top with the reserved cookies or cookie crumbs."
  ],
  "notes": [],
  "nutrition_infos": []
}