{
  "name": "Menudo",
  "categories": [],
  "servings": 10,
  "minutes": 210,
  "source_url": "https://cooking.nytimes.com/recipes/1023927-menudo",
  "image_urls": [
    "https://static01.nyt.com/images/2023/02/12/multimedia/12EAT-menudo-gqzb/12EAT-menudo-gqzb-square640.jpg",
    "https://static01.nyt.com/images/2023/02/12/multimedia/12EAT-menudo-gqzb/12EAT-menudo-gqzb-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/02/12/multimedia/12EAT-menudo-gqzb/12EAT-menudo-gqzb-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cow’s foot about 3 pounds",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "beef marrow bones",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large garlic cloves",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium white onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cleaned tripe",
      "amount": 3.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dried mexican oregano",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large garlic cloves",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "To prepare the broth: Combine 6 quarts water with the cow’s foot, marrow bones, garlic and onion in a very large stockpot (at least 12 quarts) and set over medium-high heat. Season with 1 1/2 tablespoons salt. Cover and bring to a boil, then reduce the heat to maintain a simmer and cook, uncovered, for 15 minutes. While it cooks, use a spoon to skim off any foam that forms on the surface. ",
    "Add the tripe and oregano and cook for 2 to 2 ½ hours, until the tripe is tender but firm. (Do not overcook it.) ",
    "Remove the cow’s foot and marrow bones from the pot and skim off the fat from the surface. Once the cow’s foot cools a little, pick off the meaty parts, chop them and return them to the pot, along with the marrow from the bones. Discard all the bones.",
    "While the broth is cooking, make the guajillo sauce: Heat a comal or large skillet over medium-high, then place the guajillo peppers open wide in the pan and lightly roast them for 30 to 40 seconds, until they darken slightly and become fragrant. Remove promptly. Place the roasted peppers in a bowl and cover them with water. Let them soak for about 25 minutes, until soft. Drain the peppers and place them in a blender with the garlic, ½ cup of the cooking broth and cumin (if using). Blend until smooth. Strain the sauce through a strainer into the pot with the broth.",
    "Simmer the broth for another 30 minutes, partially covered. Taste and season with more salt, if you like. Serve the soup in large bowls and place the chopped onion, crushed chiles, lime wedges, oregano and tortillas in serving dishes for everyone to add to their own bowls."
  ],
  "notes": [],
  "nutrition_infos": []
}