{
  "name": "Pistachio Morning Buns",
  "categories": [],
  "servings": 15,
  "minutes": 480,
  "source_url": "https://cooking.nytimes.com/recipes/1022249-pistachio-morning-buns",
  "image_urls": [
    "https://static01.nyt.com/images/2021/05/26/dining/21yeastedrex3-morning/21yeastedrex3-morning-square640.jpg",
    "https://static01.nyt.com/images/2021/05/26/dining/21yeastedrex3-morning/merlin_187924512_c79ebc91-cc32-4ddb-bae7-49f3d0276492-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/05/26/dining/21yeastedrex3-morning/merlin_187924512_c79ebc91-cc32-4ddb-bae7-49f3d0276492-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "28 grams raw shelled pistachios",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ground cardamom",
      "amount": 3.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "honey",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "recipe all-purpose enriched bread dough",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Toast the pistachios: Arrange an oven rack in the center position and heat oven to 350 degrees. Scatter the pistachios on a rimmed baking sheet and bake, shaking once, until they’re golden brown and nutty smelling, 6 to 10 minutes. Remove from the heat and set aside to cool completely. Very finely chop the pistachios or crush them beneath a heavy pot, and set aside. ",
    "Make the filling: In a small bowl, combine the sugar, lemon zest, cardamom and salt, and mix with your fingertips, rubbing in the lemon zest until the mixture is fragrant and well combined. Set aside 1/4 cup of the mixture for sprinkling over the baked buns, then combine the remaining sugar mixture with the chopped pistachios and set aside. ",
    "Combine 1/2 cup butter and the honey in a small saucepan, and warm over low heat, stirring occasionally, until the butter is melted and the mixture is combined. Remove from the heat and set aside. ",
    "Prepare the pans: Using a pastry brush, brush the bottom and sides of a 13-by-9-inch baking dish with the remaining tablespoon of room temperature butter, then set the pan aside.",
    "Roll out the dough: Remove the dough from the refrigerator and uncover. Scrape the dough from the bowl and place on the work surface. Use the heel of your hand to knock out the gas and deflate the risen dough, which will be quite firm. Dust underneath and on top of the dough with a bit of flour, then roll it out into a rectangle measuring about 22 inches long, 12 inches wide, and a scant 1/4 inch thick, dusting with more flour if necessary to prevent sticking. Try to work quickly to prevent the dough from warming, which will make it harder to slice the buns. ",
    "Fill and form the buns: Dust off any excess flour, then brush the entire surface of the dough with all but 3 tablespoons of the honey butter mixture. (Reserve the remaining honey butter mixture for brushing over the baked buns.) Sprinkle the pistachio mixture evenly across the surface, pressing it gently into the dough so it adheres. Starting at one of the longer sides, roll the dough into a tight log. If the dough seems very soft, slide the log onto a baking sheet and chill until firm enough to slice, 10 to 15 minutes. Use a serrated knife to slice off the ends of the log, then cut it crosswise into three even sections. Cut each section into five even pieces, so you have 15 total. Arrange each piece cut side up in the prepared baking dish, forming a 3-by-5 grid. ",
    "Proof the buns: Cover the pan with plastic wrap and let rise at room temperature until the buns are all touching, very puffed, and about doubled in size, 1 1/2 to 2 hours. ",
    "Meanwhile, arrange an oven rack in the center position and heat the oven to 350 degrees. ",
    "Bake the buns: Uncover the pan and transfer the buns to the oven. Bake, rotating the pan 180 degrees after 15 minutes, until the buns are golden brown all over, 20 to 25 minutes. Remove from the oven and immediately brush with the reserved honey butter. Sprinkle the reserved sugar mixture evenly over top, then let the buns cool completely in the pan. ",
    "Serve: Use a small serrated knife to cut between the buns and all around the pan, then lift them out one at a time."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    }
  ]
}