{
  "name": "Salty Peanut-Pretzel Ice Cream Cake",
  "categories": [],
  "servings": null,
  "minutes": 40,
  "source_url": "https://cooking.nytimes.com/recipes/1018866-salty-peanut-pretzel-ice-cream-cake",
  "image_urls": [
    "https://static01.nyt.com/images/2019/06/20/dining/ss-salty-peanut-pretzel-cake/merlin_156441087_06106b14-47b9-4011-9e53-54483e195f34-square640.jpg",
    "https://static01.nyt.com/images/2019/06/20/dining/ss-salty-peanut-pretzel-cake/merlin_156441087_06106b14-47b9-4011-9e53-54483e195f34-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/06/20/dining/ss-salty-peanut-pretzel-cake/merlin_156441087_06106b14-47b9-4011-9e53-54483e195f34-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/88 grams mini pretzels",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/205 grams natural",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "honey",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/240 milliliters heavy cream",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 350 degrees. Add pretzels, 1/4 cup peanuts and brown sugar to the bowl of a food processor fitted with a steel blade. Pulse until the mixture resembles very coarse sand with a few larger pieces remaining. Pulse in the butter until well combined.",
    "Press about 3/4 cup of the mixture into the bottom of a 9-inch springform pan. Spread the remaining mixture in an even layer on a rimmed baking sheet. Bake crust and crumbs until light golden and fragrant, about 4 to 5 minutes. The crust may take a bit longer to brown (another 2 to 3 minutes). Set pans on a rack to cool completely.",
    "When the crust and crumbs are cool, transfer 1 quart of the ice cream to a large bowl and use a wooden spoon to break it into a few pieces. Let the ice cream sit at room temperature until slightly softened, about 10 minutes. Drizzle half the peanut butter over the top and gently fold it into the ice cream, so some ribbons of peanut butter remain.",
    "Scoop the ice cream mixture onto the cooled crust and use an offset spatula to gently spread it to the edges of the pan, being careful not to pull the crust away from the bottom of the pan. Drizzle the top of the ice cream with 1 tablespoon of honey and use the tip of a knife or wooden skewer to swirl it as best you can into the surface of the ice cream. Sprinkle about 1/2 cup of the peanut-pretzel crumbs from the baking sheet over the top and gently press them into the ice cream. Cover the pan with plastic wrap and place the cake in the freezer.",
    "After about an hour, soften the second quart of ice cream, and mix the remaining half of the peanut butter into it, and spread as before. Drizzle the remaining honey over the top and swirl it into the surface of the ice cream. Cover the pan with plastic wrap and return it to the freezer to chill the cake for at least 4 hours before serving, and up to overnight.",
    "Just before serving, whip the cream to soft peaks, and stir the remaining whole peanuts into the remaining peanut-pretzel crumbs.",
    "To unmold the cake, run a thin knife or offset spatula under hot water to warm it, and slide it around the edges of the cake. Remove the outer ring of the springform pan, dollop the top of the cake with whipped cream, lightly spread it to the edge, and sprinkle the remaining peanut-pretzel mixture around the top edge. Slice and serve."
  ],
  "notes": [],
  "nutrition_infos": []
}