{
  "name": "Thanksgiving Leftovers Hot Pockets",
  "categories": [],
  "servings": 6,
  "minutes": 80,
  "source_url": "https://cooking.nytimes.com/recipes/1024863-thanksgiving-leftovers-hot-pockets",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/20/multimedia/20Kenji-rex-jqpw/20Kenji-rex-jqpw-square640.jpg",
    "https://static01.nyt.com/images/2023/11/20/multimedia/20Kenji-rex-jqpw/20Kenji-rex-jqpw-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/20/multimedia/20Kenji-rex-jqpw/20Kenji-rex-jqpw-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "homemade or store-bought pizza dough",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "heavy cream or milk",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Lightly flour a work surface and lay the 6 dough balls out on top. Dust with flour and cover with a clean kitchen towel. Allow the dough balls to rest at room temperature until easy to stretch, about 45 minutes.",
    "Adjust an oven rack to the center position and heat oven to 425 degrees. Working 1 at a time and leaving the rest covered as you work, roll and stretch each ball of dough into a circle about 7 inches in diameter.",
    "Working with 1 circle at a time, layer a total 1 cup of leftovers in a log about 2 inches wide and 5 inches long down the center: Start with a layer of stuffing, which absorbs the juices as the pockets bake, then add vegetables, turkey, cranberry sauce and gravy. Do not overstuff.",
    "Fold the top and bottom of the dough over the ends of the log. Lift the right side over the log, stretching it a little to completely cover the filling while making sure the top and bottom stay tucked in. Fold the left side over and repeat. You should end up with a neat package about the size of a Chinese egg roll. Repeat with the remaining dough circles and filling.",
    "Transfer the pockets seam side down to a parchment-lined rimmed baking sheet. Combine the heavy cream or milk with 2 tablespoons of leftover gravy (if you have any) and brush the pockets with the mixture. (You can use plain heavy cream or milk if you do not have any leftover gravy.) Use a sharp knife to cut three slits on the top of the pockets for ventilation. Sprinkle the pockets with a dusting of shredded Parmesan or lay a half slice of Swiss or Cheddar on top of each one.",
    "Bake until deep golden brown, 12 to 18 minutes. Serve immediately with extra gravy and cranberry sauce for spooning or dipping. You can also refrigerate the cooked pockets and reheat them in a toaster oven, about 7 minutes at 425 degrees."
  ],
  "notes": [],
  "nutrition_infos": []
}