{
  "name": "Vegan Doughnuts",
  "categories": [],
  "servings": 12,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1021721-vegan-doughnuts",
  "image_urls": [
    "https://static01.nyt.com/images/2020/12/23/dining/21kwanzarex3-doughnuts/merlin_181221261_3fccd4eb-2df8-4b0d-b5ca-a299b84d0144-square640.jpg",
    "https://static01.nyt.com/images/2020/12/23/dining/21kwanzarex3-doughnuts/merlin_181221261_3fccd4eb-2df8-4b0d-b5ca-a299b84d0144-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/12/23/dining/21kwanzarex3-doughnuts/merlin_181221261_3fccd4eb-2df8-4b0d-b5ca-a299b84d0144-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "/4 teaspoons",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/60 milliliters lukewarm water",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/180 milliliters almond milk or other nondairy alternative",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoons/70 grams vegan butter",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pure vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "cup/65 grams unsweetened applesauce",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "85 grams all-purpose flour",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pure vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "to 1/2 cup/60 to 120 milliliters almond milk or other nondairy alternative",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/25 grams unsweetened cocoa powder",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the doughnuts: Stir the yeast and 1/4 teaspoon granulated sugar into the lukewarm water in a small bowl. Let stand until foamy, about 5 minutes. Meanwhile, combine the almond milk, vegan butter, vanilla, salt and remaining 1/4 cup/50 grams granulated sugar in a large mixer bowl and stir well. Add the applesauce and yeast mixture. Beat with a hand mixer or stand mixer fitted with the paddle attachment on medium speed until well blended.",
    "With the mixer running on low speed, add the flour 1/4 cup/30 grams at a time, waiting until no floury streaks remain before adding the next. Continue beating until all traces of flour disappear. With floured hands, turn the dough onto a generously floured surface and knead lightly, flouring the dough and surface as needed, to form into a ball that’s tacky and elastic but not sticky. Place the ball in a large oiled bowl and cover with plastic wrap. Let rise until doubled in size, 1 1/2 hours.",
    "Transfer the risen dough to a generously floured work surface and lightly sprinkle the dough with flour. With a floured rolling pin, gently roll into a 13-by-10-inch rectangle. The dough should be a scant inch thick. Using a floured 3-inch doughnut or round cutter, cut out rounds as close together as possible. If needed, using a floured 1-inch cutter, cut rounds out of the centers. Gather scraps, reroll and cut. Place each doughnut with its hole, spacing an inch apart, on a small square of parchment or wax paper. Cover lightly with plastic wrap and let rise until puffed, 45 minutes.",
    "Fill a large heavy pot with oil to a depth of 2 inches and heat over medium-high to 360 degrees. Line two wire racks with paper towels. Carefully flip a doughnut and hole off the parchment into the hot oil. Repeat until the pot is almost full and not crowded. Fry, turning once and adjusting the heat to maintain the oil temperature, until golden brown, 2 to 4 minutes for doughnuts and 1 to 2 minutes for holes. Drain on the paper towels. Repeat with the remaining dough, letting the oil come back to temperature between batches. Cool the doughnuts and holes to room temperature.",
    "Make the glaze: Whisk the confectioners’ sugar, vanilla and 1/4 cup/60 milliliters almond milk in a medium bowl until smooth. If you prefer a chocolate glaze, stir in the cocoa powder. If you prefer a green, red or black glaze, tint with food coloring. Stir in more almond milk as needed, a tablespoon at a time, for a thinner glaze.",
    "Discard the paper towels under the doughnuts and set the racks over rimmed baking sheets. Dip the tops of the doughnuts and holes in the glaze and return to the rack. If making chocolate-glazed doughnuts, sprinkle walnuts on top if you’d like. Let doughnuts stand until glaze sets. Serve on the same day."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    }
  ]
}