{
  "name": "Blueberry Crisp",
  "categories": [],
  "servings": 7,
  "minutes": 80,
  "source_url": "https://cooking.nytimes.com/recipes/1024462-blueberry-crisp",
  "image_urls": [
    "https://static01.nyt.com/images/2023/07/27/multimedia/27SUMMER-PARTY-REX4-blueberry-crisp-hvgl/27SUMMER-PARTY-REX4-blueberry-crisp-hvgl-square640.jpg",
    "https://static01.nyt.com/images/2023/07/27/multimedia/27SUMMER-PARTY-REX4-blueberry-crisp-hvgl/27SUMMER-PARTY-REX4-blueberry-crisp-hvgl-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/07/27/multimedia/27SUMMER-PARTY-REX4-blueberry-crisp-hvgl/27SUMMER-PARTY-REX4-blueberry-crisp-hvgl-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "36 grams all-purpose flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "packed tablespoons cornstarch",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "¼ pounds blueberries",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat the oven to 375 degrees.",
    "Prepare the topping: Zest the lemon directly over the sugar in a medium bowl and mix with a fork. (Save the zested lemon for the filling.) Mix in the flour, almonds and salt.",
    "The cooled melted butter has likely separated, so stir it until evenly pale yellow, then drizzle over the dry ingredients. Stir lightly and quickly until the mixture forms pea-sized crumbles with gravelly bits; don’t overmix. Refrigerate until ready to use. The topping can be covered and refrigerated for up to 3 days.",
    "Make the filling: Whisk the sugar and cornstarch in a large bowl to break up starchy clumps. Add the blueberries and squeeze in 1 tablespoon lemon juice from the reserved zested lemon. Toss until evenly coated, then scrape into a 1½- to 2-quart casserole (such as a 9-inch square dish or deep-dish pie plate).",
    "Spread the berry filling in an even layer, then cover with the topping, leaving no gaps. Place the dish on a rimmed baking sheet to catch any drips.",
    "Bake until the topping is golden brown and the filling is bubbling like lava, 40 to 45 minutes. You don’t want to burn your mouth eating the crisp hot, so let it cool for at least 15 minutes and preferably an hour or so because the filling firms up as it cools. It can be served warm or at room temperature, ideally with ice cream."
  ],
  "notes": [],
  "nutrition_infos": []
}