{
  "name": "Chocolate Caramel Pretzel Bars",
  "categories": [],
  "servings": 18,
  "minutes": 50,
  "source_url": "https://cooking.nytimes.com/recipes/1019477-chocolate-caramel-pretzel-bars",
  "image_urls": [
    "https://static01.nyt.com/images/2018/08/16/dining/pretzel-bars/pretzel-bars-square640-v3.jpg",
    "https://static01.nyt.com/images/2018/08/16/dining/pretzel-bars/pretzel-bars-videoSixteenByNineJumbo1600-v3.jpg",
    "https://static01.nyt.com/images/2018/08/16/dining/pretzel-bars/pretzel-bars-superJumbo-v3.jpg"
  ],
  "ingredients": [
    {
      "name": "ounces/225 grams pretzels about 6 cups",
      "amount": 8.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ounces/115 grams pecans or walnuts",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/160 milliliters heavy cream",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/215 grams semisweet or bittersweet chocolate",
      "amount": 1.25,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 350 degrees. Line a 9-inch square baking pan with parchment paper leaving a 2-inch overhang on two sides. In the bowl of a food processor, combine pretzels and sugar and process until you have fine crumbs. Add melted butter and process until evenly moistened. Transfer mixture into prepared pan and press down into a compact, even layer. Bake until crust is fragrant and edges are browned, about 17 minutes. Sprinkle with pecans and set aside.",
    "Prepare the caramel: In a medium saucepan, combine butter, cream, brown sugar and salt. Heat mixture over medium heat, stirring, until butter melts and everything is well combined. Turn heat to medium-high, and bring to a simmer. Cook for 2 minutes. Pour over pecans and prepared crust. Bake until caramel is bubbling and has darkened slightly, 13 to 15 minutes. Transfer to a rack.",
    "While caramel cools slightly, melt chocolate in short bursts in a heatproof bowl in a microwave or over a pot of simmering water. Let chocolate cool for a few minutes, then spread evenly over caramel. Sprinkle with crushed pretzels and let cool to room temperature. Transfer to the refrigerator to set for 30 to 60 minutes.",
    "To serve, lift the bars out using the parchment overhang and transfer to a cutting board. Cut into 16 or 20 squares. Store in an airtight container in the refrigerator."
  ],
  "notes": [],
  "nutrition_infos": []
}