{
  "name": "Classic Brioche",
  "categories": [],
  "servings": 2,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1018927-classic-brioche",
  "image_urls": [
    "https://static01.nyt.com/images/2017/09/28/dining/28COOKING-CLASSICBRIOCHE/28COOKING-CLASSICBRIOCHE-square640.jpg",
    "https://static01.nyt.com/images/2017/09/28/dining/28COOKING-CLASSICBRIOCHE/28COOKING-CLASSICBRIOCHE-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/09/28/dining/28COOKING-CLASSICBRIOCHE/28COOKING-CLASSICBRIOCHE-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "0 milliliters whole milk",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "active dry yeast from 2 packets",
      "amount": 4.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "60 grams all-purpose flour",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "60 grams bread flour",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large eggs",
      "amount": 9.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fiber, total dietary",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Protein",
          "amount": 12.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 10.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 140.0,
          "unit": "KCAL",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total Sugars",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Calcium, Ca",
          "amount": 56.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Iron, Fe",
          "amount": 2.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 140.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Cholesterol",
          "amount": 370.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total trans",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total saturated",
          "amount": 3.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "Heat milk in a small pot over medium-low heat until just warm. Add 1/4 cup of the sugar and swirl to dissolve. Add the yeast and transfer to the bowl of a stand mixer fitted with a dough hook. Let mixture sit a few minutes until you notice a few foamy bubbles start to form on top. (This lets you know the yeast is alive and well.)",
    "Whisk all-purpose flour, bread flour and remaining sugar together in a medium bowl. Add 8 eggs to the milk mixture, followed by half the flour mixture. With the mixer on low, start to incorporate the dry ingredients into the egg-and-milk mixture. Add remaining half of flour and knead a minute or two, until no dry spots remain.",
    "Turn the speed up to medium and continue to knead until dough is starting to look smooth, 4 to 6 minutes. Add salt and continue to knead until dough is firm, springy and elastic, another 4 to 6 minutes.",
    "Add butter, a few pieces at a time, fully incorporating each one before continuing, and scraping down the dough hook and bowl as needed. (It will start to crawl up the hook as you mix.) The first few additions take the longest, but have patience. It will take 30 to 40 minutes to work in all the butter.",
    "Once all butter is incorporated, continue kneading on medium speed for another 5 to 7 minutes, until the dough is smooth, shiny and elastic. It should look well emulsified and feel a bit sticky.",
    "Lightly grease a large bowl and transfer dough to the bowl. Wrap tightly with plastic wrap and refrigerate until the dough has doubled in size and firmed up, at least 12 and up to 24 hours. (The slow rise will develop better flavor, and the chilling will make the dough easier to handle and shape.)",
    "When you're ready to shape and bake the bread, turn it out onto a lightly floured work surface. Using a dough scraper or chef’s knife, divide the dough into two equal portions.",
    "Working with one piece at a time, flatten the dough into an 8-by-5-inch rectangle, about 1 inch thick. Working from the longer edge at the top, tightly roll the dough, using your thumb and index finger to press the seam to the dough each time it’s rolled. Pinch the dough at the last roll, so it is a well sealed, tightly compact log. Tuck the ends under, pinching to seal them as well.",
    "Transfer the dough to a greased (even better, nonstick and greased) 8 1/2-by-4 1/2-inch loaf pan, seam-side down. Repeat with remaining piece of dough.",
    "Tightly wrap both loaf pans individually with plastic wrap and place them in a warm, draft-free place. Let the dough rise until it’s touching the plastic wrap and looks as if it’s trying t o break out, about 2 hours. (For very warm kitchens, this might take closer to 1 hour and 45 minutes, for a cooler kitchen, it may be closer to 2 hours and 15 minutes.) A good idea is to write the time on masking tape stuck to the plastic wrap, so you don’t lose track of how long it’s been.",
    "Place an oven rack in the middle of the oven and heat to 375 degrees. Beat remaining egg with 1 teaspoon water (this is your egg wash) and brush it over the tops of the dough.",
    "Place loaf pans in the oven and bake, rotating halfway through, until the tops and sides are deep golden brown and bread is baked through completely, about 50 to 65 minutes. (If you have a probe thermometer, it should register 200 degrees when inserted into the center of the loaf.) If the loaves seem to be browning too quickly, tent lightly with foil. A good way to tell if the bread is fully baked is to tap the top: It should feel firm and make a light, hollow sound. (This indicates that the bread has lots of air, meaning it has risen properly and is fully baked and not dense and underbaked.)",
    "Using an oven mitt or kitchen towels, remove brioche from the oven and immediately remove them from their pans (run a knife around the edges if you have trouble dislodging). Place on a wire rack to cool completely. (If left to cool in the loaf pans, the bottoms and sides will steam and become soggy.) Let cool completely before slicing. Brioche, if wrapped tightly in plastic, will keep at room temperature for 5 days, refrigerated for 1 week and frozen for up to 1 month."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fiber, total dietary",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Protein",
      "amount": 12.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 10.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 140.0,
      "unit": "KCAL",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total Sugars",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Calcium, Ca",
      "amount": 56.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Iron, Fe",
      "amount": 2.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 140.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Cholesterol",
      "amount": 370.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total trans",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total saturated",
      "amount": 3.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    }
  ]
}