{
  "name": "Crispy Rice With Salmon And Avocado",
  "categories": [],
  "servings": 18,
  "minutes": 240,
  "source_url": "https://cooking.nytimes.com/recipes/1024715-crispy-rice-with-salmon-and-avocado",
  "image_urls": [
    "https://static01.nyt.com/images/2023/10/19/multimedia/AS-crispy-rice-with-salmon-cmwt/AS-crispy-rice-with-salmon-cmwt-square640.jpg",
    "https://static01.nyt.com/images/2023/10/19/multimedia/AS-crispy-rice-with-salmon-cmwt/AS-crispy-rice-with-salmon-cmwt-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/10/19/multimedia/AS-crispy-rice-with-salmon-cmwt/AS-crispy-rice-with-salmon-cmwt-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "sushi-grade",
      "amount": 1.5,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small avocado",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "neutral oil such as canola",
      "amount": 2.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium saucepan, stir together 2 cups water, the rice, vinegar, sugar and 1 teaspoon salt. Bring to a boil over high heat, cover, reduce heat to low and cook until rice is tender, 18 to 20 minutes. Remove from heat and let sit, covered, for 10 minutes.",
    "Line an 8-inch square baking pan with plastic wrap and leave a generous overhang on two sides. Transfer the rice to the prepared pan and press to flatten into an even layer. Let sit out at room temperature until cool, about 30 minutes, then cover with the overhang. Refrigerate until firm, at least 2 hours but preferably longer (up to 24 hours).",
    "When you’re done making the rice, in a small bowl, finely grate 1 teaspoon jalapeño (or more if you like it spicy) and the zest of the lemon. Add a pinch of salt and stir with a fork or chopsticks until combined. (Reserve the rest of the jalapeño for another use and the lemon for Step 4.) Use a sharp knife to slice the salmon crosswise into 18 pieces, roughly ¼-inch-thick. (For clean cuts, slice in one long motion from the heel to the tip of the knife, as opposed to sawing the fish. If you’re having difficulty, freeze the fish for 10 to 15 minutes to firm slightly, then try again.) Arrange on a plate, spread with the lemon-jalapeño mixture, cover and refrigerate for up to 24 hours.",
    "When you’re ready to cook, pit the avocado and thinly slice crosswise, arrange on a plate, squeeze half the lemon over, season with salt and refrigerate. Unwrap the rice and invert it onto a cutting board. Remove the plastic wrap. Using a greased knife, cut into 18 even rectangles. (Two cuts one way and five cuts the other.)",
    "In a large, nonstick skillet, heat 2 tablespoons oil and the butter over medium. When the butter is foaming, working in batches if necessary, add the rice blocks and cook until golden on the top and bottom. The timing will depend on how long you chilled your rice, but it could take anywhere from 5 to 10 minutes per side. Transfer to a paper-towel lined plate and sprinkle with salt. Repeat with the remaining blocks, adding more oil and butter as needed.",
    "Arrange the salmon jalapeño-side down on the rice, then top with a slice of avocado. Eat right away."
  ],
  "notes": [],
  "nutrition_infos": []
}