{
  "name": "Easy Crudités",
  "categories": [],
  "servings": 7,
  "minutes": 35,
  "source_url": "https://cooking.nytimes.com/recipes/1024624-easy-crudites",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/20/multimedia/LH-Crudite-vwlq/LH-Crudite-vwlq-square640.jpg",
    "https://static01.nyt.com/images/2023/11/20/multimedia/LH-Crudite-vwlq/LH-Crudite-vwlq-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/20/multimedia/LH-Crudite-vwlq/LH-Crudite-vwlq-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "vegetables for blanching",
      "amount": 5.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vegetables for serving raw",
      "amount": 5.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Prepare the blanched vegetables: Set up an ice bath by filling a large bowl halfway with ice, then add water until 2/3 full. Bring a large pot of salted water to a boil. If using broccoli and cauliflower, cut into bite-sized florets;  if using long vegetables like asparagus and green beans, leave them whole. Working one vegetable variety at a time, and starting with the lightest-colored ones, cook until crisp-tender, 1 to 3 minutes for most vegetables. Remove the vegetables with a strainer or slotted spoon and immediately transfer to the prepared ice bath. (Feel free to use a steamer basket if you have one.) Drain well and pat the vegetables dry.",
    "Wash and dry the vegetables you plan to serve raw and cut them into bite-sized pieces as necessary. If using lettuce leaves like endive or little gem, remove the individual leaves from the heads.",
    "If serving dips, place them in bowls on a large platter or board, then arrange the crudités around them in piles or stacks, grouping by kind. Sprinkle the vegetables lightly with salt. Add olives, artichokes, nuts and/or crackers, if using.",
    "Serve immediately, or refrigerate, covered loosely with plastic wrap, for up to 8 hours. Use any leftover crudités in a salad or soup, or cook for a simple side."
  ],
  "notes": [],
  "nutrition_infos": []
}