{
  "name": "Grilled Pork Chops With Plum BBQ Sauce",
  "categories": [],
  "servings": 7,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1024461-grilled-pork-chops-with-plum-bbq-sauce",
  "image_urls": [
    "https://static01.nyt.com/images/2023/07/27/multimedia/27SUMMER-PARTY-REX3-pork-chops-fjvz/27SUMMER-PARTY-REX3-pork-chops-fjvz-square640.jpg",
    "https://static01.nyt.com/images/2023/07/27/multimedia/27SUMMER-PARTY-REX3-pork-chops-fjvz/27SUMMER-PARTY-REX3-pork-chops-fjvz-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/07/27/multimedia/27SUMMER-PARTY-REX3-pork-chops-fjvz/27SUMMER-PARTY-REX3-pork-chops-fjvz-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "bone-in pork chops ½- to 1-inch thick",
      "amount": 8.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ripe but firm black or red plums",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small yellow onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Pat the pork chops dry, then season with salt and pepper. Generously coat with oil.",
    "In a bowl, toss the plums with 1 tablespoon brown sugar and a pinch of salt. Set aside to get juicy.",
    "Heat a saucepan over medium-high. Add 1 tablespoon oil and the onion. Season with salt and pepper. Cook, stirring occasionally, until the onion is soft, 5 to 7 minutes. Reduce the heat to medium.",
    "Add the chili sauce and stir constantly until slightly darker in color, 1 to 2 minutes. Stir in the vinegar and cook until reduced, just a few seconds. Add ½ cup water and the remaining ¼ cup brown sugar and bring to a simmer. Cook, stirring occasionally, until the sauce is thick, 3 to 5 minutes.",
    "Stir in the plums and bring to a simmer. Cover and cook until the plums are tender and the sauce is thickened to your liking, 1 to 2 minutes. Taste and add more salt, pepper and brown sugar as needed. (The sauce can be refrigerated for up to 3 days. Reheat before serving.)",
    "Heat an outdoor grill to high (or heat a stovetop grill pan over medium-high). Grill the pork chops until browned at the edges and no longer pink in the middle, 1 to 3 minutes per side for ½-inch-thick chops and 3 to 4 minutes for 1-inch thick chops.",
    "Let the pork rest for a few minutes, then serve with the warm sauce."
  ],
  "notes": [],
  "nutrition_infos": []
}