{
  "name": "Guacamole With Grilled Corn",
  "categories": [],
  "servings": 3,
  "minutes": 25,
  "source_url": "https://cooking.nytimes.com/recipes/1023414-guacamole-with-grilled-corn",
  "image_urls": [
    "https://static01.nyt.com/images/2022/08/24/dining/22Kenjirex/merlin_211506231_42aa7af6-f4c5-42b2-b986-72121b65762c-square640.jpg",
    "https://static01.nyt.com/images/2022/08/24/dining/22Kenjirex/merlin_211506231_42aa7af6-f4c5-42b2-b986-72121b65762c-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/08/24/dining/22Kenjirex/merlin_211506231_42aa7af6-f4c5-42b2-b986-72121b65762c-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ears corn",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium yellow or white onion",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium or 3 large avocados",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "crumbled cotija scant 1 cup",
      "amount": 4.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Prepare a coal or gas grill so it’s at high heat. Add the corn and cook, turning occasionally, until the kernels are lightly blackened in spots all over, 5 to 15 minutes. When corn is cool enough to handle, hold one ear upright in a large bowl and, using a sharp knife, cut off the kernels. Discard the cob, then repeat with the other ear. Let cool completely before adding to the finished guacamole.",
    "Meanwhile, in a large granite mortar and pestle or molcajete (see Tip), combine the onion, chile, cilantro and salt. Pound into a rough paste, 2 to 4 minutes. Transfer the paste to a large bowl.",
    "Add the flesh of the avocados and the lime juice. Crush the avocados into a chunky dip using the pestle or the back of a large spoon. Once corn kernels are completely cooled, add them and the Cotija to the large bowl, reserving a little of each for garnish. Fold together the guacamole, corn and cheese, and season to taste with more salt and lime juice. Sprinkle with remaining cilantro, Cotija and corn. Serve immediately with tortilla chips. (Try to eat in one sitting. Leftover guacamole stored in the fridge turns brown quickly.)"
  ],
  "notes": [],
  "nutrition_infos": []
}