{
  "name": "Salted Pistachio Shortbread",
  "categories": [],
  "servings": 24,
  "minutes": 35,
  "source_url": "https://cooking.nytimes.com/recipes/1019807-salted-pistachio-shortbread",
  "image_urls": [
    "https://static01.nyt.com/images/2018/12/05/dining/05slice5/05slice5-square640.jpg",
    "https://static01.nyt.com/images/2018/12/05/dining/05slice5/05slice5-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2018/12/05/dining/05slice5/05slice5-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cup/95 grams shelled",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/95 grams all-purpose flour",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 350 degrees.",
    "Process pistachios in a food processor until finely ground. Remove 2 tablespoons and set aside.",
    "Add confectioners’ sugar, butter and salt and pulse until well combined. Add flour and process until a slightly sticky dough forms (if your food processor is having trouble here, just dump dough out onto a counter or a bowl and mix by hand until no dry spots remain).",
    "Lightly grease a 9-inch springform pan or tart pan with a removable bottom with nonstick spray or softened butter and line the bottom with a circle of parchment paper.",
    "Press dough into the pan into an even layer (you can use your hands, or use the bottom of a measuring cup to press dough into an even layer). Dust with confectioners’ sugar and sprinkle with reserved 2 tablespoons ground pistachios and flaky salt.",
    "Bake until cookie is just golden around the edges and dough is baked through, 17 to 22 minutes.",
    "Once cookie is out of the oven, remove from springform or tart pan. Dust with more confectioners’ sugar, if you like. Before it cools, slice cookie into 24 thin wedges (start by cutting the circle into quarters, then slice each quarter in half, then each half into thirds to get nice, thin triangles.",
    "Let cookies cool completely before transferring them (they will be soft and easily broken if moved before cooled)."
  ],
  "notes": [],
  "nutrition_infos": []
}