{
  "name": "Sauerkraut",
  "categories": [],
  "servings": 8,
  "minutes": null,
  "source_url": "https://cooking.nytimes.com/recipes/1024425-sauerkraut",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/16/multimedia/LH-sauerkraut-qglp/LH-sauerkraut-qglp-square640.jpg",
    "https://static01.nyt.com/images/2023/11/16/multimedia/LH-sauerkraut-qglp/LH-sauerkraut-qglp-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/16/multimedia/LH-sauerkraut-qglp/LH-sauerkraut-qglp-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "medium green cabbage about 3 pounds",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "caraway seeds",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 0.7,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "Halve the cabbage through the stem and remove the core. Cut each half in half again, then thinly slice each quarter crosswise, as you would for coleslaw. Place the shredded cabbage in a very large bowl.",
    "Sprinkle the salt over the cabbage and begin massaging it with clean hands. Continue for about 5 minutes, until the cabbage becomes limp and is reduced by half in volume. Add the caraway seeds, if using, and toss.",
    "Divide the cabbage, along with any liquid that has collected in the bowl, between 2 (1-quart) jars, or other food-safe, non-reactive containers. Use a wooden spoon to tightly pack down the cabbage, repeating every few hours for the rest of the day. (This helps release more liquid.) Keep the jars loosely covered during this part of the process. The jars will not be full at first, but after fermentation begins, the volume will increase.",
    "Before leaving the cabbage overnight, place the lids on the jars, but don’t screw them on tightly. (The sauerkraut needs to “breathe” as it ferments. If the lids are too tight, the jars may explode. There are special air-lock lids meant for fermenting, but you can also use dish towels to cover the jars, then secure them in place with a rubber band.) The next day, if the cabbage is not fully submerged in liquid, make a saltwater solution to add to the jars: Dissolve 1 1/2 teaspoons of kosher salt in 1 cup of room temperature water, and divide between the jars. The cabbage should be fully submerged to prevent mold growth.",
    "Store the jars at room temperature in a dark spot (65 to 70 degrees), keeping the lids on but not screwed on tightly, as before, for at least 5 days and up to 2 weeks. Begin tasting the sauerkraut after 5 days. It will be tangy, briny and crunchy in texture when it’s ready. ",
    "Tightly screw on the lids and refrigerate the sauerkraut for up to 4 months. (Chilling the sauerkraut slows down the fermentation process, so tightly screwing on the lids is safe at this point.)"
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 0.7,
      "serving_size_unit": "g"
    }
  ]
}