{
  "name": "Simplest Strawberry Tart",
  "categories": [],
  "servings": 8,
  "minutes": 180,
  "source_url": "https://cooking.nytimes.com/recipes/1018052-simplest-strawberry-tart",
  "image_urls": [
    "https://static01.nyt.com/images/2016/04/13/dining/13COOKBOOK1/13COOKBOOK1-square640.jpg",
    "https://static01.nyt.com/images/2016/04/13/dining/13COOKBOOK1/13COOKBOOK1-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cup/85 grams all-purpose flour",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/85 grams rye flour",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "apple cider vinegar",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 15.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/225 grams mascarpone",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pound/450 grams small",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "high-quality strawberry jam",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Prepare the crust: Whisk the flours and salt together in a large bowl. Combine apple cider vinegar with 5 tablespoons ice water.",
    "Working quickly, add butter to the flour mixture and toss to coat. Use your fingers or the palms of your hands to press each cube of butter into the flour, ensuring that each butter piece gets coated, until the mixture resembles coarse meal with some pea-size lumps. If at any time the butter seems warm or soft, briefly refrigerate the bowl. Alternatively, you can pulse the butter and flour together in a food processor.",
    "Sprinkle 3 tablespoons of the cold vinegar-water mixture over the flour mixture. Use a gentle hand or wooden spoon to stir the water into the flour until just combined. If using a food processor, pulse a few more times, or until the dough begins to come together. If the dough seems dry, add more of the cold vinegar-water mixture, a couple of teaspoons at a time. You have added enough water when you can pick up a handful of the dough and easily squeeze it together without it falling apart.",
    "Form the dough into a disk and wrap in plastic wrap. Chill for at least 2 hours, but preferably overnight. (Dough keeps for up to 3 months in the freezer wrapped in a double layer of plastic wrap and a layer of foil. Thaw in refrigerator before using.)",
    "Position a rack in the center of the oven and heat to 400 degrees.",
    "On a lightly floured piece of parchment paper, roll out the pie crust into an oval about 15 x 6 inches and just under 1/4-inch thick. Use a paring knife or pastry cutter to trim any rough edges and move the parchment paper and crust to a baking sheet, preferably rimless. Dock the crust with a fork to prevent it from puffing up too much in the oven. Brush the surface of the crust from edge to edge with the egg wash.",
    "Bake until crust is deep golden brown, 15 to 20 minutes. Check on the crust halfway through baking; if any bubbles have appeared, use a spatula to press them flat. Cool the crust completely on the pan.",
    "Prepare the tart: While the crust is cooling, combine mascarpone and 2 tablespoons sugar. Hull the strawberries and cut them into 1/4-inch slices.",
    "Carefully slide the cooled crust off the baking sheet onto a serving platter or board. Spread mascarpone over the top in an even layer, dot with jam, then arrange sliced strawberries in a single, slightly overlapping layer in a decorative pattern. Sprinkle the tart with the remaining tablespoon of sugar. (Omit this final sprinkling if your strawberries are particularly sweet.) Slice and serve immediately."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 15.0,
      "serving_size_unit": "g"
    }
  ]
}