{
  "name": "S’mores",
  "categories": [],
  "servings": null,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1023383-smores",
  "image_urls": [
    "https://static01.nyt.com/images/2022/08/08/dining/SMORESREX-smores/merlin_210763791_566f449f-66b1-40ec-a407-ac2bdb3b4307-square640.jpg",
    "https://static01.nyt.com/images/2022/08/08/dining/SMORESREX-smores/merlin_210763791_566f449f-66b1-40ec-a407-ac2bdb3b4307-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/08/08/dining/SMORESREX-smores/merlin_210763791_566f449f-66b1-40ec-a407-ac2bdb3b4307-superJumbo.jpg"
  ],
  "ingredients": [],
  "instructions": [
    "Expertly assemble and ignite a campfire. (Watch a how-to video, if you need.)",
    "Procure roasting skewers: Metal skewers are the way to go, as they won’t leave bits of tree bark behind in your marshmallow. (Flammable twigs and wooden skewers aren’t the safest options for younger kids.) Double-pronged roasting sticks designed for marshmallows will keep marshmallows secure as they soften over the flames, but extra-long metal skewers work just fine.",
    "Make a s’more: With a paper towel, rub a little neutral cooking oil over the end of the metal skewer where the marshmallows will go; this keeps the sugary pillows from sticking. Skewer 2 regular marshmallows or 1 jumbo marshmallow onto the rod.",
    "Top a cracker with 1 or 2 squares of chocolate, depending on size and personal preference. Sprinkle a little salt over the chocolate, if you like.",
    "Roast your marshmallows: Resist the urge to immediately plunge them directly into the flames. Hold the marshmallows over the top of the flames, and roast, rotating often, until the marshmallows are golden, gooey in the center and slumped slightly down the skewer, 2 to 3 minutes. Lower the marshmallows into the flames, let them catch fire briefly and then carefully blow them out. A perfect marshmallow is a burnished marshmallow, after all.",
    "Immediately place the charred, skewered marshmallows on the chocolate-topped cracker. Take the unadorned cracker and press down as you pull out the skewer so that the gooey marshmallows ooze over the chocolate and out of the edges of the crackers. Devour immediately. Repeat, repeat, repeat."
  ],
  "notes": [],
  "nutrition_infos": []
}