{
  "name": "Tetelas de Frijol Negro (Black Bean Masa Dumplings)",
  "categories": [],
  "servings": 9,
  "minutes": 65,
  "source_url": "https://cooking.nytimes.com/recipes/1024130-tetelas-de-frijol-negro-black-bean-masa-dumplings",
  "image_urls": [
    "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX3-tetelas-mbfg/TORTILLASREX3-tetelas-mbfg-square640.jpg",
    "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX3-tetelas-mbfg/TORTILLASREX3-tetelas-mbfg-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/07/07/multimedia/07TORTILLASREX3-tetelas-mbfg/TORTILLASREX3-tetelas-mbfg-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "3/4 cups or 2 cups/260 grams masa harina see tips",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "rendered lard preferably not hydrogenated",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium white onion",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "garlic clove",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "can black beans",
      "amount": 8.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Set out a blender; a 1-gallon zip-top freezer bag; a plastic produce bag or plastic wrap; and a tortilla press, smooth-bottomed 10-inch skillet or a glass pie plate.",
    "If using fresh masa, knead the fresh masa, 1/4 teaspoon salt and 2 tablespoons water with your hands in a large bowl until the mixture is soft and pliable but doesn't stick to your hands. If using masa harina, mix the masa harina, 1/4 teaspoon salt and 1 1/3 cups water with your hands in a large bowl until the mixture is soft and pliable but doesn’t stick to your hands.",
    "Scoop 1/4 cup of masa, roll into a ball and pat into a 1/2-inch thick patty. If the edges are cracked and craggy, the masa needs more water. The edges of the patty should be completely smooth; this is the sign that the masa is properly hydrated. If it's still too dry or crumbly, add a tablespoon or two more water, one at a time, and mix to incorporate. When fully hydrated, knead for 3 minutes, cover the bowl with a damp clean towel and let sit for 20 minutes.",
    "To make the filling, heat 2 tablespoons of lard in a heavy medium skillet, preferably cast iron, over medium-high and cook the onion, garlic, chiles and avocado leaves, stirring occasionally, until tender and brown, 6 to 8 minutes.",
    "Use a slotted spoon to transfer the onion mixture to a blender, leaving as much lard in the skillet as possible. Add the beans and their liquid and purée until smooth.",
    "To the skillet with the reserved lard, add the remaining 1 tablespoon lard and heat over high until just beginning to smoke, about 1 minute. Carefully and quickly add the bean purée to the hot oil; the mixture will spit and sputter but then rapidly settle down. Cook, stirring frequently to avoid scorching, until the mixture is very thick and is the consistency of pudding, 5 to 8 minutes. Remove from the heat, taste and season with salt if necessary. Let cool; the beans will thicken as they sit.",
    "Cut an 8-inch square of plastic from a zip top bag and from a produce bag. (The masa will be easier to remove from the plastic if you use two pieces of differing thicknesses.) Divide the dough into 9 ping-pong ball-sized portions and roll into balls. Arrange on a sheet pan and keep covered with a damp kitchen towel while you press and cook the tetelas.",
    "Heat a comal, medium nonstick skillet, well-seasoned cast-iron skillet or griddle over medium-heat. Place the thicker plastic square on the bottom of the press. Working with one dough ball at a time, open the press and place one ball in the center and top with the thinner plastic. Gently press, holding steady firm pressure for a few seconds to flatten the dough to a 6 1/2-inch round. Open the press and remove the top plastic. (Alternatively, you can place the thicker plastic on a clean work surface and top with a masa ball and the thinner plastic and press down with a smooth-bottomed large skillet or pie plate.)",
    "To make each tetela, place 1 tablespoon bean paste in the center of a masa round and gently spread into a 3-inch circle. Using the plastic to help you, fold over one side of the masa round towards the center and gently press into the bean paste. Peel the plastic back from the folded section. Fold a second section over at a 45-degree angle. Press into the bean paste in the center of the masa round and peel the plastic back. You should have a triangle-shaped top and a rounded bottom. Fold the bottom into the center making a triangle with no beans showing. Peel the plastic back and pat the masa at the seams to seal.",
    "Cook the tetelas, two at a time, until deep brown in spots on both sides and slightly puffed, about 2 minutes per side. Place on a plate and cover with a clean kitchen towel to keep them warm. Repeat with the remaining dough balls and bean paste. Serve warm with a drizzle of crema, a sprinkle of queso fresco and salsa on the side."
  ],
  "notes": [],
  "nutrition_infos": []
}