{
  "name": "Apple-Quince Tarte Tatin",
  "categories": [],
  "servings": 8,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/foolproof-tarte-tatin-52996231",
  "image_urls": [
    "/verso/static/epicurious/assets/fallback-image-placeholder.jpeg"
  ],
  "ingredients": [
    {
      "name": "40 g all-purpose flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium apples 4 pounds 2 kg",
      "amount": 8.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "medium quinces 1 pound 450 g",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "To make the dough, in a stand mixer fitted with the paddle attachment (or in a bowl with a pastry blender), mix together the flour, the 2 teaspoons sugar, and the salt. Add the 4 tablespoons (2 ounces/60 g) chilled butter pieces and keep mixing until the butter pieces are about the size of corn kernels. Add the ice water and mix until the dough comes together. Gather the dough and shape it into a disk, wrap it in plastic wrap, and refrigerate for at least 30 minutes.",
    "To prepare the fruit and assemble the tart, peel, quarter, and core the apples. Peel, quarter, and core the quinces, then cut them into 1/4-inch (6-mm) slices. Melt the 3 tablespoons (1 1/2 ounces/145 g) butter in a 10-inch (25-cm) cast iron skillet. Sprinkle the 3/4 cup (150 g) sugar over the bottom of the pan and remove from the heat.",
    "Pack the apples tightly in the pan, standing them on end, with the cored sides facing inward. It may seem like a lot of fruit, but they’ll cook down considerably. Insert the quince slices between the apples.",
    "Place the skillet on the stovetop and cook over medium heat until the juices thicken and become lightly caramelized, about 25 minutes. While they’re cooking, press down on the apples to ease them into the pan and promote caramelization.",
    "Preheat the oven to 375°F (190°C).",
    "Lightly flour a work surface and roll out the dough into a 12-inch (30-cm) circle. Drape the dough over the apples in the skillet and tuck the edges down between the sides of the skillet and the apples.",
    "Bake the tart until the pastry has browned, about 40 minutes. Remove from the oven and invert a serving plate over the skillet. Wearing long oven mitts, grasp both the skillet and the plate and turn them over together, away from you, to unmold the tart. Be careful of any hot juices that may spill out!",
    "Although purists say tarte Tatin is best served on its own, others appreciate a spoonful of crème fraîche or Vanilla Ice Cream (page 143) on top or alongside.",
    "The dough can be made up to 2 days ahead and refrigerated, or frozen for up to 1 month. Tarte Tatin should be served warm the day it’s made. You can make it an hour or so in advance and leave it on the serving plate, under the overturned skillet, to keep it warm after baking. It can also be rewarmed in a low oven.",
    "Poaching the quince before assembling the tart will turn them a lovely ruby-red color and bring out even more flavor: In a medium saucepan, bring 1/2 cup (100 g) sugar, 1 1/2 cups (375 ml) water, and a 2-inch (5-cm) piece of vanilla bean, split lengthwise, stirring to dissolve the sugar, then decrease the heat to maintain a simmer.",
    "Peel, core, and cut the quinces into eighths. Put the pieces in the saucepan, cover with a circle of parchment paper cut to fit inside the pan, and simmer gently, covered, until tender, 30 to 60 minutes. Once poached, the quince can be kept in the refrigerator in the poaching liquid for up to 1 week. When assembling the tart, tuck the poached quince pieces between the apples. The poaching liquid can be reduced in a skillet until thick and syrupy, cooled slightly, and used as a sauce, if desired.",
    "Use a full-flavored apple, one that won’t turn to mush during cooking. Winesap, Granny Smith, Northern Spy, Pippin, and Jonagold work well."
  ],
  "notes": [],
  "nutrition_infos": []
}