{
  "name": "Butter Pilaf",
  "categories": [],
  "servings": 6,
  "minutes": 70,
  "source_url": "https://cooking.nytimes.com/recipes/1024516-butter-pilaf",
  "image_urls": [
    "https://static01.nyt.com/images/2024/01/04/multimedia/101REX-butter-pilaf-kvzm/101REX-butter-pilaf-kvzm-square640.jpg",
    "https://static01.nyt.com/images/2024/01/04/multimedia/101REX-butter-pilaf-kvzm/101REX-butter-pilaf-kvzm-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2024/01/04/multimedia/101REX-butter-pilaf-kvzm/101REX-butter-pilaf-kvzm-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "long-",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Rinse and soak the rice: Place the rice in a medium bowl. Cover with cool tap water, use your hand to gently agitate the grains, then drain. Repeat at least two more times or until the water runs clear enough for you to see your hand through it. Cover with cool water and let soak for at least 15 minutes and up to 2 hours. ",
    "Drain the rice. Add the butter to a heavy-bottomed medium saucepan with a tight-fitting lid. Melt over medium heat until foamy. Add the rice and cook, stirring frequently, until the grains look shiny, smell nutty, and sizzle and sputter in the butter, 5 to 7 minutes. ",
    "Add the water and 1/2 teaspoon salt and stir to combine: For short-grain rice, add 2 cups water. For medium-grain rice, add 3 cups water. For long-grain rice, add 4 cups water.",
    "Cover with a tight-fitting lid and increase the heat to high. Once you hear the water actively bubbling, reduce the heat to the lowest setting. Cook, without disturbing or lifting the lid, for 18 minutes. ",
    "Uncover the pilaf, fluff with a fork, and evaluate: The grains should be tender and moist (they will become more distinct and firm after resting). The water should all be absorbed. If so, cover and rest for 15 minutes, taste and add more salt if desired then serve. If not, troubleshoot: If the grains aren’t tender and there is no more water, drizzle over 2 tablespoons of hot tap water, cover, and steam on medium-low for another 10 minutes. If the grains are cooked, and there is still water left in the pot, uncover and cook on medium-low until it’s simmered off. Then fluff again, cover and rest for 15 minutes, taste and add more salt if desired then serve."
  ],
  "notes": [],
  "nutrition_infos": []
}