{
  "name": "Centerpiece Salmon With Thai Basil and Browned Butter",
  "categories": [],
  "servings": 7,
  "minutes": 105,
  "source_url": "https://cooking.nytimes.com/recipes/1019753-centerpiece-salmon-with-thai-basil-and-browned-butter",
  "image_urls": [
    "https://static01.nyt.com/images/2018/11/21/dining/21ottorex-1/21ottorex-1-square640.jpg",
    "https://static01.nyt.com/images/2018/11/21/dining/21ottorex-1/21ottorex-1-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2018/11/21/dining/21ottorex-1/21ottorex-1-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cup/10 grams dried wakame seaweed",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "garlic cloves",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 20.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 100.0,
          "unit": "KCAL",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 40.0,
          "unit": "MG",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "limes finely grate the zest to get 2 tablespoons",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 grams peeled",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/10 grams roughly chopped thai basil",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 1.6666666666666667,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large salmon fillet a side of salmon",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "80 grams breakfast radishes or regular radishes",
      "amount": 3.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "500 grams sunchokes also known as jerusalem artichokes",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pounds/600 grams small-medium white or yellow potatoes",
      "amount": 1.6666666666666667,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Melt butter in a small saucepan over medium-high heat for about 8 minutes, swirling from time to time until it begins to foam, turn light brown, and smell nutty and caramelized. Remove from heat, stir in wakame and leave to infuse for 10 minutes.",
    "In a spice grinder, mini food process or mortar, blitz or pound the garlic, lime zest, ginger and 1 1/2 teaspoons flaky salt (or 3/4 teaspoon fine salt) to a paste, scraping the sides down as you go. Add the chopped basil leaves, and blitz or pound until broken down into a bright green paste.",
    "Strain the browned butter into a small bowl and set the now-crisp wakame aside on a plate lined with paper towels.",
    "Add 1 1/2 tablespoons of the garlic paste to the bowl with the butter and stir well. Add the remaining paste to a separate small bowl, stir in 1 1/2 tablespoons olive oil, and set aside.",
    "Place the salmon skin side down on a very large rimmed baking sheet lined with parchment, arranging it diagonally so it fits. Rub with 1 1/2 teaspoons flaky salt (or 3/4 teaspoon fine salt), then spoon the butter mixture evenly over to cover. Set aside at room temperature for about an hour. (Alternatively, you can prepare the salmon up to this point and refrigerate, covered, up to 4 hours.)",
    "Toss the radishes together with 1/4 teaspoon flaky salt (or 1/8 teaspoon fine salt) and 1 tablespoon lime juice and set aside.",
    "Heat the oven to 450 degrees Fahrenheit/230 degrees Celsius and position a rack in the top third of the oven.",
    "Fill a large bowl with water. Peel the sunchokes, adding them to the water as you go to prevent discoloration. Cut them into 1 1/4-inch/3-centimeter chunks, then dry very well with a kitchen towel. Toss together with 1 tablespoon oil and 1/2 teaspoon flaky salt (or 1/4 teaspoon fine salt) and spread out on a parchment-lined baking sheet.",
    "Roast sunchokes for 20 to 22 minutes, tossing the vegetables and rotating the pans halfway through, until golden brown and cooked through. Set aside to cool. Reduce the temperature to 350 degrees Fahrenheit/180 degrees Celsius.",
    "While the sunchokes are roasting, peel the potatoes, add to a medium saucepan, cover with cold, well-salted water, and bring to a simmer over medium-high heat. Once simmering, cook for 12 to 15 minutes (or longer, if larger), until a knife goes all the way through, but they still hold their shape. Drain and let cool for 5 minutes. Cut potatoes into 1 1/2-inch chunks. Add the cooled potatoes and sunchokes to a large bowl and set aside.",
    "Bake the salmon for 15 minutes, then remove and baste well; it should be firm at the edges but still tender in the center. (Depending on the thickness and type of salmon you use, it may take as little as 10 minutes or as long as 20; adjust accordingly.) Turn the oven to the broil (grill) setting on the highest temperature and tear away any exposed parchment so it doesn’t burn.",
    "Return the salmon to the oven and broil about 4 inches from the heat for 4 minutes, or until browned on top and cooked through but still a little pink inside. Let cool for 5 minutes. Carefully transfer the salmon to a very long, large platter, skin side down, using a wide fish spatula, and spoon the butter evenly over it.",
    "Add the remaining 3 tablespoons lime juice to the garlic paste and stir well. Add this to the potatoes and sunchokes and gently toss together. Toss in the crispy wakame, pickled radishes, Thai basil leaves and green onions and arrange the salad next to the salmon. Serve with lime wedges alongside."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 20.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 100.0,
      "unit": "KCAL",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 40.0,
      "unit": "MG",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    }
  ]
}