{
  "name": "Cheesy French Toast With Kimchi",
  "categories": [],
  "servings": 1,
  "minutes": 10,
  "source_url": "https://cooking.nytimes.com/recipes/1023918-cheesy-french-toast-with-kimchi",
  "image_urls": [
    "https://static01.nyt.com/images/2023/02/07/multimedia/HM-Cheese-and-kimchi-French-toast2-wlkh/HM-Cheese-and-kimchi-French-toast2-wlkh-square640.jpg",
    "https://static01.nyt.com/images/2023/02/07/multimedia/HM-Cheese-and-kimchi-French-toast2-wlkh/HM-Cheese-and-kimchi-French-toast2-wlkh-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/02/07/multimedia/HM-Cheese-and-kimchi-French-toast2-wlkh/HM-Cheese-and-kimchi-French-toast2-wlkh-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "large egg",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "scallion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "roughly chopped drained vegan or regular kimchi about 2 1/2 ounces",
      "amount": 2.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium shallow bowl, add the egg and soy sauce and whisk together until completely smooth. Add the scallions and a few turns of black pepper and whisk to combine.",
    "In a small bowl, combine the kimchi and grated cheese. (If you are using sliced cheese, tear it up.)",
    "Place the two slices of bread on a cutting board and top one with the kimchi and cheese mixture. Place the other slice of bread on top to create a sandwich.",
    "Dip one side of the sandwich into the egg mixture and leave for 30 seconds. Carefully flip the sandwich over (making sure the filling doesn’t fall out) and soak the other side in the remaining egg mixture, leaving it while you prepare your skillet.",
    "Heat a medium nonstick skillet on medium for 1 to 2 minutes until it is hot. Add the butter and swirl to melt. Place the eggy sandwich into the pan, cover with a lid and cook for 2 minutes until it is golden. Flip the sandwich over to cook the other side, covering with a lid and leaving for 2 to 3 minutes, until the bread is golden and the cheese is melted.",
    "Slice in half and eat while warm."
  ],
  "notes": [],
  "nutrition_infos": []
}