{
  "name": "Cheese Straws",
  "categories": [],
  "servings": 4,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/cheese-straws-52914101",
  "image_urls": [
    "/verso/static/epicurious/assets/fallback-image-placeholder.jpeg"
  ],
  "ingredients": [
    {
      "name": "bricks sharp cheddar cheese",
      "amount": 6.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "2 sticks butter",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "sifted all-purpose flour",
      "amount": 4.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dash of garlic powder",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Preheat the oven to 325°F.",
    "Put the softened cheese and butter in the bowl of a heavy-duty electric mixer. Using the heaviest mixer attachment, beat the cheese and butter until the mixture has the consistency of whipped cream, about 30 minutes.",
    "On a sheet of waxed paper, sift 3 cups of the flour with the salt, black pepper, cayenne, and garlic powder. Gradually add the seasoned flour to the cheese mixture by large spoonfuls, beating well after each addition. Add the unseasoned flour until the dough is somewhat stiff but still soft enough to be pushed through a cookie press; you may not need to add all of the flour.",
    "Lightly spray a cookie sheet with cooking spray. Put a portion of the dough into a cookie press fitted with the star tube and press the dough onto the cookie sheet in long strips that run the length of the pan (see Note). Bake for 20 minutes. The cheese straws should be golden brown and crisp. With a sharp knife, cut the long strips into 3-inch lengths. Use a flat, thin spatula or egg turner to remove the cheese straws from the pan. Allow them to cool on a wire rack. When they are completely cool, store in a tightly covered container.",
    "If you find a Mirro cookie press, either vintage or new, that includes the star tube, grab it!",
    "If you don’t have a cookie press, form the dough into 1-inch balls and flatten them with a fork."
  ],
  "notes": [],
  "nutrition_infos": []
}