{
  "name": "Chocolate Hazelnut Crepe Cake",
  "categories": [],
  "servings": 9,
  "minutes": 360,
  "source_url": "https://cooking.nytimes.com/recipes/1018338-chocolate-hazelnut-crepe-cake",
  "image_urls": [
    "https://static01.nyt.com/images/2016/10/05/dining/05CREPE1-WEB/05CREPE1-WEB-square640.jpg",
    "https://static01.nyt.com/images/2016/10/05/dining/05CREPE1-WEB/05CREPE1-WEB-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2016/10/05/dining/05CREPE1-WEB/05CREPE1-WEB-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "large eggs 2 large egg yolks",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/473 milliliters whole milk",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/118 milliliters heavy cream",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "45 grams all-purpose flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/90 grams hazelnut meal",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pure vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 5.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "ounces/170 grams high-quality chocolate",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/40 grams cornstarch",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/25 grams good quality cocoa powder",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/591 milliliters whole milk",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoons/45 milliliters br",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/236 milliliters heavy cream",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoons/27 grams chopped",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Prepare the crepe batter: Whisk together eggs, egg yolks, milk and cream in a medium bowl. In a large bowl, whisk together flour, hazelnut meal, sugar and salt. Make a well in the center of the flour mixture and pour in some of the milk mixture. Gently whisk from the center of the well, making a thick, smooth batter. Then, while whisking, gradually add remaining milk mixture and whisk until smooth. Whisk in vanilla and butter. (Alternatively, combine all the ingredients in a blender and blend on low speed until smooth.) Cover and refrigerate for at least 2 hours and up to 48 hours.",
    "Prepare the chocolate cream: Place chopped chocolate in a medium bowl and set a fine mesh sieve over the bowl. In a medium saucepan, whisk together sugar, cornstarch, cocoa powder and salt. Whisk in some of the milk to create a thick paste. Gradually add remaining milk while whisking until mixture is smooth and well-combined. Whisk in egg yolks and add butter.",
    "Cook milk mixture over medium heat, whisking constantly and occasionally scraping the bottom and sides of the pan with a rubber spatula. Once the mixture comes to a boil and becomes very thick, about 5 minutes, whisk it vigorously for 1 to 2 minutes. Press hot cream mixture through the sieve into the bowl with the chocolate. Let it stand for 2 minutes, then mix it until smooth and well-combined. Add brandy or coffee and stir to combine. Use a rubber spatula to stir the mixture until it has cooled to about room temperature and is smooth and silky. Cover with plastic wrap, pressed into the surface of the custard, and chill until ready to use.",
    "Cook the crepes: Melt a little bit of butter in an 8-inch nonstick skillet over medium heat and let the pan get hot. Remove the pan from the heat and immediately add a scant 1/4 cup (about 3 tablespoons) crepe batter to one side of the pan. (You don’t want to use too much batter or you’ll have thick crepes.) Quickly tilt and swirl the pan to spread the batter to an even thickness across the bottom of the pan and about 1 inch up the sides.",
    "Return the pan to the heat and cook crepe until very lightly golden and set on one side, about 45 seconds. Tuck a small offset spatula under the edge of the crepe, grab onto it with your fingers, and quickly flip it over. Cook until light golden brown on the other side, 30 seconds to 1 minute. Slip crepe onto a rack to cool. Once crepes are cool, transfer them to a baking sheet and cover with a light towel to keep them from drying out. Continue with remaining batter, occasionally wiping out the skillet with a paper towel and very lightly buttering the skillet every few crepes as needed. You should have 20 to 24. (You need 20 for the cake.)",
    "To assemble, stir the cream until smooth. Lay 1 crepe on a cake plate. Using an offset spatula, cover with a thin layer of chocolate cream (2 to 3 tablespoons), leaving a 1/4-inch border. Cover with a crepe and repeat to make a stack of 20, with the best-looking crepe on top. Cover with plastic wrap and chill for at least 2 hours.",
    "To serve, top with whipped cream, nuts and dust with cocoa."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 5.0,
      "serving_size_unit": "g"
    }
  ]
}