{
  "name": "Crispy Mushroom Focaccia",
  "categories": [],
  "servings": 6,
  "minutes": 70,
  "source_url": "https://cooking.nytimes.com/recipes/1021818-crispy-mushroom-focaccia",
  "image_urls": [
    "https://static01.nyt.com/images/2021/01/21/dining/ejm-mushroom-foccacia/merlin_181550139_9b3405af-0958-4bba-8e9a-33386c67cf8e-square640.jpg",
    "https://static01.nyt.com/images/2021/01/21/dining/ejm-mushroom-foccacia/merlin_181550139_9b3405af-0958-4bba-8e9a-33386c67cf8e-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/01/21/dining/ejm-mushroom-foccacia/merlin_181550139_9b3405af-0958-4bba-8e9a-33386c67cf8e-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/480 grams all-purpose flour",
      "amount": 3.75,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "instant yeast",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/420 milliliters warm water about 95 to 100 degrees",
      "amount": 1.75,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/60 milliliters extra-virgin olive oil",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ounces/850 grams about 2 pounds trimmed assorted mushrooms",
      "amount": 30.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoons/90 milliliters extra-virgin olive oil",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a large bowl, stir the flour, yeast, salt, water and oil together until well combined. The ingredients should come together easily to form a wet dough, about 2 minutes. Cover the bowl and let rise at room temperature for at least 8 hours and no more than 10 hours. (You can refrigerate at this point for up to 18 hours, then allow to come to room temperature before stippling.)",
    "Heat the oven to 425 degrees. Prepare the mushrooms: Use a paring knife to trim the mushrooms and cut them into medium-large pieces, leaving smaller mushrooms whole whenever possible because they will shrink when they roast. On a baking sheet, toss the mushrooms with 3 tablespoons olive oil, and season with salt and pepper.",
    "Spread the mushrooms in an even layer and roast until tender, 25 to 30 minutes. They should shrink a lot, but should only just begin to brown. Set aside to cool.",
    "When the dough has fully risen, pour 2 tablespoons olive oil onto a baking sheet and spread all over the baking sheet with your hands. Pour the risen dough onto the baking sheet, and use your fingers to spread and stipple the dough until about 1/2-inch thick. Don’t worry if your dough doesn’t stretch much at first; it will be easier after it rests. Let sit for 15 to 20 minutes.",
    "Drizzle with remaining 1 tablespoon olive oil and stipple again, but don’t let it thin out too much. (It’s more important that it remains the appropriate thickness, not that it fills the whole pan.) Arrange the cooled mushrooms in an even layer on top of the dough.",
    "Top the focaccia with a generous, even layer of grated Parmesan or flaky sea salt. Bake until the edges of the focaccia become golden brown and the mushrooms are very crisp, 20 to 25 minutes.",
    "Squeeze the lemon over the surface of the focaccia. Cool at least 10 minutes before serving. Top with chives just before serving, if using."
  ],
  "notes": [],
  "nutrition_infos": []
}