{
  "name": "Fried Artichokes",
  "categories": [],
  "servings": 8,
  "minutes": 60,
  "source_url": "https://cooking.nytimes.com/recipes/1016229-fried-artichokes",
  "image_urls": [
    "https://static01.nyt.com/images/2014/04/09/dining/09PASSOVER1_395/09PASSOVER1_395-square640-v2.jpg",
    "https://static01.nyt.com/images/2014/04/09/dining/09PASSOVER1_395/09PASSOVER1-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "american globe artichokes",
      "amount": 8.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Mix salt and pepper in a small bowl. Fill a large bowl with water and add juice and rinds of lemons. Set both bowls aside.  ",
    "Using a sharp paring or bird’s beak knife, shave off the tough outer leaves of artichokes until you reach the tender pale green or yellow leaves and create a bulbous shape. Cut off at least an inch of the thorny top. Trim the stem near the heart, peeling off the outer green fiber and leaving about 2 inches of stem if possible. Immediately put the artichokes in the lemon water to prevent browning.",
    "Fill an electric fryer or deep cast-iron enameled pot with enough oil to almost cover artichokes. Heat to 325 degrees. While oil is heating, dry artichokes well with paper towels. Tap the flat top of the cut artichoke against the table to loosen the leaves. Sprinkle with salt and pepper, rubbing in the seasoning. ",
    "Fry artichokes in batches. Cook, turning occasionally with tongs, for about 15 minutes, or until a fork easily pierces the stem at its thickest point. The outside should be bronzed.",
    "Remove artichokes from oil and drain well, stem side up, on a paper-towel-lined baking sheet. Gently open leaves to remove choke (using a grapefruit spoon or melon baller) and encourage the leaves to spread. You can now freeze them or leave them out, stem side up, for a few hours until ready to finish.",
    "When ready to serve, reheat the oil to 350. Working in batches again, return artichokes, stem side up, to hot oil just to crisp. Drain well and serve immediately with a sprinkle of salt. Eat with your fingers."
  ],
  "notes": [],
  "nutrition_infos": []
}