{
  "name": "Hawaii-Style Sherbet",
  "categories": [],
  "servings": 9,
  "minutes": 860,
  "source_url": "https://cooking.nytimes.com/recipes/1024322-hawaii-style-sherbet",
  "image_urls": [
    "https://static01.nyt.com/images/2023/07/02/multimedia/02EAT-recipe-hawaii-style-sherbet-zhql/02EAT-recipe-hawaii-style-sherbet-zhql-square640.jpg",
    "https://static01.nyt.com/images/2023/07/02/multimedia/02EAT-recipe-hawaii-style-sherbet-zhql/02EAT-recipe-hawaii-style-sherbet-zhql-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/07/02/multimedia/02EAT-recipe-hawaii-style-sherbet-zhql/02EAT-recipe-hawaii-style-sherbet-zhql-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "can sweetened condensed milk",
      "amount": 7.5,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "can evaporated milk ; see tip",
      "amount": 5.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Bring the contents of the can of room-temperature strawberry soda to a boil, either in a microwave in a medium, microwave-safe bowl for 2 to 3 minutes, or in a medium saucepan on the stovetop.",
    "Remove from heat and whisk in dry Jell-O mix until thoroughly dissolved, then whisk in condensed milk and vanilla extract until well combined.",
    "Refrigerate, uncovered, overnight, or freeze for 2 to 3 hours, until thickened. When it’s ready, it will have a texture akin to a loose jelly.",
    "Whisk the mixture using an electric hand or stand mixer on high speed for 3 to 7 minutes, until it starts to lighten in color and almost doubles in volume. (If you do not have an electric mixer, whisk by hand for about 10 minutes.) Whipping the gelatin helps to stabilize the mixture and introduces tiny air bubbles, which make it less icy once frozen, and easier to scoop.",
    "Turn the speed to low and stir in the remaining 2 chilled cans of strawberry soda, followed by the evaporated milk (if using).",
    "Transfer the mixture to a container with a lid or cover with plastic wrap. Freeze overnight or for at least 12 hours before scooping and serving."
  ],
  "notes": [],
  "nutrition_infos": []
}