{
  "name": "Homemade Paneer",
  "categories": [],
  "servings": 9,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/slow-cooker-saag-paneer-56d3207915dc71625d4da1b1",
  "image_urls": [
    "https://assets.epicurious.com/photos/5f89f0881e8871bc67707d54/16:9/w_576,h_324,c_limit/paneer.jpg",
    "https://assets.epicurious.com/photos/5f89f0881e8871bc67707d54/4:3/w_580,h_435,c_limit/paneer.jpg",
    "https://assets.epicurious.com/photos/5f89f0881e8871bc67707d54/1:1/w_437,h_437,c_limit/paneer.jpg"
  ],
  "ingredients": [
    {
      "name": "quarts whole milk",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium saucepan, heat the milk to 195°F over medium heat. Using a wooden spoon, stir frequently during the heating process to prevent the milk from scalding. Be sure to scrape the bottom of the pan when you stir because this is where the milk is most prone to sticking. The milk will become foamy and bubbles will form on its surface once it reaches the desired temperature.",
    "Remove from the heat and stir in the lemon juice until evenly distributed, which will cause the separation of curds from the whey. The process should begin right away, but don’t fret if it takes a minute or two. Cover the pan and set aside at room temperature for 10 minutes to let the acid work its magic. Check the mixture at this point: It should be slightly yellow and the curds should have completely separated from the whey. Don’t panic if this hasn’t happened completely yet. Simply add another teaspoon of acid and set aside for a few minutes more. This should do the trick.",
    "Line a fine-mesh sieve with cheesecloth and set the sieve over a bowl. Ladle the curds and whey into the sieve. Reserve the whey for another use. Season the curds (still in the sieve) with salt, stirring it in using a wooden spoon, then gather up the edges of the cheesecloth into a tight bundle and squeeze the excess whey from the curds. Place the cheesecloth and curds on a large plate and shape them into a square. Wrap the cheesecloth edges around the paneer and place a second plate on top of it to compress it. Set aside at room temperature for 30 minutes. At this point the paneer is ready to use or it can be refrigerated in a covered container for up to 3 days."
  ],
  "notes": [],
  "nutrition_infos": []
}