{
  "name": "Lemon Meltaways",
  "categories": [],
  "servings": 40,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1019260-lemon-meltaways",
  "image_urls": [
    "https://static01.nyt.com/images/2018/08/10/dining/seneviratne-lemon-meltaways-horizontal/merlin_141910317_96dcd6a5-d3e3-44e5-86fc-548eb76d7cba-square640.jpg",
    "https://static01.nyt.com/images/2018/08/10/dining/seneviratne-lemon-meltaways-horizontal/merlin_141910317_96dcd6a5-d3e3-44e5-86fc-548eb76d7cba-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2018/08/10/dining/seneviratne-lemon-meltaways-horizontal/merlin_141910317_96dcd6a5-d3e3-44e5-86fc-548eb76d7cba-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "egg yolk",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "55 grams all-purpose flour",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/32 grams cornstarch",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Add butter, 1 1/4 cups/154 grams confectioners’ sugar, and lemon zest to the bowl of a stand mixer fitted with the paddle attachment. Mix on low speed until the sugar is moistened, then turn the mixer to medium-high and beat until light and fluffy, about 3 minutes. Scrape down the sides of the bowl, and add the lemon juice and egg yolk. Mix to combine.",
    "Reduce the speed to low, add the flour, cornstarch and salt, and mix until just combined.",
    "Divide the dough into 2 pieces and set each piece on a length of parchment paper or plastic wrap. Fold the paper over the sticky dough, and use your hands to form it into a cylinder about 1 1/2 inches wide. Roll the cylinder a few times to help shape it, but don’t worry if it isn’t perfect. Chill the dough until completely firm, at least 2 hours.",
    "When you are ready to bake, heat oven to 350 degrees, and line two baking sheets with parchment paper.",
    "Slice the dough into rounds just under 1/4-inch thick and arrange them at least 1-inch apart on the prepared baking sheets. Bake the cookies for 12 to 17 minutes, rotating the pans from top to bottom and front to back halfway though. The cookies should be golden around the edges, but not brown all of the way through.",
    "Set the pans on cooling racks and cool for a few minutes. Dust both sides of the warm cookies with the remaining 3/4 cup/92 grams confectioners’ sugar. Let the cookies cool completely, then store  at room temperature in an airtight container. Dust with additional confectioners’ sugar just before serving, if desired."
  ],
  "notes": [],
  "nutrition_infos": []
}