{
  "name": "Lemon Bars With Olive Oil and Sea Salt",
  "categories": [],
  "servings": 24,
  "minutes": 90,
  "source_url": "https://cooking.nytimes.com/recipes/1017141-lemon-bars-with-olive-oil-and-sea-salt",
  "image_urls": [
    "https://static01.nyt.com/images/2020/06/01/autossell/3/3-square640.jpg",
    "https://static01.nyt.com/images/2020/06/01/autossell/3/3-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/06/01/autossell/3/3-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/155 grams all-purpose flour",
      "amount": 1.25,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large eggs 3 yolks",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "teaspoons/5 grams cornstarch",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoons/57 grams butter",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/60 milliliters fruity extra-virgin olive oil",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 325 degrees and line a 9-by-9-inch baking pan with enough parchment to hang over two of the sides (to be used as handles later to lift the bars out of the pan).",
    "To make the shortbread base, pulse together the flour, granulated sugar, confectioners’ sugar, lemon zest and salt in a food processor, or whisk together in a large bowl. Add butter and pulse (or use two knives or your fingers) to cut the butter into the flour until a crumbly dough forms. Press dough into prepared pan and bake until shortbread is pale golden all over, 30 to 35 minutes.",
    "While the shortbread is baking, prepare the lemon curd: Grate 1/2 tablespoon zest from lemons and set aside. Squeeze lemons to yield 3/4 cup juice.",
    "In a small saucepan, whisk together lemon juice, sugar, eggs and yolks, cornstarch and fine sea salt over medium heat until boiling and thickened, 2 to 5 minutes. Make sure mixture comes to a boil and stays there for 30 seconds or so; you should see it thicken up before you take it off the heat. But once it boils do not cook for longer than 1 minute or you risk the curd thinning out again. Remove from heat and strain into a bowl. Whisk in butter, olive oil and lemon zest.",
    "When the shortbread is ready, take it out of the oven and carefully pour the lemon curd onto the shortbread base; return the pan to the oven. Bake until topping is just set, 10 to 15 minutes more. Allow to cool to room temperature, then refrigerate until cold before cutting into bars. Sprinkle with confectioners’ sugar and flaky sea salt right before serving."
  ],
  "notes": [],
  "nutrition_infos": []
}