{
  "name": "Lemon Cream Pie With Honey and Ginger",
  "categories": [],
  "servings": 8,
  "minutes": 340,
  "source_url": "https://cooking.nytimes.com/recipes/1024805-lemon-cream-pie-with-honey-and-ginger",
  "image_urls": [
    "https://static01.nyt.com/images/2023/11/09/multimedia/09piesrex4-lemon-cpjw/09piesrex4-lemon-cpjw-square640.jpg",
    "https://static01.nyt.com/images/2023/11/09/multimedia/09piesrex4-lemon-cpjw/09piesrex4-lemon-cpjw-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/11/09/multimedia/09piesrex4-lemon-cpjw/09piesrex4-lemon-cpjw-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ounces/170 grams wafer-style gingersnaps or graham crackers",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolk",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "-inch piece fresh ginger",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/28 grams cornstarch",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/400 milliliters heavy cream",
      "amount": 1.6666666666666665,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/80 milliliters honey",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/180 milliliters heavy cream",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 grams sour cream or crème fraîche",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Arrange an oven rack in the center position and heat oven to 350 degrees.",
    "Make the crust: In a food processor, pulse the cookies until you have fine crumbs (don’t overprocess or the crust mixture will be too wet). Transfer the crumbs to a medium bowl, then add the butter, sugar, yolk and salt. Stir with a fork to combine, then rub the mixture between your hands until it looks and feels like wet sand.",
    "Transfer just shy of half the mixture to a 9-inch pie plate, and push it outward to create an even ring along the perimeter. Use a straight-sided 1 cup dry measure to press the mixture firmly all the way up the sides. Scatter the remaining crumb mixture across the bottom of the pan and use the bottom of the cup to flatten into an even layer with no bare spots. Place pan on a baking sheet, and bake until crust is fragrant and the outer edge darkens in color, 13 to 15 minutes, then set aside to cool.",
    "Make the filling: Place a mesh strainer over a large, heatproof bowl and set aside. Combine the sugar, ginger, lemon zest and salt in a medium saucepan and work the mixture with your fingertips, bending and bruising the ginger and zest, until it resembles wet sand. Add the cornstarch and whisk to combine. Add the yolks and whisk to break them up, then whisk the mixture more vigorously, making sure there’s no unincorporated sugar at the sides. Continue to whisk until the mixture thickens, about 30 seconds, then whisk in the heavy cream, followed by the honey and the lemon juice. Make sure to work the whisk along the bottom of the pan to dissolve all of the sugar mixture, then set the pan over medium heat and cook, whisking constantly, until the mixture holds whisk marks and large bubbles form beneath the surface when you stop whisking for a few seconds, about 3 minutes. Immediately remove the pan from heat. Pour mixture into the strainer set over the bowl and use a spatula to press the pudding through, removing the solids.",
    "Whisk the vanilla into the still-hot pudding, then pour the pudding into the cooled crust and smooth the surface (discard solids). Press a piece of plastic wrap directly onto the surface and transfer the pie to the refrigerator. Chill until cold and set, at least 4 hours.",
    "Prepare the toppings: Heat oven to 350 degrees. Arrange lemon slices on a parchment-lined baking sheet, spacing them evenly. Drizzle a little bit of honey over each slice, then use your finger to rub the honey evenly across each slice. Bake slices until golden brown and caramelized in spots, 25 minutes. Set the baking sheet aside and let the slices cool completely. In a large bowl, combine the heavy cream and sour cream, and whisk, starting slowly and increasing intensity as the mixture thickens, until you have a light, voluminous whipped cream that forms medium peaks.",
    "Remove the pie from the refrigerator and uncover. Scrape the whipped cream onto the surface and spread in an even layer. Arrange the lemon slices over top, then drizzle the surface with more honey."
  ],
  "notes": [],
  "nutrition_infos": []
}