{
  "name": "Limoncello",
  "categories": [],
  "servings": 1,
  "minutes": null,
  "source_url": "https://cooking.nytimes.com/recipes/1024350-limoncello",
  "image_urls": [
    "https://static01.nyt.com/images/2023/10/04/multimedia/LH-Limoncello-gkhj/LH-Limoncello-gkhj-square640.jpg",
    "https://static01.nyt.com/images/2023/10/04/multimedia/LH-Limoncello-gkhj/LH-Limoncello-gkhj-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/10/04/multimedia/LH-Limoncello-gkhj/LH-Limoncello-gkhj-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "vodka",
      "amount": 1.0,
      "unit": "l",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Wash and dry the lemons. Use a vegetable peeler to peel the lemons, avoiding the white pith. Place the peels in a 2-quart jar or other large container with an airtight lid. Save the lemons for another use. ",
    "Add the vodka to the jar, close it and set aside at room temperature (away from direct sunlight) for at least 4 days or up to 1 month. (Most of the flavor will be extracted from the peels in the first week.)",
    "Pour the vodka through a strainer into a large bowl and discard the lemon peels. Using a small funnel or glass measuring cup, return the infused vodka to the jar, close and refrigerate. ",
    "While the vodka chills, make the simple syrup: Combine the sugar and 1 cup water in a medium saucepan. Bring to a simmer, stirring occasionally. Remove from the heat and stir to dissolve any remaining sugar. Cool completely.",
    "Stir the cooled simple syrup into the vodka and refrigerate until cold, at least 3 hours before serving. If you’d like an extra-chilled beverage, transfer the limoncello to the freezer for several hours before serving, then return it to the fridge afterwards. Serve in shot glasses or small liqueur glasses. Limoncello will keep for up to 1 year in the refrigerator. (It may freeze eventually if stored in the freezer long-term.)"
  ],
  "notes": [],
  "nutrition_infos": []
}