{
  "name": "Maple Breakfast Sausage",
  "categories": [],
  "servings": 4,
  "minutes": 45,
  "source_url": "https://cooking.nytimes.com/recipes/1019030-maple-breakfast-sausage",
  "image_urls": [
    "https://static01.nyt.com/images/2017/11/05/magazine/05eat1/05eat1-square640.jpg",
    "https://static01.nyt.com/images/2017/11/05/magazine/05eat1/05eat1-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/11/05/magazine/05eat1/05eat1-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "dried sage",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "/4tsp ground cori",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ground pork 20 to 25 percent fat by weight",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "/2 teaspoon maple syrup",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Line a baking sheet with parchment paper; set aside.",
    "Finely crumble the sage into a large bowl. Add salt, black pepper, nutmeg, coriander and cayenne to the sage, and stir to combine. Add pork and syrup to the spice mixture.",
    "Using your hands, mix thoroughly for 1 full minute, until the pork begins to appear tacky and sticks to the palm of your hand.",
    "Heat a cast-iron pan over medium heat. Use a heaping tablespoon of pork mixture to make a small, thin sausage patty. Add a teaspoon or so of olive oil to the pan. and cook the patty for 2 to 3 minutes on each side, or until cooked through. Taste, and if needed, add salt or any other seasonings to the uncooked sausage mixture, and mix to combine.",
    "Divide and form the remaining sausage into 8 2 1/2-inch patties, placing them on the prepared baking sheet as you go. Cover, and refrigerate for 30 minutes to allow the flavors to come together. (Patties can be made ahead and covered and refrigerated or frozen at this point until ready to use.)",
    "To cook, wipe out cast-iron pan, and return it to medium heat. Add 1 tablespoon olive oil. When it shimmers, add patties in a single layer, leaving space between them. Cook 3 to 4 minutes per side, or until browned on the surface and just cooked through.",
    "Drain sausages on paper towels. Serve hot."
  ],
  "notes": [],
  "nutrition_infos": []
}