{
  "name": "Paris-Brest",
  "categories": [],
  "servings": 8,
  "minutes": 180,
  "source_url": "https://cooking.nytimes.com/recipes/1023757-paris-brest",
  "image_urls": [
    "https://static01.nyt.com/images/2022/12/28/multimedia/27chouxrex-1-0132/27chouxrex-1-0132-square640.jpg",
    "https://static01.nyt.com/images/2022/12/28/multimedia/27chouxrex-1-0132/27chouxrex-1-0132-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2022/12/28/multimedia/27chouxrex-1-0132/27chouxrex-1-0132-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cups/142 grams whole hazelnuts",
      "amount": 1.25,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/60 grams smooth natural almond butter",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/360 milliliters whole milk",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/30 grams cornstarch",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "tablespoons/90 milliliters whole milk",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/100 grams all-purpose flour",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large eggs",
      "amount": 4.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fiber, total dietary",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Protein",
          "amount": 12.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 10.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 140.0,
          "unit": "KCAL",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total Sugars",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Calcium, Ca",
          "amount": 56.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Iron, Fe",
          "amount": 2.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 140.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Cholesterol",
          "amount": 370.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total trans",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total saturated",
          "amount": 3.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        }
      ]
    }
  ],
  "instructions": [
    "Toast the hazelnuts: Arrange an oven rack in the center position and heat the oven to 350 degrees. Scatter the hazelnuts across a rimmed baking sheet and toast, shaking the baking sheet once halfway through, until the hazelnuts are golden and fragrant, 10 to 12 minutes. Set aside to cool. ",
    "Once cooled, rub off and discard the skins. Measure out 1/4 cup hazelnuts and coarsely chop, then set aside for sprinkling over the ring of choux.",
    "Caramelize the hazelnuts: Line a large rimmed baking sheet with parchment paper and set aside. Fill a glass with water, place a pastry brush inside and set aside. Combine 1 cup/200 grams granulated sugar, 1/2 teaspoon salt and 1/4 cup/60 grams water in a small, heavy saucepan and stir gently with a heatproof spatula over medium-high heat just until sugar dissolves to form a clear syrup, about 3 minutes. Let the mixture come to a boil and use the wet pastry brush to brush down the sides of the saucepan and dissolve any stuck-on sugar crystals. Boil the mixture without stirring, occasionally swirling the saucepan gently and brushing down the sides of the saucepan if you see crystals forming, until the syrup becomes viscous and takes on a pale golden color and the bubbles become large, glassy and slow to pop (a sign that the water has boiled off and caramelization is near), about 5 minutes. Turn the heat down to medium and continue to cook, keeping a close watch and frequently swirling the saucepan, until the bubbling has mostly subsided and the mixture is very fluid and has turned a deep amber, about 4 minutes. Immediately remove the saucepan from the heat, add the 1 cup whole toasted hazelnuts and stir thoroughly with the spatula, scraping the bottom and sides, just until the nuts are coated. Working quickly before the caramel starts to harden, scrape the mixture out onto the lined baking sheet and spread the nuts in an even layer. Set the baking sheet aside and let the caramelized nuts cool completely. ",
    "Make the praline paste: Break up the cooled slab of caramelized hazelnuts into pieces, then transfer the pieces to a large resealable bag. Press out the air and seal the bag, then bash the pieces with a rolling pin until they’re broken into bits about the size of a pine nut. Transfer to a food processor along with the almond butter. Process the mixture, occasionally stopping to scrape down the sides, until you have a smooth, fluid paste with as little grit as possible, about 5 minutes. Scrape the paste into a lidded container, cover and set aside. ",
    "Make the pastry cream: Have a clean medium bowl at the ready. Combine the milk, vanilla seeds or paste, and remaining 1/2 teaspoon salt in a small, heavy saucepan (if using vanilla extract, you’ll add it later). Bring the mixture to a simmer over medium heat, whisking once or twice, then remove from the heat. ",
    "Combine the cornstarch and remaining 1/4 cup granulated sugar in a separate medium bowl and whisk to combine, then add the yolks and whisk vigorously until the mixture is very pale, light in texture and thick, about 2 minutes. (It will be very thick at first but will thin out as you work it.) ",
    "Whisking the yolk mixture constantly, slowly stream about half of the hot milk mixture into the bowl. Then, whisking constantly, stream the yolk mixture back into the remaining milk mixture in the saucepan. Set the saucepan over medium heat and cook, whisking constantly, until the foam has subsided and the pastry cream is thick like pudding and holds the marks of the whisk, about 2 minutes. Stop whisking for several seconds and check for slow bubbling beneath the surface, an indication that the pastry cream is at a boil. When you see bubbling, immediately remove the saucepan from the heat and scrape into the reserved bowl. (If you don’t see bubbling, continue whisking vigorously and pause to check every 20 seconds or so.) Whisk the chilled butter into the hot pastry cream a few pieces at a time until smooth. (If using vanilla extract, whisk it in.) Press a sheet of plastic wrap directly onto the surface of the pastry cream and refrigerate until it’s cold, at least 4 hours.",
    "Cook the dough for the pâte à choux: In a small saucepan, combine the milk, butter, granulated sugar, salt and 6 tablespoons/76 milliliters water and bring the mixture to a lively simmer over medium-low heat, stirring with a wooden spoon to melt the butter. Once you see active bubbling across the surface, add the flour all at once and stir slowly to incorporate, then stir more vigorously to bring together a soft dough. (A film will also form along the sides and bottom of the saucepan.) Continue to cook the dough over medium heat, using the spoon to smack it aggressively against the sides of the saucepan, until it’s shiny and holds together in a firm ball, 3 to 4 minutes. You want to make sure the dough has a chance to dry out and the flour loses its raw taste.",
    "Beat in the eggs: Scrape the dough into a medium bowl and set aside for about a minute to cool, stirring once or twice to help release steam. Add a couple of tablespoons of beaten eggs to the bowl with the dough and mix with the wooden spoon until the dough absorbs the egg and the mixture is thick but smooth. (The dough will lose its cohesiveness when you add the egg but will come back together with a bit of mixing.) Beat in the remaining eggs a couple of tablespoons at a time, waiting until the dough smooths out before adding more, until you’ve added all but about 3 tablespoons. Set aside the remaining egg for brushing over the choux. The dough will become glossier and looser after each addition. Take a look at the consistency — it should be thick, smooth and glossy, and when you let it fall off the spoon it should leave a v-shaped trail. (If it seems very thick, dribble in a little more beaten egg and stir, but make sure to leave about 2 tablespoons egg for brushing the choux.) Scrape the dough into a large pastry bag or resealable plastic bag. Twist or seal the bag to close, squeezing out as much air as possible, then set aside at room temperature to allow the dough to set up for 15 to 20 minutes. Snip a 1-inch-wide opening in the tip of the bag.",
    "Pipe the pâte à choux: Heat the oven to 425 degrees. Turn over a sheet pan and line the turned-up side with a piece of parchment paper. Trace a 9- or 10-inch circle (a smaller ring will puff more, while a larger one will lay flatter; use a dinner plate or cake pan as your guide) onto the parchment paper with a permanent marker, then turn the parchment over (dab a bit of the pâte à choux in the four corners of the pan underneath the parchment so it doesn’t slide around). Applying even pressure to the bag, pipe a ring of choux around the inside of the traced circle, overlapping the dough slightly where the ends meet. Pipe a second ring of dough inside the first so the two are touching, but starting and ending at a different point. Using all of the remaining dough, pipe a third ring over top of the first two, nestling it in between them and starting and ending at a third point. If you have any remaining pâte à choux, pipe it along the circle to fill in any thinner spots. Using a gentle scraping motion, drag the tines of a fork all along the dough to lightly score the surface and help blend the rings together (this will help it puff more evenly). Brush the entire surface of the dough with the reserved beaten egg, then sprinkle the reserved hazelnuts evenly over top. ",
    "Bake and cool: Bake the ring for 15 minutes, then reduce the oven temperature to 350 degrees and continue to bake until it’s puffed and deep golden brown, another 35 to 45 minutes. Avoid the temptation to open the door at this point: It’s important that the dough thoroughly dry out in the oven, or it will collapse, making it hard to fill. Turn off the oven, then open the door and use the tip of a paring knife to poke several holes in the top and side of the ring to allow steam to escape. Prop the door open with a wooden spoon and let the ring cool inside the oven for 1 hour, then remove it from the oven and let it cool completely. ",
    "Make the mousseline filling: In the bowl of a stand mixer fitted with the paddle attachment or in a large bowl using a hand mixer, beat 1 cup/225 grams of room temperature butter and 2/3 cup of the praline paste on medium speed, pausing once to scrape down the sides of the bowl, until the mixture is very smooth and creamy, about 1 minute. (Reserve the remaining praline for assembly.) Beating constantly on medium speed, add the chilled pastry cream to the bowl a couple of tablespoons at a time, waiting until the cream is incorporated before adding more. Once all the pastry cream is added, stop the mixer, scrape down the sides of the bowl, then continue to beat just until the mixture is very smooth and light, about 1 minute. Scrape the mousseline into a pastry bag fitted with a large open star tip, taking care not to form air pockets, then twist the bag to close and set aside. ",
    "Assemble the Paris-Brest: Use a serrated knife to slice evenly through the ring of pâte à choux horizontally, separating the taller portion of the ring from the base. Gently slide the upper ring off the base and onto a cutting board, then transfer the base to a serving platter. Spoon the reserved praline paste inside the base and spread it in an even layer, then pipe the mousseline in large rosettes inside the base, using it all and distributing evenly. Use a serrated knife to cut the upper ring into eighths, then use a fine-mesh strainer to dust the pieces with confectioners’ sugar. Place the pieces over the filling, reassembling them into a ring. ",
    "To serve the Paris-Brest, slice between the pieces of the upper ring and down through the filling and base. Transfer slices to plates and serve immediately. "
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fiber, total dietary",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Protein",
      "amount": 12.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 10.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 140.0,
      "unit": "KCAL",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total Sugars",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Calcium, Ca",
      "amount": 56.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Iron, Fe",
      "amount": 2.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 140.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Cholesterol",
      "amount": 370.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total trans",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total saturated",
      "amount": 3.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    }
  ]
}