{
  "name": "Perfect Hash Browns",
  "categories": [],
  "servings": 2,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1019209-perfect-hash-browns",
  "image_urls": [
    "https://static01.nyt.com/images/2019/02/20/dining/15COOKING-HASHBROWN3/15COOKING-HASHBROWN3-square640.jpg",
    "https://static01.nyt.com/images/2019/02/20/dining/15COOKING-HASHBROWN3/15COOKING-HASHBROWN3-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/02/20/dining/15COOKING-HASHBROWN3/15COOKING-HASHBROWN3-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "russet potatoes about 2 smallish-medium potatoes",
      "amount": 1.25,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "small yellow onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "bacon fat or vegetable oil",
      "amount": 3.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Grate potatoes on the largest hole on a box grater into a medium bowl. Cover with cold water and drain; repeat once or twice, until water runs nearly clear. Taking small handfuls at a time, squeeze all the water from the potatoes and place in a dry medium bowl. Grate onion on the largest hole on a box grater and toss with potatoes. Season with salt and pepper.",
    "Taking small handfuls at a time, squeeze all water from the potato-onion mixture. Heat 2 tablespoons reserved bacon fat or vegetable oil in skillet over medium heat, add 1 tablespoon butter and swirl together.",
    "Add potatoes and onions and spread into a thin, even layer. Cook, without moving, until the potatoes are nearly cooked through and browned on one side, about 5 to 8 minutes. Using a spatula, flip sections of the potatoes to crisp on the other side. Add 1 tablespoon reserved bacon fat or vegetable oil and remaining 1 tablespoon butter and cook, without moving, until potatoes are browned on the other side, about another 5 minutes. Flip once or twice more (you don’t have to be so careful here; just kind of stir them around) and continue to cook until most of the bits of potato are golden brown and crisped, about another 4 minutes.",
    "Transfer potatoes to a plate. Serve with hot sauce (or ketchup, if you wish)."
  ],
  "notes": [],
  "nutrition_infos": []
}