{
  "name": "Pistachio Macarons",
  "categories": [],
  "servings": 23,
  "minutes": null,
  "source_url": "https://cooking.nytimes.com/recipes/1024560-pistachio-macarons",
  "image_urls": [
    "https://static01.nyt.com/images/2023/08/25/multimedia/25MACARONSrex2-pistachio-lmfv/25MACARONSrex2-pistachio-lmfv-square640.jpg",
    "https://static01.nyt.com/images/2023/08/25/multimedia/25MACARONSrex2-pistachio-lmfv/25MACARONSrex2-pistachio-lmfv-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/08/25/multimedia/25MACARONSrex2-pistachio-lmfv/25MACARONSrex2-pistachio-lmfv-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "cup/57 grams raw shelled pistachios",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/28 grams superfine blanched almond flour",
      "amount": 2.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg whites 90 grams",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "almond extract",
      "amount": 2.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pistachio spread",
      "amount": 4.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Trace your guides and prepare the baking sheets: Using a permanent marker and a bottle cap or a 1 ¼-inch-wide ring cutter, trace 23 evenly spaced circles onto a 13-by-18-inch silicone baking mat or a piece of parchment paper. (Making 3 rows of 5, separated by 2 rows of 4, allows you to stagger the 23 circles.) Repeat with a second piece, then turn both upside down and place each on a flat, rimless baking sheet (or on an upside-down rimmed baking sheet).",
    "Grind and sift the dry ingredients: In the bowl of a food processor, combine the confectioners’ sugar, pistachios and almond flour; process until the pistachios are very finely ground, about 30 seconds. Transfer to a medium-mesh sieve set over a large bowl and shake to sift half of the mixture through. Return any bits caught in the sieve to the food processor, along with the second half of the mixture, sifted, and process again. Sift that mixture into the bowl, then grind and sift a third time if you have more than 1 tablespoon of larger pieces that don’t fall through the sieve. Discard any pieces that remain in the sieve.",
    "Make the meringue: Make sure the bowl of the stand mixer is grease-free. (To clean it, you can rub the inside with the cut side of a lemon wedge.) Combine the egg whites and salt in the bowl. Using the whisk attachment, beat the whites on medium-low speed until broken up and frothy, about 20 seconds. Increase speed to medium-high and add the granulated sugar in a slow, steady stream. Continue to beat until the meringue has a slightly matte sheen, starts to gather inside the whisk and forms very stiff peaks, 1 to 2 minutes. Once at the stiff peak stage, beat in the almond extract, then food coloring (if using), one drop at a time, until desired color is reached, scraping down the sides if needed.",
    "Macaronage: To the bowl with the meringue, add half of the sifted ingredients and use a large flexible spatula to fold them in, working the mixture vigorously and scraping thoroughly against the bottom and sides. Add the remaining sifted ingredients and fold, using the spatula to press the mixture against the side of the bowl and making sure there are no unincorporated pockets of meringue or dry ingredients around the sides or in the bottom. You want to deflate the egg whites to create a fluid — but not liquidy — batter, a process called macaronage.",
    "Continue to fold until the batter has lost about half its volume, is very smooth and glossy, and falls off the spatula in a steady stream, forming a ribbon that slowly oozes back onto the surface of the batter. Getting the texture right is critical, so try this test: Spoon about a teaspoon of the batter onto a plate — it should ooze slightly but hold a flat dome, and any peak should settle into the surface and disappear within 15 seconds. If it holds a peak, scrape the mixture back into the bowl and fold it a few more times, then repeat the test.",
    "Pipe the circles: Scrape the batter into a large piping bag fitted with a medium circle pastry tip. Twist the bag to close, then, holding the bag upright and hovering the tip about ½ inch over the surface of the parchment or baking mat in the center of a circle, apply steady pressure to the bag until the circle is filled. (The batter will continue to spread a bit.) As you lift the piping bag to move on to the next circle, make a rapid, tight circular motion to release the batter. When you have filled the first sheet of circles, firmly tap the baking sheet several times straight down on the towel-lined work surface to pop any large air bubbles, then set the first sheet aside. Pipe the remaining circles on the second sheet, then repeat the tapping motion. Use a toothpick to pop any remaining bubbles beneath the surfaces and fill in any pockmarks left by popped bubbles.",
    "Let the batter dry slightly: Let the baking sheets sit, uncovered, at room temperature until the surfaces are matte and a thin skin has formed, 45 minutes to 1 hour, though possibly much longer if you’re working in a humid environment. To test if the shells are ready, gently touch the test batter on the plate with your fingertip — if it feels nonsticky and slightly leathery to the touch, and it doesn't indent with light pressure applied, it’s ready.",
    "Bake and cool the shells: Arrange an oven rack in the center position and heat the oven to 275 degrees. Transfer one of the sheets to the middle rack of the oven and bake until the shells are dry on the surfaces, a ruffled foot has formed around the bases, and they stay put on the parchment or baking mat when you try to wiggle them, 16 to 22 minutes. (If you’re baking on silicone mats, the shells might take a minute or two longer, since silicone doesn’t conduct heat as well as parchment.) If you’re unsure if they’re done, bake the shells a minute or two longer, as underbaked shells might hollow out and dry shells will rehydrate during the aging process. Let the shells cool completely on the baking sheet, then carefully peel them away. In the meantime, bake and cool the second sheet. Set the shells aside, sorting them into pairs, matching up shells of similar size. If you want to bake the shells in advance, store them at room temperature in an airtight container up to 2 days.",
    "Make the filling: In a medium heatproof bowl, whisk the pistachio spread and heavy cream until smooth, then set aside. In the bowl of the stand mixer fitted with the paddle attachment or a hand-held mixer and a medium bowl, combine the butter, vanilla and salt, and beat on medium speed just until the butter is smooth and creamy, about 1 ½ minutes. With the mixer running, add the pistachio mixture, 1 tablespoon at a time, pausing between additions until the mixture is smooth. Continue to beat until the pistachio mixture is thick and light, scraping down the sides, about 20 seconds. If the filling seems a little loose and doesn't hold its shape, transfer to the refrigerator and chill for 10 to 15 minutes, stirring once or twice.",
    "Fill the macarons: Scrape the pistachio cream into a piping bag fitted with a medium round pastry tip and twist the bag to close. Pipe a generous teaspoon of ganache onto the flat sides of half of the cooled shells, then place the remaining shells on top to create little sandwiches, pressing on the shells gently to squeeze the filling to the edges. If the paste seems a bit loose, transfer to the refrigerator to chill a bit.",
    "Age the macarons: Chill the macarons briefly to set the ganache (15 to 20 minutes), then pack them into a lidded container, cover, and refrigerate until the shells are softened and yield to the filling, at least 24 hours. Serve chilled. The macarons will keep, covered and refrigerated, up to 1 week."
  ],
  "notes": [],
  "nutrition_infos": []
}