{
  "name": "Roscioli Roman Cacio e Pepe",
  "categories": [],
  "servings": 5,
  "minutes": 30,
  "source_url": "https://cooking.nytimes.com/recipes/1024332-roscioli-roman-cacio-e-pepe",
  "image_urls": [
    "https://static01.nyt.com/images/2023/07/03/multimedia/03ROSCIOLI-rex-mqpz/03ROSCIOLI-rex-mqpz-square640.jpg",
    "https://static01.nyt.com/images/2023/07/03/multimedia/03ROSCIOLI-rex-mqpz/03ROSCIOLI-rex-mqpz-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/07/03/multimedia/03ROSCIOLI-rex-mqpz/03ROSCIOLI-rex-mqpz-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ounces/4 1/4 cups finely grated pecorino romano",
      "amount": 7.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ounces/1 1/3 cups finely grated parmigiano-reggiano",
      "amount": 3.3333333333333335,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dried tonnarelli",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Bring a large pot of water to a boil. (Do not add salt.)",
    "Meanwhile, in a very large nonstick skillet or pot set over high heat, toast the peppercorns just until fragrant. Let cool, then grind or crush very coarsely. Reserve 1 teaspoon for serving.",
    "In the same skillet or pot, combine the cheeses and remaining pepper. Add 1 1/2 cups warm water and stir to make a thick pecorino cream.",
    "Add the pasta to the boiling water and stir. Keep the heat very high until the water returns to a boil, then stir again and adjust the heat as needed to keep the water bubbling. Set a timer for 8 minutes.",
    "Set the pecorino cream over very low heat. When the timer goes off, scoop out about 1/2 cup of the pasta cooking water and set aside. Taste the pasta and continue cooking until the pasta is done to your liking. Drain pasta very well (this is important, as adding too much hot water can cause the cheese to clump) and add to the pecorino cream.",
    "Use tongs or two forks to stir, turn and toss the pasta in the sauce over low heat until the cheese melts and the sauce becomes sticky. Don’t add any water yet, just keep tossing. To test, squeeze a drop of sauce between your thumb and finger. When the sauce is thick and forms strings like glue, it is ready. If it starts to dry out, add cooking water, 1 tablespoon at a time, and toss thoroughly before adding more.",
    "Divide among 4 bowls, twisting the pasta into a nest, if desired. Dust with additional pecorino and the reserved pepper. Serve immediately."
  ],
  "notes": [],
  "nutrition_infos": []
}