{
  "name": "Salted Chocolate Pudding With Whipped Sour Cream",
  "categories": [],
  "servings": 9,
  "minutes": 225,
  "source_url": "https://cooking.nytimes.com/recipes/1020708-salted-chocolate-pudding-with-whipped-sour-cream",
  "image_urls": [
    "https://static01.nyt.com/images/2019/12/18/dining/17Romanrex1/17Romanrex1-square640.jpg",
    "https://static01.nyt.com/images/2019/12/18/dining/17Romanrex1/merlin_162383169_7cfce32e-21c6-4be2-a4f7-65885e8381f8-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2019/12/18/dining/17Romanrex1/merlin_162383169_7cfce32e-21c6-4be2-a4f7-65885e8381f8-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ounces/225 grams bittersweet chocolate 65 to 70 percent",
      "amount": 8.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/720 milliliters heavy cream",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/720 milliliters whole milk",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "0 grams cocoa powder",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg yolks",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/45 grams cornstarch",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/720 milliliters heavy cream",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cups/720 milliliters sour cream",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ounces/340 grams thin wafer cookies",
      "amount": 12.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the pudding: Place chocolate in a large bowl; set aside.",
    "Heat heavy cream, milk, cocoa powder and 3/4 cup/150 grams granulated sugar in a medium pot over medium-high, whisking constantly until the mixture comes to a bare simmer, about 8 to 10 minutes. Remove from heat.",
    "In a large bowl, whisk together the remaining 3/4 cup/150 grams granulated sugar, the egg yolks, the cornstarch, the salt and the vanilla, if using, until the mixture is lump-free and pale in color. Ladle a bit of the hot cream mixture into the egg yolks and whisk until completely blended, adding a bit more at a time until half the cream mixture is added. Transfer the yolk-cream mixture back into the pot with the remaining cream mixture.",
    "Return the pot to medium heat and, whisking constantly, cook until the mixture has gone from thin and watery to thick and custardy, with the occasional bubble popping up, 3 to 5 minutes.",
    "Immediately pour the mixture over the chocolate, and let sit for a minute or two, giving the bowl a shake to help the chocolate settle as it melts. Using a whisk, mix the chocolate into the cream as it melts, until you have an ultrasmooth, silky pudding. Transfer to a flat baking dish (an 8-by-8-inch pan works well) and cover the top of the pudding with plastic wrap. Refrigerate until pudding is completely set, at least 3 hours and up to 48 hours.",
    "Assemble and serve: Using either an electric mixer on medium or a whisk and elbow grease, whisk heavy cream and confectioners’ sugar in a medium bowl until light and fluffy. (The cream should hold a gentle peak.) Whisk in sour cream. ",
    "To serve, spoon a bit of chocolate pudding into a serving vessel. This can be done in individual bowls, glasses, cups or coupes, or alternatively, one large bowl or baking dish — the choice is yours. Then spoon in an equal amount of whipped sour cream, and scatter with crumbled cookies. Repeat until the vessel is full, topping with flaky salt.",
    "Eat immediately, so the cookies stay crunchy, or store in the refrigerator for up to 3 days. "
  ],
  "notes": [],
  "nutrition_infos": []
}