{
  "name": "Spiced Maqluba With Tomatoes and Tahini Sauce",
  "categories": [],
  "servings": 4,
  "minutes": 90,
  "source_url": "https://cooking.nytimes.com/recipes/1019228-spiced-maqluba-with-tomatoes-and-tahini-sauce",
  "image_urls": [
    "https://static01.nyt.com/images/2018/03/21/dining/21ottorex1/21ottorex1-square640.jpg",
    "https://static01.nyt.com/images/2018/03/21/dining/21ottorex1/21ottorex1-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2018/03/21/dining/21ottorex1/merlin_135414834_3676ce27-d9dc-4ce0-b66d-07611b79e9c9-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "finely minced or pressed garlic",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cardamom pods",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ground turmeric",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Protein",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 0.0,
          "unit": "KCAL",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 0.0,
          "unit": "MG",
          "serving_size": 1.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "olive oil",
      "amount": 5.0,
      "unit": "ml",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pound/500 grams onions",
      "amount": 1.25,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "pounds/600 grams total",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a medium saucepan, combine lentils with 1 quart/1 liter cold water and 1 teaspoon salt. Bring to a simmer over medium-high heat. Simmer for 20 minutes, adjusting heat as necessary to keep temperature low, then stir in rice. Simmer for another 6 to 8 minutes, or until the lentils are cooked through. (The rice won’t be ready at this stage.)",
    "Drain very well. Stir in lemon zest, 1 tablespoon of the lemon juice, 1 1/2 teaspoons garlic, cardamom, allspice, turmeric, half of the parsley, plenty of pepper and 3/4 teaspoon salt. Mix to combine and set aside.",
    "Meanwhile, in a large nonstick frying pan, heat 3 tablespoons of oil over medium-high heat until it shimmers. Add onions, 3/4 teaspoon salt and plenty of pepper and cook, stirring, until soft and well browned, 8 to 10 minutes. Remove from the pan and set aside.",
    "Using olive oil, grease a 10-inch-/25-centimeter-wide saucepan with straight sides and a lid. Line the bottom with a round piece of parchment paper.",
    "In a bowl, toss tomatoes with the remaining 2 tablespoons of oil, 1/2 teaspoon salt and plenty of pepper and then arrange them flat on the bottom of the pan. (If using cherry tomatoes, lay the cut sides down.) Layer the cooked onions on top and then spoon the rice mixture over the onions, smoothing it down so the surface is flat. Using a skewer, poke about 6 holes in the rice and then sprinkle the surface with 2 tablespoons water. Place the pan over high heat for 5 minutes, then reduce heat to medium-low. Cover the pan with a clean tea towel followed by the lid and then cook for 15 minutes, until rice is barely cooked. (Take care that the towel edges are held safely over the lid so they don’t catch fire!) Check after 10 minutes to make sure the pan is not dry; add a little water if needed.",
    "Set pan aside for at least 20 minutes (with the lid and tea towel left on); residual heat will finish the cooking.",
    "While rice rests, make tahini sauce: In a bowl, combine tahini with the remaining 1/2 teaspoon of garlic, remaining 1 1/2 tablespoons of lemon juice, 1/8 teaspoon of salt and 1/3 cup/90 milliliters of water. Whisk until smooth and creamy and set aside.",
    "When ready to serve, remove the lid and tea towel and then cover the top of the pan with a large platter. With one hand on the pan and the other holding the platter, invert the dish so that the top of the rice is now the base of the maqluba on the platter (like unmolding an upside-down cake). Tap the bottom of the pan a few times to help the tomatoes ease off the bottom. Peel off and discard the paper.",
    "Serve hot, with shallots and remaining parsley sprinkled on top. Pass tahini sauce at the table."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Protein",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 0.0,
      "unit": "KCAL",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 0.0,
      "unit": "MG",
      "serving_size": 1.0,
      "serving_size_unit": "g"
    }
  ]
}