{
  "name": "Stone Fruit Jam",
  "categories": [],
  "servings": 4,
  "minutes": 75,
  "source_url": "https://cooking.nytimes.com/recipes/1018846-stone-fruit-jam",
  "image_urls": [
    "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE2/07JAMGUIDE2-square640.jpg",
    "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE2/07JAMGUIDE2-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2017/08/07/dining/07JAMGUIDE2/07JAMGUIDE2-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "pounds/2 kilograms peaches",
      "amount": 4.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Toss fruit and sugar together in a large, heavy-bottomed pot. Let sit for at least 15 minutes or up to overnight, tossing periodically to coat and to dissolve the sugar. (This will help coax the juices out of the fruit.)",
    "Place a small plate in the refrigerator to chill. (You’ll use this later.)",
    "Bring the fruit to a strong simmer over medium heat until the skins burst and the juices start to boil, 10 to 15 minutes. If using a vanilla bean as an add-in, put it in the pot now.",
    "Increase the heat to medium–high. Cook the jam, stirring occasionally with a wooden spoon or spatula at first and more frequently as juices thicken until most of the liquid has evaporated and the fruit has begun to break down, about 25 to 35 minutes. How much it breaks down will depend on the type of fruit and how ripe it is. (For example, peaches are likely to retain their shape, while plums and apricots will break down almost entirely.)",
    "As the jam cooks, the liquid reduces, the sugars thicken and the natural pectins activate. You’ll notice the liquid go from a rapid, rolling boil with smaller bubbles to a slow, thick, tarlike boil with larger bubbles. This is the stage at which it’s most important to stir constantly along the bottom of the pot to prevent scorching and sticking. (Sugar is heavier than water and will concentrate there, increasing the chance that the fruit will burn.)  It’s also the stage at which splattering may occur, so take care in stirring.",
    "When the jam reaches a slow, thick boil, add lemon juice and any of the add-ins (see note). Continue to cook, stirring constantly until the jam has returned to its previously thickened state, about another 5 minutes. To test the consistency, spoon a bit of jam onto the chilled plate, return it to the refrigerator and chill for 2 minutes. Drag your finger through it: It should hold its shape on either side without appearing watery or runny. If it’s not there yet, cook it a few minutes more.",
    "Remove from heat, and pick out vanilla bean, if you added it earlier. Divide between jars, leaving 1/4 inch of space at the top of the jar, and seal immediately. Can the jams (see our <a href=\"https://cooking.nytimes.com/guides/45-how-to-make-jam\">How to Make Jam</a> guide for more instruction), or store in the refrigerator, using them up within a couple of weeks."
  ],
  "notes": [],
  "nutrition_infos": []
}