{
  "name": "Strawberry Cream Cheese Tart",
  "categories": [],
  "servings": 7,
  "minutes": 75,
  "source_url": "https://cooking.nytimes.com/recipes/1024217-strawberry-cream-cheese-tart",
  "image_urls": [
    "https://static01.nyt.com/images/2023/05/24/multimedia/24apperex2-galette-lfwz/24apperex2-galette-lfwz-square640.jpg",
    "https://static01.nyt.com/images/2023/05/24/multimedia/24apperex2-galette-lfwz/24apperex2-galette-lfwz-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/05/24/multimedia/24apperex2-galette-lfwz/24apperex2-galette-lfwz-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "fresh strawberries",
      "amount": 1.5,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/4 ounces cream cheese",
      "amount": 1.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "egg yolk",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "- to 18-ounce package puff pastry",
      "amount": 7.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 425 degrees. In a medium saucepan, combine strawberries, sugar and salt. Let mixture sit for 20 minutes, tossing once or twice, until the berries get a little juicy. Turn the heat to medium and cook, stirring occasionally, until they are just beginning to soften and the sugar dissolves, about 5 minutes.",
    "Using a slotted spoon, transfer berries to a plate to cool. Bring the syrup back to a simmer and let it cook until it reduces by half, 3 to 7 minutes.",
    "In a medium bowl, use a fork or a wooden spoon to mash together the cream cheese, egg yolk, sugar, lemon juice and zest, vanilla and salt until smooth. (It’s OK if there are a few small lumps of cream cheese.)",
    "On a lightly floured surface, roll puff pastry into a 13-by-11-inch rectangle about 1/8-inch thick. Transfer the dough to a parchment-lined baking pan. With a sharp knife, score a 1-inch border along the edges of the puff pastry (don’t cut all the way through).",
    "Spread the cream cheese mixture evenly inside the scored border. Arrange the strawberries on top in a single layer. (If they don’t all fit nicely, save the remaining berries for snacking.)",
    "Bake until the pastry is puffed and golden, 22 to 30 minutes. Transfer pan to a wire rack to cool for at least 20 minutes or up to 8 hours before serving. Right before serving, gently brush some of the reduced syrup over the fruit and crust to add shine and more strawberry flavor. If you like, you can serve the remaining syrup as a sauce drizzled on top of the tart, or save it to use in seltzer or serve over yogurt or ice cream."
  ],
  "notes": [],
  "nutrition_infos": []
}