{
  "name": "Strawberry Almond Cakes",
  "categories": [],
  "servings": 12,
  "minutes": 80,
  "source_url": "https://cooking.nytimes.com/recipes/1024216-strawberry-almond-cakes",
  "image_urls": [
    "https://static01.nyt.com/images/2023/05/24/multimedia/24apperex1-cakes-zklb/24apperex1-cakes-zklb-square640.jpg",
    "https://static01.nyt.com/images/2023/05/24/multimedia/24apperex1-cakes-zklb/24apperex1-cakes-zklb-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2023/05/24/multimedia/24apperex1-cakes-zklb/24apperex1-cakes-zklb-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "ounces/200 grams fresh strawberries",
      "amount": 7.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "00 grams almond flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/90 grams all-purpose flour",
      "amount": 3.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large egg whites",
      "amount": 5.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Heat oven to 400 degrees. In a small bowl, mix strawberries with 1 tablespoon of granulated sugar and transfer to a parchment-lined baking sheet. Roast until the strawberries have released a bit of juice and are just tender, 10 to 15 minutes. Set aside to cool.",
    "In a small saucepan, melt butter, letting it cook until it turns nut brown and smells toasted, about 5 minutes. Pour into a heatproof bowl and let cool. (Do not scrape up any black bits from the bottom of the pot.)",
    "Meanwhile, in a large bowl, combine sugar, almond flour, all-purpose flour and salt. Using an electric mixer fitted with the whisk attachment and set on low speed (or use a whisk and a strong arm), beat in egg whites until the flour mixture is damp. Add butter and beat on medium-high speed (or vigorously by hand) until very smooth, about 2 minutes. Beat in vanilla. At this point, the batter can be used immediately or refrigerated for up to 4 days without the strawberries.",
    "Right before baking, drain the roasted strawberries from their liquid and blot on a paper towel or clean cloth. Fold the roasted strawberries into the batter. (You may have about 1 to 2 tablespoons of strawberry syrup left to add to yogurt or seltzer.)",
    "Butter 12 (1/2-cup) muffin cups and coat all over with a little granulated sugar. Divide batter across the cups, and bake until financiers are golden brown and the tops spring back when lightly pressed, 15 to 25 minutes. Cool on a wire rack before unmolding."
  ],
  "notes": [],
  "nutrition_infos": []
}