{
  "name": "Tamales de Frijol (Oaxacan Black Bean Tamales)",
  "categories": [],
  "servings": 30,
  "minutes": 300,
  "source_url": "https://cooking.nytimes.com/recipes/1021730-tamales-de-frijol-oaxacan-black-bean-tamales",
  "image_urls": [
    "https://static01.nyt.com/images/2020/12/23/dining/18Tamalesrex1-blackbean/18Tamalesrex1-blackbean-square640.jpg",
    "https://static01.nyt.com/images/2020/12/23/dining/18Tamalesrex1-blackbean/18Tamalesrex1-blackbean-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2020/12/23/dining/18Tamalesrex1-blackbean/18Tamalesrex1-blackbean-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "dried black beans",
      "amount": 1.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large white onion",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "garlic head",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "olive oil",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "fresh masa for tortillas 12 cups; see tips",
      "amount": 6.0,
      "unit": "lb",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Make the filling: In a large bowl, cover the beans with cold water by about 2 inches and soak overnight. The next day, drain the beans and transfer to a large pot. Add the onion, garlic, avocado leaves, salt and enough cold water to cover by 2 inches. Bring to a boil over high heat, then reduce the heat to maintain a simmer. Cook, skimming any foam, until the beans are very tender, 1 1/2 to 2 hours.",
    "Cool for 15 minutes, then set a large strainer over a large bowl and drain. Transfer the beans, onion, garlic and 1 cup cooking liquid to a blender or food processor. Blend, adding more liquid as needed to get the machine going and to form an almost smooth puree. The consistency should be soft and spreadable, but not soupy. Season to taste with salt and cool to room temperature. Discard the avocado leaves and any remaining cooking liquid.",
    "While the beans cool, prepare for tamales: Heat the oil in a small saucepan until just smoking, then remove from the heat and set aside to cool completely. If you don’t have plastic rounds for a tortilla press, cut off the edges of a gallon-sized resealable plastic bag to form two 10-inch squares of plastic. If you don’t have a press, get out a heavy flat-bottomed large skillet.",
    "Heat a banana leaf on a griddle or large flat pan over high heat, turning and pressing flat until pliable and shiny, 15 to 30 seconds. Transfer to a work surface. Repeat with the remaining leaves, stacking them to keep them all warm and soft.",
    "In a large bowl, tear the masa into smaller chunks then add the salt and gradually add the cooled oil while kneading in. Continue kneading with both hands by punching down the mixture, then squeezing it between your fingers before gathering it into a mass and pushing it back down. Knead until the oil isn’t visible and the masa is very smooth and soft.",
    "Assemble the tamales: Roll a 1/3 cup masa into a ball and flatten between the plastic by hand into a 1-inch-thick disk. Press in a tortilla press or against the counter using a skillet to form a tortilla-thin round (scant 1/8-inch-thick). Peel off the top plastic, keeping the masa on the bottom piece. Spread the bean filling evenly over the masa’s entire surface in a thin layer (about 3 tablespoons). Using the plastic, lift the left edge and fold an inch in towards the center, then peel back the plastic and flatten it against the counter. Repeat on the right. Spread filling over the folded edges (about 1 teaspoon per side). Using the plastic, lift up the bottom third and fold it over the center as if folding a letter. Cover with filling (about 1 teaspoon), then use the plastic to lift the top and fold it over to enclose. Center an avocado leaf on top. Place the tamal upside down on a soft banana leaf and place another avocado leaf on top. Trim the leaves to fit if needed. Wrap in the banana leaf, folding in one long side, then the bottom, then the other side and rolling to enclose the end. Repeat with the remaining ingredients.",
    "Fit a steamer or colander into a large, deep pot and add enough water to almost reach its bottom. Stack the tamales flat in the steamer, leaving an empty space in the center. Cover with the reserved remaining banana leaves and then the lid. Bring the water to a boil and steam, replenishing with hot water as needed, until the masa is cooked through, about 1 1/2 hours. To test, unwrap a tamal and cut through the center to make sure there’s no raw masa.",
    "Keep warm in the steamer off the heat until ready to serve. After unwrapping, the avocado leaves should be discarded before eating. The tamales can be cooled completely, then wrapped individually and frozen for up to 6 months. To serve, thaw overnight in the refrigerator, then resteam in the banana leaves or unwrap and pan-fry in oil until hot and crisp."
  ],
  "notes": [],
  "nutrition_infos": []
}