{
  "name": "Tart Lemon Pie",
  "categories": [],
  "servings": 9,
  "minutes": 90,
  "source_url": "https://cooking.nytimes.com/recipes/1019716-tart-lemon-pie",
  "image_urls": [
    "https://static01.nyt.com/images/2018/11/11/dining/11Tart-lemon-pie/11Tart-lemon-pie-square640.jpg",
    "https://static01.nyt.com/images/2018/11/11/dining/11Tart-lemon-pie/11Tart-lemon-pie-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2018/11/11/dining/11Tart-lemon-pie/11Tart-lemon-pie-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "<a href=\"https: /cooking.nytimes.com/recipes/1019713-perfect-pie-crust\">perfect pie crust",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "egg wash 1 large egg mixed with 1 tablespoon water",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "cup/45 grams cornstarch",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "large eggs",
      "amount": 2.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": [
        {
          "name": "Carbohydrate, by difference",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fiber, total dietary",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Protein",
          "amount": 12.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total lipid (fat)",
          "amount": 10.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Energy",
          "amount": 140.0,
          "unit": "KCAL",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Total Sugars",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Calcium, Ca",
          "amount": 56.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Iron, Fe",
          "amount": 2.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Sodium, Na",
          "amount": 140.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Cholesterol",
          "amount": 370.0,
          "unit": "MG",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total trans",
          "amount": 0.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        },
        {
          "name": "Fatty acids, total saturated",
          "amount": 3.0,
          "unit": "G",
          "serving_size": 50.0,
          "serving_size_unit": "g"
        }
      ]
    },
    {
      "name": "large egg yolks",
      "amount": 6.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "whipped cream",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "On a lightly floured surface and using a lightly floured rolling pin, roll out a disk of dough into a circle about ¼-inch thick. Starting at one end, gently roll up the dough onto the rolling pin. Unfurl the dough over a 9-inch pie plate, preferably ceramic, and press it in lightly, making sure it’s lining the plate.",
    "Trim so that there’s about ½ inch of excess dough hanging over the edge of the pie plate. (If the dough feels warm, refrigerate it for 15 minutes.) Tuck the excess dough under itself so it is flush with the edge of the pie plate; leave the pie like this for a straight-edge finish, or crimp as desired. Dock the base and sides all over with a fork and refrigerate at least 30 minutes, and up to 2 hours.",
    "Roll out the second disk of dough to ¼-inch thickness. Cut out several small triangles (or other shapes from the dough); do as many as you like, and as many as a few dozen for a more intricate design. You can cut them freehand, trace a stencil using a paring knife or use a small cookie cutter. Transfer the shapes to a baking sheet lined with parchment and chill at least 30 minutes.",
    "Place a rack on the bottom shelf of the oven, and place a baking stone, if you have one, on the rack. Heat the oven to 425 degrees. Use a small brush to evenly paint egg wash on the edge of the crust. Cut a square of parchment paper and use it to line the crust. Fill with pie weights (or dried beans) up to the top edge. Place the plate on a baking sheet lined with parchment or foil.",
    "Transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake until the outer edge is beginning to become golden brown, 17 to 20 minutes. Remove the parchment and pie weights. If the dough puffs up anywhere, you can puncture it with a fork. Continue to bake until the base is baked through and the outer edge is deeply brown, 12 to 15 minutes more. Cool the crust completely.",
    "Egg wash the top of the triangle cutouts. Transfer to the oven on the middle rack and bake until they are evenly golden brown, 12 to 15 minutes. Cool completely.",
    "When the crust is cool, make the filling: In a medium pot, whisk the lemon juice, lemon zest and ½ cup/120 milliliters water to combine. In a medium bowl, whisk the sugar, cornstarch and salt to combine. Whisk this mixture into the pot and then place it over medium-high heat, stirring occasionally, until the mixture comes to a simmer. Reduce the heat to medium and cook at a simmer, stirring occasionally, for 2 minutes.",
    "In a medium, heatproof bowl, lightly whisk the whole eggs and egg yolks. When the lemon mixture has come to a simmer, gradually add about ¼ of the hot liquid to the egg yolks in a slow, steady stream while whisking constantly to combine.",
    "Whisk the egg yolk mixture back into the pot, and switch to a heatproof spatula. Reduce the heat to medium-low and continue to cook, stirring constantly, until the mixture thickens, about 5 to 7 minutes. It should come to a boil — not small bubbles around the outer edge, but fat bubbles from the center of the pot. (You should also see a distinct line that quickly closes in on itself if you drag your spatula through the curd.) Remove the pot from the heat and stir in the butter, a few cubes at a time. Mix thoroughly to combine.",
    "Strain the lemon curd through a fine mesh sieve into the cooled pie crust, and spread into an even layer. Place plastic wrap directly over the surface when the pie is still hot and chill until the curd is set, at least 3 to 4 hours and up to overnight.",
    "If you like, create an optional spiral on the surface of the pie once the curd is fully cool: Transfer the pie to a cake turntable. If the surface looks uneven, smooth it with a small offset spatula. Then place the spatula in the center of the curd at a 45-degree angle, and begin to rotate the turntable while you gently move the spatula towards the outer edge. Move steadily and not too slowly.",
    "Keep the pie chilled until ready to serve. Just before serving, arrange the cutouts on the surface of the pie in 6 diagonal lines. If you like, alternate the points of the triangles on each line to create a more graphic effect. Serve with whipped cream, if desired. Store leftovers in the refrigerator wrapped tightly in plastic wrap."
  ],
  "notes": [],
  "nutrition_infos": [
    {
      "name": "Carbohydrate, by difference",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fiber, total dietary",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Protein",
      "amount": 12.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total lipid (fat)",
      "amount": 10.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Energy",
      "amount": 140.0,
      "unit": "KCAL",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Total Sugars",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Calcium, Ca",
      "amount": 56.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Iron, Fe",
      "amount": 2.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Sodium, Na",
      "amount": 140.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Cholesterol",
      "amount": 370.0,
      "unit": "MG",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total trans",
      "amount": 0.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    },
    {
      "name": "Fatty acids, total saturated",
      "amount": 3.0,
      "unit": "G",
      "serving_size": 50.0,
      "serving_size_unit": "g"
    }
  ]
}