{
  "name": "Torticas de Morón",
  "categories": [],
  "servings": 2,
  "minutes": 50,
  "source_url": "https://cooking.nytimes.com/recipes/1022672-torticas-de-moron",
  "image_urls": [
    "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX18-TORTICAS/01COOKIESREX18-TORTICAS-square640.jpg",
    "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX18-TORTICAS/01COOKIESREX18-TORTICAS-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2021/12/08/dining/08COOKIESREX18-TORTICAS/merlin_198248679_4d1feb95-5d07-4044-9802-9b9a3f539782-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "85 grams vegetable shortening",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "85 grams all-purpose flour",
      "amount": 3.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "In a large bowl and using a wooden spoon, combine the shortening and the sugar until well incorporated. Add the vanilla extract, and stir until combined. Add the lime zest and stir until incorporated.",
    "Gradually add the flour and salt in three batches, using your hands to mix and press the ingredients together between each addition, until all the flour is absorbed and the mixture forms a cohesive dough. If the dough doesn't come together, mix in a splash of lime juice or water.",
    "Heat oven to 325 degrees. Clear off part of your work surface, and lay down a 2-foot-long piece of plastic wrap.",
    "Transfer the dough to the center of the plastic wrap, and form the dough into a log that is 2 inches in diameter. (Use the long sides of the plastic wrap to help you roll and form. This may be tricky, but just keep squishing and rolling the dough until it all comes together.) Wrap the dough tightly in the plastic wrap so you have a compact, circular log, and let rest at room temperature for 15 minutes.",
    "Uncover the dough and, using a sharp knife, cut into ½-inch slices. (If the slices crumble, feel free to push them back together, or to use your fingers to smooth out any rough edges so that they’re more round.) Place the slices on a nonstick baking sheet or a rimmed baking sheet covered in parchment paper, and bake until firm at the center and light golden brown on the bottom, 20 to 25 minutes. Let cool completely, and serve. Store in an airtight container at room temperature for up to a week."
  ],
  "notes": [],
  "nutrition_infos": []
}