{
  "name": "Two-Tone Ginger Custard Pie",
  "categories": [],
  "servings": 9,
  "minutes": 120,
  "source_url": "https://cooking.nytimes.com/recipes/1019717-two-tone-ginger-custard-pie",
  "image_urls": [
    "https://static01.nyt.com/images/2018/11/14/dining/14Two-tone-ginger-custard-pie/14Two-tone-ginger-custard-pie-square640.jpg",
    "https://static01.nyt.com/images/2018/11/14/dining/14Two-tone-ginger-custard-pie/14Two-tone-ginger-custard-pie-videoSixteenByNineJumbo1600.jpg",
    "https://static01.nyt.com/images/2018/11/14/dining/14Two-tone-ginger-custard-pie/14Two-tone-ginger-custard-pie-superJumbo.jpg"
  ],
  "ingredients": [
    {
      "name": "<a href=\"https: /cooking.nytimes.com/recipes/1019713-perfect-pie-crust\">perfect pie crust",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "30 grams all-purpose flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ground ginger",
      "amount": 1.0,
      "unit": "tbsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "ground clove",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "20 milliliters whole milk",
      "amount": 2.6666666666666665,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "240 milliliters heavy cream",
      "amount": 1.0,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "egg wash 1 large egg mixed with 1 tablespoon water",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "28 grams freeze-dried mango",
      "amount": 1.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "28 grams freeze-dried strawberries",
      "amount": 1.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "On a lightly floured surface and using a lightly floured rolling pin, roll out a disk of dough into a circle about ¼-inch thick. Starting at one end, gently roll up the dough onto the rolling pin. Unfurl the dough over a 9-inch pie plate, preferably ceramic, and press it in lightly, making sure it’s lining the plate.",
    "Trim so that there’s about ½ inch of excess dough hanging over the edge of the pie plate. (If the dough feels warm, refrigerate it for 15 minutes.) Tuck the excess dough under itself so it is flush with the edge of the pie plate; leave the pie like this for a straight-edge finish, or crimp as desired. Dock the base and sides all over with a fork and refrigerate at least 30 minutes, and up to 2 hours.",
    "Place a rack on the bottom shelf of the oven, and place a baking stone, if you have one, on the rack. Heat the oven to 425 degrees. Use a small brush to evenly paint egg wash on the edge of the crust. Cut a square of parchment paper and use it to line the crust. Fill with pie weights (or dried beans) up to the top edge. Place the plate on a baking sheet lined with parchment or foil.",
    "Transfer the baking sheet to the oven, placing it directly on the baking stone if using. Bake crust until the outer edge is just starting to turn golden brown, 12 to 15 minutes. Remove the parchment and pie weights, and continue to bake until the base appears set, 2 to 4 minutes more. If the dough puffs up anywhere, you can puncture it with a fork. Cool the crust completely. Reduce the oven temperature to 375 degrees.",
    "Make the filling: Whisk the granulated sugar and flour in a medium bowl to combine. Add the brown sugar and whisk to combine, breaking up clumps with the whisk or your fingers. Add the ginger, nutmeg, cinnamon, clove and salt and whisk to combine.",
    "Add the milk, cream and vanilla and whisk well to combine. Transfer the pie plate to the prepared baking sheet. Pour the custard into the crust.",
    "Transfer the baking sheet back to the oven, placing it directly on the baking stone if using. Bake until the crust is evenly golden brown and the custard appears set around the outer edge, 43 to 48 minutes; the center of the pie may still be jiggly, like pumpkin pie or cheesecake, but it will firm up as it cools. Let pie cool completely at room temperature on a rack.",
    "Make the topping: Use a food processor to grind the freeze-dried mango into a fine powder, or seal it in a plastic bag and crush with a rolling pin. Transfer to a small bowl, and whisk in 2 tablespoons of confectioners’ sugar. Wipe out the food processor or use another plastic bag and repeat with the freeze-dried strawberries. Transfer to a small bowl, and whisk in the remaining 2 tablespoons powdered sugar.",
    "Place an 8 ½-by-11-inch piece of paper over the surface of the pie, leaving half of it exposed. Use a small sifter to sift the mango sugar onto the exposed surface of the pie. Carefully remove the paper, then cover the part of the pie sprinkled with mango sugar. Tap out the small sifter and use it to sift the strawberry sugar over the other side. Carefully remove the paper. If you like, brush any excess powder off the crust. (Save the remaining sugar in airtight containers for another use, such as dusting on baked goods.) It’s best to apply the sugar within 2 hours of serving. The pie is best eaten the day it’s made; store leftovers in the refrigerator."
  ],
  "notes": [],
  "nutrition_infos": []
}