{
  "name": "Vanilla No-Bake Cheesecake With a Chocolate Cookie Crust",
  "categories": [],
  "servings": null,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/no-bake-cheesecake-5909ebd34321d935776c6ac5",
  "image_urls": [
    "https://assets.epicurious.com/photos/6283a77ad9d9bf0898dcb6e7/16:9/w_5671,h_3190,c_limit/NoBakeCheesecake_RECIPE_051222_33796.jpg",
    "https://assets.epicurious.com/photos/6283a77ad9d9bf0898dcb6e7/4:3/w_4580,h_3435,c_limit/NoBakeCheesecake_RECIPE_051222_33796.jpg",
    "https://assets.epicurious.com/photos/6283a77ad9d9bf0898dcb6e7/1:1/w_4036,h_4036,c_limit/NoBakeCheesecake_RECIPE_051222_33796.jpg"
  ],
  "ingredients": [
    {
      "name": "oz. 255 g crispy chocolate cookies",
      "amount": 9.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 1.5,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "oz. 453 g cream cheese",
      "amount": 16.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "one 14-oz. can 397 g sweetened condensed milk",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "vanilla extract",
      "amount": 2.0,
      "unit": "tsp",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "dutch-process cocoa powder for dusting",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Grease a 9\" springform pan with cooking spray or softened butter. Line the bottom and sides with parchment paper.",
    "To make the crust, process the cookies, sugar, and salt in the bowl of a food processor until the cookies are finely ground. Pour in the butter and vanilla and process until the mixture holds together when squeezed. Alternatively, you may place the dry ingredients in a sealed resealable plastic bag, cover it with a tea towel, and crush the crackers with a rolling pin. Transfer the crumbs to a medium bowl and stir in the melted butter and vanilla. Scrape the crust mixture into the prepared pan and firmly press it into the bottom and 1\" up the sides, using your fingers. Place the crust in the freezer while you make the filling.",
    "To make the filling, briefly beat the cream cheese on medium-low speed in the bowl of a stand mixer fitted with the paddle attachment, just until smooth, scraping the bowl with a flexible spatula as needed. Beat in the sweetened condensed milk and salt just until combined, and then the lemon juice and vanilla. Turn off the mixer as soon as all the ingredients are incorporated. Do not overmix or the cream cheese will lose structure. Scrape the filling into the prepared crust, smoothing the top with an offset spatula or butter knife. Cover the cheesecake with plastic wrap and refrigerate it for at least 5 hours, but preferably overnight.",
    "When ready to serve, remove the sides of the pan and, if you would like to remove the base (though you don’t have to), slide a long, serrated knife between the crust and the parchment paper and transfer the cake to a serving plate. Slice the cake with a large chef’s knife that’s been dipped in hot water and dried in between slices. Serve with a dusting of cocoa powder (if using). Keep the cake, wrapped, in the refrigerator for up to 3 days."
  ],
  "notes": [],
  "nutrition_infos": []
}