{
  "name": "Vegan Pie and Pastry Dough",
  "categories": [],
  "servings": 1,
  "minutes": null,
  "source_url": "https://www.epicurious.com/recipes/member/views/betty-crocker-oil-pastry-52967951",
  "image_urls": [
    "https://assets.epicurious.com/photos/616dbb83608ae85d5f93ca25/16:9/w_1199,h_674,c_limit/vegan-pastry-dough-pie-for-everyone-101821.jpg",
    "https://assets.epicurious.com/photos/616dbb83608ae85d5f93ca25/4:3/w_1079,h_809,c_limit/vegan-pastry-dough-pie-for-everyone-101821.jpg",
    "https://assets.epicurious.com/photos/616dbb83608ae85d5f93ca25/1:1/w_792,h_792,c_limit/vegan-pastry-dough-pie-for-everyone-101821.jpg"
  ],
  "ingredients": [
    {
      "name": "2 tablespoons 90 ml boiling water",
      "amount": 2.5,
      "unit": "cup",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "loosely filled cups 250 g pastry flour",
      "amount": 12.5,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "200 g room-temperature solid refined coconut oil",
      "amount": 7.0,
      "unit": "oz",
      "comment": "",
      "nutrition_infos": []
    },
    {
      "name": "extra flour",
      "amount": 1.0,
      "unit": "",
      "comment": "",
      "nutrition_infos": []
    }
  ],
  "instructions": [
    "Stir the sugar, salt, and water together in a small bowl until the sugar and salt are fully dissolved. Place the bowl in the freezer—the liquid needs to be ice cold before it is added to the dough.",
    "Put the flour in a large bowl and dump the coconut oil into the flour. Toss to coat the pieces of fat in the flour. Working quickly, use your thumbs and index fingers to squeeze each chunk of fat into a thin sheet, between ⅛- and ¼-inch (3- and 6-mm) thick. Shake the contents of the bowl to ensure the sheets are well-coated in flour.",
    "Sprinkle the ice-cold sugar-salt solution over the fat and flour. Use your fingers to lightly toss the contents of the bowl around to disperse the liquid.",
    "Squeeze the shaggy mess with your fists, repeatedly and quickly, until the chunks get bigger and more cohesive.",
    "At first it will be crumbly and seem as if it won't come together, but with continued compression, you can begin to make two mounds of dough of roughly equal size. Flatten your mounds into 1-inch- (2.5-cm-) thick disks.",
    "If your kitchen is warm and the dough feels soft, you may want to chill your dough for 15 to 20 minutes before rolling. Alternatively, if it feels chilly and stiff, leave it to rest at room temperature for around 20 minutes before rolling.",
    "Prepare a clean, dry, nonporous surface by sprinkling it with the extra flour.",
    "Place a disk of dough on top of the floured surface and sprinkle it with a little more flour. Place your rolling pin in the center of the dough and roll away from yourself with firm, even pressure, but not enough force to squish the dough. As you approach the edge of the dough, use a little less pressure so that it doesn’t become too thin on the edges.",
    "Rotate the dough about 45 degrees. Place the rolling pin at the center of the disk and roll away from yourself once again.",
    "Continue to rotate and roll, adding more flour as needed to prevent the dough from sticking to the surface and/or the rolling pin, until you’ve rolled the dough to approximately ⅛ inch (3 mm) thick. If the dough starts to split on the edges, you can gently press it back together before continuing to roll it out. The finished sheet of dough should be roughly 12 inches (30.5 cm) in diameter.",
    "Transfer the sheet of dough into a pie pan, centering it so that you have at least 1 inch (2.5 cm) of extra dough all the way around the edges of the pan. While transferring, support the dough with your fingers spread out, in order to distribute the weight and prevent breakage. Alternatively, put your hand and wrist under the silicone mat along the center line of the dough circle and pick it up, letting one half of the circle hang on one side of your hand, and the other half of the dough circle hang on the other side. Lay one half of the dough along the center line of the pie pan, then fold the other half over so the silicone mat is lying over the top, then remove the mat.",
    "Once the sheet of dough is in the pan, ease it into the corner where the base of the pan meets the sides. In order to do this without stretching or breaking the dough, lift the edge of the dough with one hand to allow it to fall into place while gently pressing it into the corner with the other.",
    "If not crimping or adding a top crust, trim the crust by running a knife all the way around the outer edge of the pan."
  ],
  "notes": [],
  "nutrition_infos": []
}